{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "tags": []
   },
   "source": [
    "# GDMA Project\n",
    "Author: Julian Schelb (1069967)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import matplotlib.pyplot as plt\n",
    "import numpy as np\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Connection to the database instance"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"subatomic-shrank-Respond\"))\n",
    "database_name = \"cddb\"\n",
    "session = driver.session(database = database_name)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "***"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "tags": []
   },
   "source": [
    "### Task 4: Searching and Ranking\n",
    "\n",
    "Implement a simple search engine that enables search by artist, album and\n",
    "song name/title. The results must be ranked based on importance. It is up to\n",
    "you to come up with how the importance of each result is computed and you\n",
    "must justify your decision (it goes without saying that you need to come up\n",
    "with a meaningful definition). However, the importance should ideally take into\n",
    "account user preferences/likes. As such, this task is split in two parts:\n",
    "\n",
    "**1. Write a Cypher query that adds a relationship :LIKES between a node with**\n",
    "\n",
    "label :User and an artist, album, or song. Every user should be identified\n",
    "just by a numerical userID (no more information is necessary). If a user\n",
    "already exists in the system, no additional node should be added. After\n",
    "coming up with the necessary Cypher query, add a significant number of\n",
    "users and likes.\n",
    "\n",
    "**2. Implement a simple Python function that has the following arguments:**\n",
    "\n",
    "- the userID of the user submitting the search (the user ID may not\n",
    "exist in the database),\n",
    "- a string that contains one or more keywords for the search, and\n",
    "- an optional argument that indicates whether the search is on all or\n",
    "a specific field, i.e., artist, album, song.\n",
    "The search must return exactly 10 results.\n",
    "\n",
    "Python must only be used to call the database. You should not write any\n",
    "code in Python that implements functionality necessary for the task. However,\n",
    "submitting multiple queries in the same function call is allowed. Also, for this\n",
    "task of the project, you are not only allowed but also encouraged to use functions\n",
    "from the GDS library of Neo4j. Hence, before making any decisions, have a\n",
    "careful look at the available functions. Again, you have to justify the use of any\n",
    "function that you employ"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "***"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Adding Example Users"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Function for creating a user node:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "def createUser(driver, database_name: str = \"cddb\", user_id: int = None):\n",
    "    \n",
    "    if type(user_id) is not int:\n",
    "        raise TypeError('User ID must be a Number')\n",
    "    if user_id < 0:\n",
    "        raise ValueError('User ID must be a positive Number')\n",
    "        \n",
    "        \n",
    "    query = \"\"\"\n",
    "    MERGE (u:User {id:  $user_id})\n",
    "    RETURN u.id as user_id\n",
    "    \"\"\"\n",
    "    \n",
    "    with driver.session(database = database_name) as session:\n",
    "        session.run(query, user_id = user_id)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "createUser(driver, user_id = 99)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Function for deleting a user node and all relations:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "def deleteUser(driver, database_name: str = \"cddb\", user_id: int = None):\n",
    "    \n",
    "    if type(user_id) is not int:\n",
    "        raise TypeError('User ID must be a Number')\n",
    "    if user_id < 0:\n",
    "        raise ValueError('User ID must be a positive Number')\n",
    "        \n",
    "        \n",
    "    query = \"\"\"\n",
    "    MATCH (u:User)\n",
    "    WHERE u.id = $user_id\n",
    "    DETACH DELETE u\n",
    "    \"\"\"\n",
    "    \n",
    "    with driver.session(database = database_name) as session:\n",
    "        session.run(query, user_id = user_id)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "deleteUser(driver, user_id = 99)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Function for letting user like a song, album or artist:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "def addLike(driver, database_name: str = \"cddb\", user_id: int = None, node_id: int = None, node_label: str = None):\n",
    "    \n",
    "    # Validate user_id\n",
    "    if type(user_id) is not int:\n",
    "        raise TypeError('User ID must be a Number')\n",
    "    if user_id < 0:\n",
    "        raise ValueError('User ID must be a positive Number')\n",
    "    \n",
    "    # Validate node_id\n",
    "    if type(node_id) is not int:\n",
    "        raise TypeError('Node ID must be a Number')\n",
    "    if node_id < 0:\n",
    "        raise ValueError('Node ID must be a positive Number')\n",
    "        \n",
    "    # Validate node_label    \n",
    "    if node_label not in [\"Song\", \"Album\", \"Artist\"]:\n",
    "        raise ValueError('Node type must be Song, Album or Artist')\n",
    "    \n",
    "    createUser(driver, user_id = user_id)\n",
    "    \n",
    "    query = f\"\"\"\n",
    "    MATCH (u:User)\n",
    "    WHERE u.id = {user_id}\n",
    "    MATCH (n: {node_label})\n",
    "    WHERE n.id = {node_id}\n",
    "    MERGE (u)-[r:LIKES]->(n)\n",
    "    \"\"\"\n",
    "    \n",
    "    with driver.session(database = database_name) as session:\n",
    "        session.run(query)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "addLike(driver, user_id = 99, node_id = 10, node_label = \"Song\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Function for creating an example user who listens to a given genre:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "def createExampleUser(driver, user_id: int = 1, genre: str = \"rock\", limit: int = 50):\n",
    "    \n",
    "    ####### CREATE USER #######\n",
    "    \n",
    "    deleteUser(driver, user_id = user_id)\n",
    "    createUser(driver, user_id = user_id)\n",
    "    \n",
    "    ####### LIKE SONGS #######\n",
    "    \n",
    "    query = \"\"\"\n",
    "    MATCH (g:Genre)<-[r:BELONGS_TO]-(c:CD)\n",
    "    MATCH (c)-[r2:CONTAINS]->(s:Song)\n",
    "    WHERE g.genre = $genre\n",
    "    WITH DISTINCT s \n",
    "    LIMIT $limit\n",
    "    RETURN s.id as id\n",
    "    \"\"\"\n",
    "    \n",
    "    with driver.session(database = database_name) as session:\n",
    "        results = session.run(query, user_id = user_id, genre = genre, limit = limit)\n",
    "        for row in results:\n",
    "            addLike(driver, user_id = user_id, node_id = row[\"id\"], node_label = \"Song\")\n",
    "            \n",
    "    ####### LIKE ALBUMS #######\n",
    "    \n",
    "    query = \"\"\"\n",
    "    MATCH (g:Genre)<-[r:BELONGS_TO]-(c:CD)\n",
    "    MATCH (c)-[r2:CONTAINS]->(s:Album)\n",
    "    WHERE g.genre = $genre\n",
    "    WITH DISTINCT s \n",
    "    LIMIT $limit\n",
    "    RETURN s.id as id\n",
    "    \"\"\"\n",
    "    \n",
    "    with driver.session(database = database_name) as session:\n",
    "        results = session.run(query, user_id = user_id, genre = genre, limit = limit)\n",
    "        for row in results:\n",
    "            addLike(driver, user_id = user_id, node_id = row[\"id\"], node_label = \"Album\")\n",
    "            \n",
    "    ####### LIKE ARTISTS #######\n",
    "    \n",
    "    query = \"\"\"\n",
    "    MATCH (g:Genre)<-[r:BELONGS_TO]-(c:CD)\n",
    "    MATCH (c)-[r2:CONTAINS]->(s:Artist)\n",
    "    WHERE g.genre = $genre\n",
    "    WITH DISTINCT s \n",
    "    LIMIT $limit\n",
    "    RETURN s.id as id\n",
    "    \"\"\"\n",
    "    \n",
    "    with driver.session(database = database_name) as session:\n",
    "        results = session.run(query, user_id = user_id, genre = genre, limit = limit)\n",
    "        for row in results:\n",
    "            addLike(driver, user_id = user_id, node_id = row[\"id\"], node_label = \"Artist\")\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "createExampleUser(driver, user_id = 99, genre = \"rock\", limit = 50)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Adding some Likes to emulate User Preference:**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "# User 1 likes \"Rock\" music\n",
    "createExampleUser(driver, user_id = 1, genre = \"rock\", limit = 50)\n",
    "# User 2 likes \"classic\" music\n",
    "createExampleUser(driver, user_id = 2, genre = \"classic\", limit = 50)\n",
    "# User 3 likes \"pop\" music\n",
    "createExampleUser(driver, user_id = 3, genre = \"pop\", limit = 50)\n",
    "# User 4 likes \"hip-hop\" music\n",
    "createExampleUser(driver, user_id = 4, genre = \"hip-hop\", limit = 50)\n",
    "# User 5 likes \"hip-hop\" music\n",
    "createExampleUser(driver, user_id = 5, genre = \"hard rock\", limit = 50)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Generated example user who likes albums, artists and songs associated with a given genre:\n",
    "![](Figures/likes.png)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "***"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "tags": []
   },
   "source": [
    "#### Implementation \n",
    "\n",
    "##### Design Decisions\n",
    "\n",
    "The search engine accepts a user supplied query string and returns an ordered list of the most relevant CDs. Three features are considered to rank CDs by relevance: Text similarity with the query string, user-preferred CDs and user-preferred genres. Since the user's preference is known prior to searching, the corresponding preference scores can be computed in advance. This leads to a two stage process:\n",
    "\n",
    "###### Stage 1: Precompute User Preference\n",
    "\n",
    "Preferred CDs and genres are determined based on content previously liked by the user.\n",
    "\n",
    "To find preferred CDs, a subgraph of artists, albums and songs liked by the user and associated CDs is extracted. Subsequently, a centrality score is calculated for each node in both. The basic idea is that the most relevant CDs will have a high centrality score.\n",
    "\n",
    "To determine the preferred genres, we count how often genres are associated with the user's liked nodes. The basic idea is that the user prefers content of a few genres and therefore likes many albums, artists and songs belonging to those genres. \n",
    "\n",
    "###### Stage 2: Search based on User Input\n",
    "\n",
    "The most significant feature is the text similarity to the search query provided by the user. By using \"Full-Text Indices\" of Neo4J, the text similarity between artist name, album title and song title is calculated. The similarity score of all nodes associated with a CD are aggregated and used as a \"Content Match Score\". \n",
    "\n",
    "The \"Content Match Score\" is then combined with the previously computed user specific \"CD Preference Score\" and \"Genre Preference Score\". The ten CDs with the highest combined score are presented to the user. \n",
    " \n",
    "\n",
    "![](Figures/search.png)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "***"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Stage 1: Precompute User Preference"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Function for creating graph projection with all nodes liked by the user and CDs connected to those nodes."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "def loadUserPreferences(driver, database_name = \"cddb\", user_id: int = None):\n",
    "        \n",
    "    ####### DELETE EXISTING PROJECTION #######\n",
    "    \n",
    "    query_delete = \"\"\"\n",
    "    CALL gds.graph.drop('searchdomain_preference', false) \n",
    "    YIELD graphName \n",
    "    RETURN graphName\n",
    "    \"\"\"\n",
    "    \n",
    "    ####### CREATE NEW PROJECTION #######\n",
    "    \n",
    "    query_create = f\"\"\"\n",
    "    // CREATE NEW PROJECTION WITH SEARCH RELEVANT SUB GRAPH\n",
    "    CALL gds.graph.project.cypher(\n",
    "      'searchdomain_preference',\n",
    "      \n",
    "      ' // Liked Artists, Albums and Songs\n",
    "        MATCH (u:User)-[:LIKES]->(n) \n",
    "        WHERE u.id = {user_id}\n",
    "            AND (n:Song OR n:Album OR n:Artist) \n",
    "        RETURN id(n) AS id, labels(n) AS labels \n",
    "        UNION\n",
    "        // CDs linked to liked Artists, Albums and Songs\n",
    "        MATCH (u:User)-[:LIKES]->(x)-[:APPEARED_ON]->(n:CD) \n",
    "        WHERE u.id = {user_id}\n",
    "        RETURN id(n) AS id, labels(n) AS labels ',\n",
    "\n",
    "        'MATCH (u:User)-[:LIKES]->(n)\n",
    "        WHERE u.id = {user_id}\n",
    "        AND (n:CD OR n:Song OR n:Album OR n:Artist) \n",
    "        MATCH (n)-[r:APPEARED_ON]->(m:CD) \n",
    "        RETURN id(n) AS source, id(m) AS target, type(r) AS type' \n",
    "    )\n",
    "    YIELD\n",
    "      graphName, nodeCount AS nodes, relationshipCount AS rels\n",
    "    RETURN graphName, nodes, rels\n",
    "    \"\"\"\n",
    "\n",
    "    with driver.session(database = database_name) as session:\n",
    "        results = session.run(query_delete)\n",
    "        results = session.run(query_create)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "loadUserPreferences(driver, user_id = 1)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Calculate how much a user preferes a CD using the centrality of a CD in the subgraph ob liked nodes by the user as importance measure."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "def calcPreferredCD(driver, database_name = \"cddb\", user_id: int = None):\n",
    "    \n",
    "    ####### CHECK IF PROJECTION EXISTS #######\n",
    "    \n",
    "    query_check = \"\"\"\n",
    "    CALL gds.graph.exists(\"searchdomain_preference\")\n",
    "    YIELD graphName, exists\n",
    "    RETURN graphName, exists\n",
    "    \"\"\"\n",
    "    \n",
    "    ####### DELETE EXISTING RELATIONS #######\n",
    "    \n",
    "    query_delete = \"\"\"\n",
    "    WITH $user_id as userID \n",
    "    MATCH (:User {id: userID})-[r:PREFERRES]->(c:CD) \n",
    "    DELETE r\n",
    "    \"\"\"\n",
    "    \n",
    "    ####### CREATE NEW RELATIONS #######\n",
    "    \n",
    "    query_create = \"\"\"\n",
    "    WITH $user_id as userId\n",
    "    CALL gds.eigenvector.stream('searchdomain_preference')\n",
    "    YIELD nodeId, score\n",
    "    WITH gds.util.asNode(nodeId).id AS nodeId, score, userId\n",
    "    MATCH (c:CD {id: nodeId})\n",
    "    MATCH (u:User {id: userId})\n",
    "    MERGE (c)<-[r:PREFERRES {score: score}]-(u)\n",
    "    \"\"\"\n",
    "\n",
    "    with driver.session(database = database_name) as session:\n",
    "        \n",
    "        # Check if projection exists\n",
    "        results = session.run(query_check, user_id = user_id)\n",
    "        graph_exists = bool(results.single()[\"exists\"])\n",
    "\n",
    "        if graph_exists:\n",
    "            results = session.run(query_delete, user_id = user_id)\n",
    "            results = session.run(query_create, user_id = user_id)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "calcPreferredCD(driver, user_id = 1)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Calculate how much a user prefers a genre by counting how many liked nodes are associated with which genre."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "def calcPreferredGenre(driver, database_name = \"cddb\", user_id: int = None):\n",
    "    \n",
    "    ####### DELETE EXISTING RELATIONS #######\n",
    "    \n",
    "    query_delete = \"\"\"\n",
    "    WITH $user_id as userID \n",
    "    MATCH (:User {id: userID})-[r:PREFERRES]->(g:Genre) \n",
    "    DELETE r\n",
    "    \"\"\"\n",
    "    \n",
    "    ####### CREATE NEW RELATIONS #######\n",
    "    \n",
    "    query_create = \"\"\"\n",
    "    WITH $user_id as userID\n",
    "    \n",
    "    // Determine total count for normalization\n",
    "    CALL {\n",
    "        MATCH (u:User)-[r1:LIKES]->(n:Album)\n",
    "        MATCH (n)-[r2:APPEARED_ON]-(c:CD)\n",
    "        MATCH (c)-[:BELONGS_TO]->(g:Genre) \n",
    "        WHERE u.id = 1\n",
    "        RETURN COUNT(DISTINCT c.id) as countTotal\n",
    "    }\n",
    "    \n",
    "    // Determine count per genre\n",
    "    MATCH (u:User)-[r1:LIKES]->(n:Album)\n",
    "    MATCH (n)-[r2:APPEARED_ON]-(c:CD)\n",
    "    MATCH (c)-[:BELONGS_TO]->(g:Genre) \n",
    "    WHERE u.id = userID\n",
    "    WITH g, c, u, countTotal, userID\n",
    "    WITH \n",
    "        DISTINCT g.id as id, g.genre as genre, u, g, \n",
    "        count(DISTINCT c.id) as countGenre, countTotal,\n",
    "        userID\n",
    "    WITH id, genre, userID, u, g,  countGenre, countTotal, \n",
    "    (toFloat(countGenre) / toFloat(countTotal)) as prob\n",
    "    \n",
    "    // Create relation between user and genre\n",
    "    MERGE (u)-[:PREFERRES {score: prob}]->(g)\n",
    "    RETURN *\n",
    "    ORDER BY countGenre DESC\n",
    "    \"\"\"\n",
    "\n",
    "    with driver.session(database = database_name) as session:\n",
    "        results = session.run(query_delete, user_id = user_id)\n",
    "        results = session.run(query_create, user_id = user_id)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "calcPreferredGenre(driver, user_id = 1)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Function for precomputing preferences per user:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "def processUserPreference(driver, database_name = \"cddb\"):\n",
    "\n",
    "    query = \"\"\"\n",
    "    MATCH (u:User)\n",
    "    RETURN u.id as userID\n",
    "    \"\"\"\n",
    "\n",
    "    with driver.session(database = database_name) as session:\n",
    "        results = session.run(query)\n",
    "        for row in results:\n",
    "            user_id = row[\"userID\"]\n",
    "            print(f\"Precompute Preferences for User {user_id}\")\n",
    "            loadUserPreferences(driver, user_id = user_id)\n",
    "            calcPreferredCD(driver, user_id = user_id)\n",
    "            calcPreferredGenre(driver, user_id = user_id)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Precompute Preferences for User 1\n",
      "Precompute Preferences for User 2\n",
      "Precompute Preferences for User 99\n",
      "Precompute Preferences for User 3\n",
      "Precompute Preferences for User 4\n",
      "Precompute Preferences for User 5\n"
     ]
    }
   ],
   "source": [
    "processUserPreference(driver)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Users prefere CDs. Preference score is based on liked nodes:\n",
    "![](Figures/preferred_cds.png)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Users prefere Genres. Preference score is based on liked nodes:\n",
    "![](Figures/preferred_genres.png)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "***"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Stage 2: Search based on User Input"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Function for finding similar nodes (artists, albums, songs) based on text similarity to the search input. CDs connected to many similar nodes are regarded as more important. This content match score is combined with the user preference score for CDs and genre. Finally, a re-ranked list of relevant CDs is augmented with some meta information and presented to the user. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "def searchFor(driver, database_name = \"cddb\", user_id = 1, search_input = \"\", search_mask = \"all\"):\n",
    "\n",
    "    query = \"\"\"// Search input\n",
    "    WITH\n",
    "    //1 as userID,\n",
    "    //'Jimi Hendrix purple haze are you experienced' as searchQuery,\n",
    "    //'Ludwig van Beethoven Für Elise Symphony' as searchQuery,\n",
    "    //'all' as searchMask\n",
    "    $user_id as userID,\n",
    "    $search_input as searchQuery,\n",
    "    $search_mask as searchMask\n",
    "    \n",
    "    // Find matching artists, songs and albums \n",
    "    // based on text similarity\n",
    "    CALL {\n",
    "        // Artists\n",
    "        WITH searchQuery, searchMask\n",
    "        CALL db.index.fulltext.queryNodes('artists', searchQuery) \n",
    "        YIELD node, score\n",
    "        WHERE searchMask = 'all' or searchMask = 'artists'\n",
    "        RETURN node, score\n",
    "        UNION \n",
    "\n",
    "        // Songs\n",
    "        WITH searchQuery, searchMask\n",
    "        CALL db.index.fulltext.queryNodes('songs', searchQuery) \n",
    "        YIELD node, score\n",
    "        WHERE searchMask = 'all' or searchMask = 'songs'\n",
    "        RETURN node, score\n",
    "        UNION \n",
    "\n",
    "        // Albums\n",
    "        WITH searchQuery, searchMask\n",
    "        CALL db.index.fulltext.queryNodes('albums', searchQuery) \n",
    "        YIELD node, score\n",
    "        WHERE searchMask = 'all' or searchMask = 'albums'\n",
    "        RETURN node, score\n",
    "    }\n",
    "    WITH node, score, userID\n",
    "    MATCH (node)-[r:APPEARED_ON]->(c:CD)\n",
    "    WITH DISTINCT c.id as id, c,  sum(score) as score_content, userID\n",
    "\n",
    "    // Get more information about the CDs \n",
    "    MATCH (c)-[:CONTAINS]->(ar:Artist)\n",
    "    MATCH (c)-[:CONTAINS]->(ab:Album)\n",
    "    MATCH (c)-[:CONTAINS]->(so:Song)\n",
    "    MATCH (c)-[:BELONGS_TO]->(ge:Genre)\n",
    "    OPTIONAL MATCH (c)<-[r:PREFERRES]-(u:User {id: userID})\n",
    "    OPTIONAL MATCH (ge)<-[r2:PREFERRES]-(u2:User {id: userID})\n",
    "\n",
    "    // Compile final list of search results\n",
    "    RETURN \n",
    "    id, userID as user, score_content, sum(r.score) as score_pref, r2.score as score_genre ,\n",
    "    score_content + (sum(r.score)  * score_content) + (COALESCE(r2.score, 0)  * score_content) as score_combined,\n",
    "    collect(DISTINCT ge.genre) as genres,\n",
    "    collect(DISTINCT ar.artist) as artists,\n",
    "    collect(DISTINCT ab.album) as albums, \n",
    "    collect(DISTINCT so.song) as songs\n",
    "\n",
    "    ORDER BY score_combined DESC\n",
    "    LIMIT 100\"\"\"\n",
    "\n",
    "    results = pd.DataFrame([dict(_) for _ in session.run(query, user_id = user_id, \n",
    "                                                         search_input = search_input, \n",
    "                                                         search_mask = search_mask)])\n",
    "    return results\n",
    "    #dtf_data.head(30)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "***"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "tags": []
   },
   "source": [
    "#### Example Search Queries"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Exampe Query 1: Jimmi Hendrix"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>user</th>\n",
       "      <th>score_content</th>\n",
       "      <th>score_pref</th>\n",
       "      <th>score_genre</th>\n",
       "      <th>score_combined</th>\n",
       "      <th>genres</th>\n",
       "      <th>artists</th>\n",
       "      <th>albums</th>\n",
       "      <th>songs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>677</td>\n",
       "      <td>1</td>\n",
       "      <td>31.538232</td>\n",
       "      <td>0.566320</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>70.317167</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[remember, third stone from the sun, can you s...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>136907</td>\n",
       "      <td>1</td>\n",
       "      <td>31.538232</td>\n",
       "      <td>0.554190</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>69.934627</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[stone free, love or confusion, i don't live t...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>35734</td>\n",
       "      <td>1</td>\n",
       "      <td>31.538232</td>\n",
       "      <td>0.554190</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>69.934627</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[remember, i don't live today, may this be lov...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>46232</td>\n",
       "      <td>1</td>\n",
       "      <td>26.723665</td>\n",
       "      <td>0.692738</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>62.961037</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix the best of jimi hendrix]</td>\n",
       "      <td>[foxey lady, if 6 was 9, dolly dagger, night b...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>162186</td>\n",
       "      <td>1</td>\n",
       "      <td>26.723665</td>\n",
       "      <td>0.658101</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>62.035412</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix: the best of jimi hendrix]</td>\n",
       "      <td>[if six was nine, foxey lady, night bird flyin...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>7923</td>\n",
       "      <td>1</td>\n",
       "      <td>56.690317</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.071429</td>\n",
       "      <td>60.739626</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[signature licks]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[purple haze (solo);, purple haze (outro);, he...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>1936</td>\n",
       "      <td>1</td>\n",
       "      <td>24.346131</td>\n",
       "      <td>0.692738</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>57.359560</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix]</td>\n",
       "      <td>[bold as love, if 6 was 9, dolly dagger, night...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>33321</td>\n",
       "      <td>1</td>\n",
       "      <td>28.278246</td>\n",
       "      <td>0.212370</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>53.039673</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[astro man(alchemy); - studio outtakes 1966-68]</td>\n",
       "      <td>[la pouppee qui fait non (no no no no);, cat t...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>2023</td>\n",
       "      <td>1</td>\n",
       "      <td>26.723665</td>\n",
       "      <td>0.692738</td>\n",
       "      <td>0.071429</td>\n",
       "      <td>47.144990</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix - the best of jimi hendrix]</td>\n",
       "      <td>[dolly dagger, bold as love, night bird flying...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>17266</td>\n",
       "      <td>1</td>\n",
       "      <td>20.769874</td>\n",
       "      <td>0.346369</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>41.739848</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[3rd stone from the sun, love or confusion, i ...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       id  user  score_content  score_pref  score_genre  score_combined  \\\n",
       "0     677     1      31.538232    0.566320     0.663265       70.317167   \n",
       "1  136907     1      31.538232    0.554190     0.663265       69.934627   \n",
       "2   35734     1      31.538232    0.554190     0.663265       69.934627   \n",
       "3   46232     1      26.723665    0.692738     0.663265       62.961037   \n",
       "4  162186     1      26.723665    0.658101     0.663265       62.035412   \n",
       "5    7923     1      56.690317    0.000000     0.071429       60.739626   \n",
       "6    1936     1      24.346131    0.692738     0.663265       57.359560   \n",
       "7   33321     1      28.278246    0.212370     0.663265       53.039673   \n",
       "8    2023     1      26.723665    0.692738     0.071429       47.144990   \n",
       "9   17266     1      20.769874    0.346369     0.663265       41.739848   \n",
       "\n",
       "    genres            artists  \\\n",
       "0   [rock]     [jimi hendrix]   \n",
       "1   [rock]     [jimi hendrix]   \n",
       "2   [rock]     [jimi hendrix]   \n",
       "3   [rock]     [jimi hendrix]   \n",
       "4   [rock]     [jimi hendrix]   \n",
       "5  [blues]  [signature licks]   \n",
       "6   [rock]     [jimi hendrix]   \n",
       "7   [rock]     [jimi hendrix]   \n",
       "8  [blues]     [jimi hendrix]   \n",
       "9   [rock]     [jimi hendrix]   \n",
       "\n",
       "                                            albums  \\\n",
       "0                            [are you experienced]   \n",
       "1                            [are you experienced]   \n",
       "2                            [are you experienced]   \n",
       "3    [experience hendrix the best of jimi hendrix]   \n",
       "4   [experience hendrix: the best of jimi hendrix]   \n",
       "5                                   [jimi hendrix]   \n",
       "6                             [experience hendrix]   \n",
       "7  [astro man(alchemy); - studio outtakes 1966-68]   \n",
       "8  [experience hendrix - the best of jimi hendrix]   \n",
       "9                            [are you experienced]   \n",
       "\n",
       "                                               songs  \n",
       "0  [remember, third stone from the sun, can you s...  \n",
       "1  [stone free, love or confusion, i don't live t...  \n",
       "2  [remember, i don't live today, may this be lov...  \n",
       "3  [foxey lady, if 6 was 9, dolly dagger, night b...  \n",
       "4  [if six was nine, foxey lady, night bird flyin...  \n",
       "5  [purple haze (solo);, purple haze (outro);, he...  \n",
       "6  [bold as love, if 6 was 9, dolly dagger, night...  \n",
       "7  [la pouppee qui fait non (no no no no);, cat t...  \n",
       "8  [dolly dagger, bold as love, night bird flying...  \n",
       "9  [3rd stone from the sun, love or confusion, i ...  "
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = searchFor(driver, database_name = \"cddb\", \n",
    "                    user_id = 1,\n",
    "                    search_input = \"Jimi Hendrix purple haze are you experienced\", \n",
    "                    search_mask = \"all\")\n",
    "results.head(10)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Exampe Query 2: Ludwig van Beethoven"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>user</th>\n",
       "      <th>score_content</th>\n",
       "      <th>score_pref</th>\n",
       "      <th>score_genre</th>\n",
       "      <th>score_combined</th>\n",
       "      <th>genres</th>\n",
       "      <th>artists</th>\n",
       "      <th>albums</th>\n",
       "      <th>songs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>140152</td>\n",
       "      <td>2</td>\n",
       "      <td>171.903979</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.510204</td>\n",
       "      <td>259.610091</td>\n",
       "      <td>[classical]</td>\n",
       "      <td>[pollini maurizio]</td>\n",
       "      <td>[kaiser 5.2]</td>\n",
       "      <td>[erläuterungen von joachim kaiser mit musikbei...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>117461</td>\n",
       "      <td>2</td>\n",
       "      <td>42.674408</td>\n",
       "      <td>0.090465</td>\n",
       "      <td>0.510204</td>\n",
       "      <td>68.307598</td>\n",
       "      <td>[classical]</td>\n",
       "      <td>[ludwig van beethoven]</td>\n",
       "      <td>[symphony no. 3 and no. 8]</td>\n",
       "      <td>[beethoven, symphony no. 3 hero, op. 55, beeth...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>35385</td>\n",
       "      <td>2</td>\n",
       "      <td>64.986593</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>NaN</td>\n",
       "      <td>64.986593</td>\n",
       "      <td>[comedy]</td>\n",
       "      <td>[kai + sven]</td>\n",
       "      <td>[eins dreissig]</td>\n",
       "      <td>[ein praktikant für alle fälle bundesgrenzschu...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>49068</td>\n",
       "      <td>2</td>\n",
       "      <td>40.887329</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.510204</td>\n",
       "      <td>61.748212</td>\n",
       "      <td>[classical]</td>\n",
       "      <td>[strauss]</td>\n",
       "      <td>[alpine symphony op64 - ashkenazy]</td>\n",
       "      <td>[an alpine symphony op64 11 auf dem gletscher,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>128963</td>\n",
       "      <td>2</td>\n",
       "      <td>37.272938</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.510204</td>\n",
       "      <td>56.289743</td>\n",
       "      <td>[classical]</td>\n",
       "      <td>[classical]</td>\n",
       "      <td>[kamien, roger - music an appreciation - 5th e...</td>\n",
       "      <td>[mozart eine kleine nachtmusik in g major, k. ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>125232</td>\n",
       "      <td>2</td>\n",
       "      <td>35.750519</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.510204</td>\n",
       "      <td>53.990580</td>\n",
       "      <td>[classical]</td>\n",
       "      <td>[orkest van de weense staatsopera olv anton pa...</td>\n",
       "      <td>[sissi, de muziek van een sprookjes-keizerin]</td>\n",
       "      <td>[champagne polka van johan strauss, wiener blu...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>48561</td>\n",
       "      <td>2</td>\n",
       "      <td>34.394371</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.510204</td>\n",
       "      <td>51.942519</td>\n",
       "      <td>[classical]</td>\n",
       "      <td>[jan decleir]</td>\n",
       "      <td>[peter &amp; de wolf]</td>\n",
       "      <td>[voorstelling van de steeldrum, de vlinder van...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>49477</td>\n",
       "      <td>2</td>\n",
       "      <td>34.323475</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.510204</td>\n",
       "      <td>51.835453</td>\n",
       "      <td>[classical]</td>\n",
       "      <td>[mozart, wolfgang amadeus]</td>\n",
       "      <td>[mozart - complete symphoniesof12 [sir neville...</td>\n",
       "      <td>[symphony 13 in f, kv 11 3. menuetto, symphony...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>44122</td>\n",
       "      <td>2</td>\n",
       "      <td>29.651714</td>\n",
       "      <td>0.214854</td>\n",
       "      <td>0.510204</td>\n",
       "      <td>51.150928</td>\n",
       "      <td>[classical]</td>\n",
       "      <td>[mozart]</td>\n",
       "      <td>[mozart: salzburg symphonies]</td>\n",
       "      <td>[symphony no 6 in f, k 43 menuetto, symphony n...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>112843</td>\n",
       "      <td>2</td>\n",
       "      <td>33.304469</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.510204</td>\n",
       "      <td>50.296544</td>\n",
       "      <td>[classical]</td>\n",
       "      <td>[wilhelm furtwängler]</td>\n",
       "      <td>[beethoven furtwängler]</td>\n",
       "      <td>[ludwig van beethoven symphony no.7 in a major...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       id  user  score_content  score_pref  score_genre  score_combined  \\\n",
       "0  140152     2     171.903979    0.000000     0.510204      259.610091   \n",
       "1  117461     2      42.674408    0.090465     0.510204       68.307598   \n",
       "2   35385     2      64.986593    0.000000          NaN       64.986593   \n",
       "3   49068     2      40.887329    0.000000     0.510204       61.748212   \n",
       "4  128963     2      37.272938    0.000000     0.510204       56.289743   \n",
       "5  125232     2      35.750519    0.000000     0.510204       53.990580   \n",
       "6   48561     2      34.394371    0.000000     0.510204       51.942519   \n",
       "7   49477     2      34.323475    0.000000     0.510204       51.835453   \n",
       "8   44122     2      29.651714    0.214854     0.510204       51.150928   \n",
       "9  112843     2      33.304469    0.000000     0.510204       50.296544   \n",
       "\n",
       "        genres                                            artists  \\\n",
       "0  [classical]                                 [pollini maurizio]   \n",
       "1  [classical]                             [ludwig van beethoven]   \n",
       "2     [comedy]                                       [kai + sven]   \n",
       "3  [classical]                                          [strauss]   \n",
       "4  [classical]                                        [classical]   \n",
       "5  [classical]  [orkest van de weense staatsopera olv anton pa...   \n",
       "6  [classical]                                      [jan decleir]   \n",
       "7  [classical]                         [mozart, wolfgang amadeus]   \n",
       "8  [classical]                                           [mozart]   \n",
       "9  [classical]                              [wilhelm furtwängler]   \n",
       "\n",
       "                                              albums  \\\n",
       "0                                       [kaiser 5.2]   \n",
       "1                         [symphony no. 3 and no. 8]   \n",
       "2                                    [eins dreissig]   \n",
       "3                 [alpine symphony op64 - ashkenazy]   \n",
       "4  [kamien, roger - music an appreciation - 5th e...   \n",
       "5      [sissi, de muziek van een sprookjes-keizerin]   \n",
       "6                                  [peter & de wolf]   \n",
       "7  [mozart - complete symphoniesof12 [sir neville...   \n",
       "8                      [mozart: salzburg symphonies]   \n",
       "9                            [beethoven furtwängler]   \n",
       "\n",
       "                                               songs  \n",
       "0  [erläuterungen von joachim kaiser mit musikbei...  \n",
       "1  [beethoven, symphony no. 3 hero, op. 55, beeth...  \n",
       "2  [ein praktikant für alle fälle bundesgrenzschu...  \n",
       "3  [an alpine symphony op64 11 auf dem gletscher,...  \n",
       "4  [mozart eine kleine nachtmusik in g major, k. ...  \n",
       "5  [champagne polka van johan strauss, wiener blu...  \n",
       "6  [voorstelling van de steeldrum, de vlinder van...  \n",
       "7  [symphony 13 in f, kv 11 3. menuetto, symphony...  \n",
       "8  [symphony no 6 in f, k 43 menuetto, symphony n...  \n",
       "9  [ludwig van beethoven symphony no.7 in a major...  "
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = searchFor(driver, database_name = \"cddb\", \n",
    "                    user_id = 2,\n",
    "                    search_input = \"Ludwig van Beethoven Für Elise Symphony\", \n",
    "                    search_mask = \"all\")\n",
    "results.head(10)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
