{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "tags": []
   },
   "source": [
    "# GDMA Project\n",
    "Author: Julian Schelb (1069967)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import matplotlib.pyplot as plt\n",
    "import numpy as np\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Connection to the database instance"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"subatomic-shrank-Respond\"))\n",
    "database_name = \"cddb\"\n",
    "session = driver.session(database = database_name)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "tags": []
   },
   "source": [
    "### Task 4: Searching and Ranking\n",
    "\n",
    "Implement a simple search engine that enables search by artist, album and\n",
    "song name/title. The results must be ranked based on importance. It is up to\n",
    "you to come up with how the importance of each result is computed and you\n",
    "must justify your decision (it goes without saying that you need to come up\n",
    "with a meaningful definition). However, the importance should ideally take into\n",
    "account user preferences/likes. As such, this task is split in two parts:\n",
    "\n",
    "**1. Write a Cypher query that adds a relationship :LIKES between a node with**\n",
    "\n",
    "label :User and an artist, album, or song. Every user should be identified\n",
    "just by a numerical userID (no more information is necessary). If a user\n",
    "already exists in the system, no additional node should be added. After\n",
    "coming up with the necessary Cypher query, add a significant number of\n",
    "users and likes.\n",
    "\n",
    "**2. Implement a simple Python function that has the following arguments:**\n",
    "\n",
    "- the userID of the user submitting the search (the user ID may not\n",
    "exist in the database),\n",
    "- a string that contains one or more keywords for the search, and\n",
    "- an optional argument that indicates whether the search is on all or\n",
    "a specific field, i.e., artist, album, song.\n",
    "The search must return exactly 10 results.\n",
    "\n",
    "Python must only be used to call the database. You should not write any\n",
    "code in Python that implements functionality necessary for the task. However,\n",
    "submitting multiple queries in the same function call is allowed. Also, for this\n",
    "task of the project, you are not only allowed but also encouraged to use functions\n",
    "from the GDS library of Neo4j. Hence, before making any decisions, have a\n",
    "careful look at the available functions. Again, you have to justify the use of any\n",
    "function that you employ"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Adding Example Users"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Function for creating a user node:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "def createUser(driver, database_name: str = \"cddb\", user_id: int = None):\n",
    "    \n",
    "    if type(user_id) is not int:\n",
    "        raise TypeError('User ID must be a Number')\n",
    "    if user_id < 0:\n",
    "        raise ValueError('User ID must be a positive Number')\n",
    "        \n",
    "        \n",
    "    query = \"\"\"\n",
    "    MERGE (u:User {id:  $user_id})\n",
    "    RETURN u.id as user_id\n",
    "    \"\"\"\n",
    "    \n",
    "    with driver.session(database = database_name) as session:\n",
    "        session.run(query, user_id = user_id)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "createUser(driver, user_id = 99)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Function for deleting a user node and all relations:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "def deleteUser(driver, database_name: str = \"cddb\", user_id: int = None):\n",
    "    \n",
    "    if type(user_id) is not int:\n",
    "        raise TypeError('User ID must be a Number')\n",
    "    if user_id < 0:\n",
    "        raise ValueError('User ID must be a positive Number')\n",
    "        \n",
    "        \n",
    "    query = \"\"\"\n",
    "    MATCH (u:User)\n",
    "    WHERE u.id = $user_id\n",
    "    DETACH DELETE u\n",
    "    \"\"\"\n",
    "    \n",
    "    with driver.session(database = database_name) as session:\n",
    "        session.run(query, user_id = user_id)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "deleteUser(driver, user_id = 99)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Function for letting user like a song, album or artist:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "def addLike(driver, database_name: str = \"cddb\", user_id: int = None, node_id: int = None, node_label: str = None):\n",
    "    \n",
    "    # Validate user_id\n",
    "    if type(user_id) is not int:\n",
    "        raise TypeError('User ID must be a Number')\n",
    "    if user_id < 0:\n",
    "        raise ValueError('User ID must be a positive Number')\n",
    "    \n",
    "    # Validate node_id\n",
    "    if type(node_id) is not int:\n",
    "        raise TypeError('Node ID must be a Number')\n",
    "    if node_id < 0:\n",
    "        raise ValueError('Node ID must be a positive Number')\n",
    "        \n",
    "    # Validate node_label    \n",
    "    if node_label not in [\"Song\", \"Album\", \"Artist\"]:\n",
    "        raise ValueError('Node type must be Song, Album or Artist')\n",
    "    \n",
    "    createUser(driver, user_id = user_id)\n",
    "    \n",
    "    query = f\"\"\"\n",
    "    MATCH (u:User)\n",
    "    WHERE u.id = {user_id}\n",
    "    MATCH (n: {node_label})\n",
    "    WHERE n.id = {node_id}\n",
    "    MERGE (u)-[r:LIKES]->(n)\n",
    "    \"\"\"\n",
    "    \n",
    "    with driver.session(database = database_name) as session:\n",
    "        session.run(query)\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "addLike(driver, user_id = 99, node_id = 10, node_label = \"Song\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Function for creating an example user who listens to a given genre:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "def createExampleUser(driver, user_id: int = 1, genre: str = \"rock\", limit: int = 50):\n",
    "    \n",
    "    ####### CREATE USER #######\n",
    "    \n",
    "    deleteUser(driver, user_id = user_id)\n",
    "    createUser(driver, user_id = user_id)\n",
    "    \n",
    "    ####### LIKE SONGS #######\n",
    "    \n",
    "    query = \"\"\"\n",
    "    MATCH (g:Genre)<-[r:BELONGS_TO]-(c:CD)\n",
    "    MATCH (c)-[r2:CONTAINS]->(s:Song)\n",
    "    WHERE g.genre = $genre\n",
    "    WITH DISTINCT s \n",
    "    LIMIT $limit\n",
    "    RETURN s.id as id\n",
    "    \"\"\"\n",
    "    \n",
    "    with driver.session(database = database_name) as session:\n",
    "        results = session.run(query, user_id = user_id, genre = genre, limit = limit)\n",
    "        for row in results:\n",
    "            addLike(driver, user_id = user_id, node_id = row[\"id\"], node_label = \"Song\")\n",
    "            \n",
    "    ####### LIKE ALBUMS #######\n",
    "    \n",
    "    query = \"\"\"\n",
    "    MATCH (g:Genre)<-[r:BELONGS_TO]-(c:CD)\n",
    "    MATCH (c)-[r2:CONTAINS]->(s:Album)\n",
    "    WHERE g.genre = $genre\n",
    "    WITH DISTINCT s \n",
    "    LIMIT $limit\n",
    "    RETURN s.id as id\n",
    "    \"\"\"\n",
    "    \n",
    "    with driver.session(database = database_name) as session:\n",
    "        results = session.run(query, user_id = user_id, genre = genre, limit = limit)\n",
    "        for row in results:\n",
    "            addLike(driver, user_id = user_id, node_id = row[\"id\"], node_label = \"Album\")\n",
    "            \n",
    "    ####### LIKE ARTISTS #######\n",
    "    \n",
    "    query = \"\"\"\n",
    "    MATCH (g:Genre)<-[r:BELONGS_TO]-(c:CD)\n",
    "    MATCH (c)-[r2:CONTAINS]->(s:Artist)\n",
    "    WHERE g.genre = $genre\n",
    "    WITH DISTINCT s \n",
    "    LIMIT $limit\n",
    "    RETURN s.id as id\n",
    "    \"\"\"\n",
    "    \n",
    "    with driver.session(database = database_name) as session:\n",
    "        results = session.run(query, user_id = user_id, genre = genre, limit = limit)\n",
    "        for row in results:\n",
    "            addLike(driver, user_id = user_id, node_id = row[\"id\"], node_label = \"Artist\")\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "createExampleUser(driver, user_id = 99, genre = \"rock\", limit = 50)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Adding some Likes to model User Preference:**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "# User 1 likes \"Rock\" music\n",
    "createExampleUser(driver, user_id = 1, genre = \"rock\", limit = 50)\n",
    "# User 2 likes \"classic\" music\n",
    "createExampleUser(driver, user_id = 2, genre = \"classic\", limit = 50)\n",
    "# User 3 likes \"pop\" music\n",
    "createExampleUser(driver, user_id = 3, genre = \"pop\", limit = 50)\n",
    "# User 4 likes \"hip-hop\" music\n",
    "createExampleUser(driver, user_id = 4, genre = \"hip-hop\", limit = 50)\n",
    "# User 5 likes \"hip-hop\" music\n",
    "createExampleUser(driver, user_id = 5, genre = \"hard rock\", limit = 50)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "***"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Implementation Explained:**\n",
    "\n",
    "This search incorporates nodes corresponding to the input string on the one hand, and the previously liked albums, artists and songs on the other hand. Two separate scores are calculated in a similar manner. Separately calculated Centrality Scores form the basis. Separate graph projections are created for nodes that match the search input and for nodes that have been previously liked. Subsequently, a centrality score is calculated for each node in both. The basic idea is that the most relevant CDs will have a high centrality score. The \"Content Match\" score and the \"User Preference\" score are then combined in a weighted manner. The ten CDs with the highest combined score are presented to the user. \n",
    "\n",
    "![](Figures/search.png)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "***"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "def loadUserPreferences(driver, database_name = \"cddb\", user_id: int = None):\n",
    "        \n",
    "    ####### DELETE EXISTING PROJECTION #######\n",
    "    \n",
    "    query_delete = \"\"\"\n",
    "    CALL gds.graph.drop('searchdomain_preference', false) \n",
    "    YIELD graphName \n",
    "    RETURN graphName\n",
    "    \"\"\"\n",
    "    \n",
    "    ####### CREATE NEW PROJECTION #######\n",
    "    \n",
    "    query_create = f\"\"\"\n",
    "    // CREATE NEW PROJECTION WITH SEARCH RELEVANT SUB GRAPH\n",
    "    CALL gds.graph.project.cypher(\n",
    "      'searchdomain_preference',\n",
    "      \n",
    "      ' // Liked Artists, Albums and Songs\n",
    "        MATCH (u:User)-[:LIKES]->(n) \n",
    "        WHERE u.id = {user_id}\n",
    "            AND (n:Song OR n:Album OR n:Artist) \n",
    "        RETURN id(n) AS id, labels(n) AS labels \n",
    "        UNION\n",
    "        // CDs linked to liked Artists, Albums and Songs\n",
    "        MATCH (u:User)-[:LIKES]->(x)-[:APPEARED_ON]->(n:CD) \n",
    "        WHERE u.id = {user_id}\n",
    "        RETURN id(n) AS id, labels(n) AS labels ',\n",
    "\n",
    "        'MATCH (u:User)-[:LIKES]->(n)\n",
    "        WHERE u.id = {user_id}\n",
    "        AND (n:CD OR n:Song OR n:Album OR n:Artist) \n",
    "        MATCH (n)-[r:APPEARED_ON]->(m:CD) \n",
    "        RETURN id(n) AS source, id(m) AS target, type(r) AS type' \n",
    "    )\n",
    "    YIELD\n",
    "      graphName, nodeCount AS nodes, relationshipCount AS rels\n",
    "    RETURN graphName, nodes, rels\n",
    "    \"\"\"\n",
    "\n",
    "    with driver.session(database = database_name) as session:\n",
    "        results = session.run(query_delete)\n",
    "        results = session.run(query_create)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "loadUserPreferences(driver, user_id = 1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "def calcUserPreference(driver, database_name = \"cddb\", user_id: int = None):\n",
    "    \n",
    "    ####### CHECK IF PROJECTION EXISTS #######\n",
    "    \n",
    "    query_check = \"\"\"\n",
    "    CALL gds.graph.exists(\"searchdomain_preference\")\n",
    "    YIELD graphName, exists\n",
    "    RETURN graphName, exists\n",
    "    \"\"\"\n",
    "    \n",
    "    ####### DELETE EXISTING RELATIONS #######\n",
    "    \n",
    "    query_delete = \"\"\"\n",
    "    WITH $user_id as userID \n",
    "    MATCH (:User {id: userID})-[r:PREFERRES]->(c:CD) \n",
    "    DELETE r\n",
    "    \"\"\"\n",
    "    \n",
    "    ####### CREATE NEW RELATIONS #######\n",
    "    \n",
    "    query_create = \"\"\"\n",
    "    WITH $user_id as userId\n",
    "    CALL gds.eigenvector.stream('searchdomain_preference')\n",
    "    YIELD nodeId, score\n",
    "    WITH gds.util.asNode(nodeId).id AS nodeId, score, userId\n",
    "    MATCH (c:CD {id: nodeId})\n",
    "    MATCH (u:User {id: userId})\n",
    "    MERGE (c)<-[r:PREFERRES {score: score}]-(u)\n",
    "    \"\"\"\n",
    "\n",
    "    with driver.session(database = database_name) as session:\n",
    "        \n",
    "        # Check if projection exists\n",
    "        results = session.run(query_check, user_id = user_id)\n",
    "        graph_exists = bool(results.single()[\"exists\"])\n",
    "\n",
    "        if graph_exists:\n",
    "            results = session.run(query_delete, user_id = user_id)\n",
    "            results = session.run(query_create, user_id = user_id)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "calcUserPreference(driver, user_id = 1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "WITH 1 as userID\n",
    "CALL {\n",
    "    MATCH (u:User)-[r1:LIKES]->(n:Album)\n",
    "    MATCH (n)-[r2:APPEARED_ON]-(c:CD)\n",
    "    MATCH (c)-[:BELONGS_TO]->(g:Genre) \n",
    "    WHERE u.id = 1\n",
    "    RETURN COUNT(DISTINCT c.id) as countTotal\n",
    "}\n",
    "MATCH (u:User)-[r1:LIKES]->(n:Album)\n",
    "MATCH (n)-[r2:APPEARED_ON]-(c:CD)\n",
    "MATCH (c)-[:BELONGS_TO]->(g:Genre) \n",
    "WHERE u.id = 1\n",
    "WITH g, c, u, countTotal, userID\n",
    "WITH \n",
    "DISTINCT g.id as id, g.genre as genre, u, g, \n",
    "count(DISTINCT c.id) as countGenre, countTotal,\n",
    "userID\n",
    "WITH id, genre, userID, u, g,  countGenre, countTotal, \n",
    "(toFloat(countGenre) / toFloat(countTotal)) as prob\n",
    "MERGE (u)-[:PREFERRES {score: prob}]->(g)\n",
    "RETURN *\n",
    "ORDER BY countGenre DESC"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "def processUserPreference(driver, database_name = \"cddb\",):\n",
    "\n",
    "    query = \"\"\"\n",
    "    MATCH (u:User)\n",
    "    RETURN u.id as userID\n",
    "    \"\"\"\n",
    "\n",
    "    with driver.session(database = database_name) as session:\n",
    "        results = session.run(query)\n",
    "        for row in results:\n",
    "            user_id = row[\"userID\"]\n",
    "            print(f\"Indexing Preferences of User {user_id}\")\n",
    "            loadUserPreferences(driver, user_id = user_id)\n",
    "            calcUserPreference(driver, user_id = user_id)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Indexing Preferences of User 1\n",
      "Indexing Preferences of User 99\n",
      "Indexing Preferences of User 2\n",
      "Indexing Preferences of User 3\n",
      "Indexing Preferences of User 4\n",
      "Indexing Preferences of User 5\n"
     ]
    }
   ],
   "source": [
    "processUserPreference(driver)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>userID</th>\n",
       "      <th>score_sum</th>\n",
       "      <th>score_pref</th>\n",
       "      <th>score_combined</th>\n",
       "      <th>genres</th>\n",
       "      <th>artists</th>\n",
       "      <th>albums</th>\n",
       "      <th>songs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>7923</td>\n",
       "      <td>1</td>\n",
       "      <td>56.690317</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>56.690317</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[signature licks]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[fire (verse);, foxey lady (solo, slow);, fire...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>677</td>\n",
       "      <td>1</td>\n",
       "      <td>31.538232</td>\n",
       "      <td>0.566320</td>\n",
       "      <td>49.398952</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[third stone from the sun, remember, fire, can...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>136907</td>\n",
       "      <td>1</td>\n",
       "      <td>31.538232</td>\n",
       "      <td>0.554190</td>\n",
       "      <td>49.016412</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[love or confusion, remember, highway chile, m...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>35734</td>\n",
       "      <td>1</td>\n",
       "      <td>31.538232</td>\n",
       "      <td>0.554190</td>\n",
       "      <td>49.016412</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[i don't live today, 51st anniversary, stone f...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2023</td>\n",
       "      <td>1</td>\n",
       "      <td>26.723665</td>\n",
       "      <td>0.692738</td>\n",
       "      <td>45.236157</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix - the best of jimi hendrix]</td>\n",
       "      <td>[bold as love, night bird flying, if 6 was 9, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>46232</td>\n",
       "      <td>1</td>\n",
       "      <td>26.723665</td>\n",
       "      <td>0.692738</td>\n",
       "      <td>45.236157</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix the best of jimi hendrix]</td>\n",
       "      <td>[foxey lady, dolly dagger, bold as love, if 6 ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>162186</td>\n",
       "      <td>1</td>\n",
       "      <td>26.723665</td>\n",
       "      <td>0.658101</td>\n",
       "      <td>44.310532</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix: the best of jimi hendrix]</td>\n",
       "      <td>[if six was nine, foxey lady, bold as love, ni...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>1936</td>\n",
       "      <td>1</td>\n",
       "      <td>24.346131</td>\n",
       "      <td>0.692738</td>\n",
       "      <td>41.211616</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix]</td>\n",
       "      <td>[bold as love, night bird flying, if 6 was 9, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>33321</td>\n",
       "      <td>1</td>\n",
       "      <td>28.278246</td>\n",
       "      <td>0.212370</td>\n",
       "      <td>34.283693</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[astro man(alchemy); - studio outtakes 1966-68]</td>\n",
       "      <td>[purple haze 1 (4);, 51st anniversary (5);, la...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>37536</td>\n",
       "      <td>1</td>\n",
       "      <td>24.988402</td>\n",
       "      <td>0.318555</td>\n",
       "      <td>32.948578</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[experience hendrix]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[woodo child (slight return);, minic depressio...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>30138</td>\n",
       "      <td>1</td>\n",
       "      <td>26.401186</td>\n",
       "      <td>0.247765</td>\n",
       "      <td>32.942472</td>\n",
       "      <td>[acid]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[astro man box set]</td>\n",
       "      <td>[can you see me (pre unre);, purple haze (pre ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>20222</td>\n",
       "      <td>1</td>\n",
       "      <td>27.155209</td>\n",
       "      <td>0.194672</td>\n",
       "      <td>32.441578</td>\n",
       "      <td>[blues-rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[best of jimi hendrix]</td>\n",
       "      <td>[blues, blues, free spirit, star spangled bann...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>35582</td>\n",
       "      <td>1</td>\n",
       "      <td>19.434635</td>\n",
       "      <td>0.519553</td>\n",
       "      <td>29.531965</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[rescuedisland]</td>\n",
       "      <td>[ezy ryder, my friend, message to love, drifti...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>20709</td>\n",
       "      <td>1</td>\n",
       "      <td>28.943255</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>28.943255</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[jimi hendrix experience]</td>\n",
       "      <td>[the vpro archive - it must be dusty]</td>\n",
       "      <td>[mockingbird (mpeg1 video data);, spoken word,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>30933</td>\n",
       "      <td>1</td>\n",
       "      <td>19.434635</td>\n",
       "      <td>0.450280</td>\n",
       "      <td>28.185654</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the last ever show - love and peace festival ...</td>\n",
       "      <td>[land of the new rising sun, ezy rider, room f...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>17266</td>\n",
       "      <td>1</td>\n",
       "      <td>20.769874</td>\n",
       "      <td>0.346369</td>\n",
       "      <td>27.963912</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[3rd stone from the sun, remember, foxy lady, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>162149</td>\n",
       "      <td>1</td>\n",
       "      <td>19.434635</td>\n",
       "      <td>0.353950</td>\n",
       "      <td>26.313520</td>\n",
       "      <td>[progressive rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[mnic depression, wild thing (live);, star spa...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>1306</td>\n",
       "      <td>1</td>\n",
       "      <td>19.434635</td>\n",
       "      <td>0.353950</td>\n",
       "      <td>26.313520</td>\n",
       "      <td>[hard rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[star spangled banner (live);, voodoo chile (s...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>794</td>\n",
       "      <td>1</td>\n",
       "      <td>19.434635</td>\n",
       "      <td>0.353950</td>\n",
       "      <td>26.313520</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[the wind cries mary, castles made of sand, wi...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>3129</td>\n",
       "      <td>1</td>\n",
       "      <td>19.434635</td>\n",
       "      <td>0.353950</td>\n",
       "      <td>26.313520</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[star spangled banner (live);, wild thing (liv...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>38310</td>\n",
       "      <td>1</td>\n",
       "      <td>19.434635</td>\n",
       "      <td>0.353950</td>\n",
       "      <td>26.313520</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[wild thing (live);, star spangled banner (liv...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>529</td>\n",
       "      <td>1</td>\n",
       "      <td>19.434635</td>\n",
       "      <td>0.350656</td>\n",
       "      <td>26.249505</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[bbc sessions]</td>\n",
       "      <td>[driving south, hear my train a comin, foxy la...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>8660</td>\n",
       "      <td>1</td>\n",
       "      <td>26.245966</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>26.245966</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[the jimi hendrix experience]</td>\n",
       "      <td>[1968.10.10-12 the definitive winterlandtwo]]</td>\n",
       "      <td>[are your experienced, tax free, red house, he...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>35764</td>\n",
       "      <td>1</td>\n",
       "      <td>19.434635</td>\n",
       "      <td>0.265462</td>\n",
       "      <td>24.593799</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the total experience]</td>\n",
       "      <td>[smashing of the amps, redhouse, groove maker,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>35129</td>\n",
       "      <td>1</td>\n",
       "      <td>19.434635</td>\n",
       "      <td>0.265462</td>\n",
       "      <td>24.593799</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the very best of]</td>\n",
       "      <td>[woodoo chile, red house, stone free, highway ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>28761</td>\n",
       "      <td>1</td>\n",
       "      <td>19.434635</td>\n",
       "      <td>0.230067</td>\n",
       "      <td>23.905910</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[riots in berkeley]</td>\n",
       "      <td>[hey baby (new rising sun);, pass it on (unrel...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>29242</td>\n",
       "      <td>1</td>\n",
       "      <td>19.534799</td>\n",
       "      <td>0.212370</td>\n",
       "      <td>23.683401</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[purple haze]</td>\n",
       "      <td>[sgt. pepper's lonely hearts club band, voodoo...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>32083</td>\n",
       "      <td>1</td>\n",
       "      <td>23.614041</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>23.614041</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[still experienced]</td>\n",
       "      <td>[still experienced]</td>\n",
       "      <td>[the wind cries mary, foxy lady, fire, burning...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>158038</td>\n",
       "      <td>1</td>\n",
       "      <td>23.414884</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>23.414884</td>\n",
       "      <td>[country]</td>\n",
       "      <td>[sheb wooley]</td>\n",
       "      <td>[sheb wooley - the purple people eater]</td>\n",
       "      <td>[mirage, the chase, are you satisfied, josie (...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>157790</td>\n",
       "      <td>1</td>\n",
       "      <td>23.326837</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>23.326837</td>\n",
       "      <td>[acid punk]</td>\n",
       "      <td>[the cure]</td>\n",
       "      <td>[b-side of high]</td>\n",
       "      <td>[adonais, it used to be me, a foolish arrangem...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        id  userID  score_sum  score_pref  score_combined              genres  \\\n",
       "0     7923       1  56.690317    0.000000       56.690317             [blues]   \n",
       "1      677       1  31.538232    0.566320       49.398952              [rock]   \n",
       "2   136907       1  31.538232    0.554190       49.016412              [rock]   \n",
       "3    35734       1  31.538232    0.554190       49.016412              [rock]   \n",
       "4     2023       1  26.723665    0.692738       45.236157             [blues]   \n",
       "5    46232       1  26.723665    0.692738       45.236157              [rock]   \n",
       "6   162186       1  26.723665    0.658101       44.310532              [rock]   \n",
       "7     1936       1  24.346131    0.692738       41.211616              [rock]   \n",
       "8    33321       1  28.278246    0.212370       34.283693              [rock]   \n",
       "9    37536       1  24.988402    0.318555       32.948578             [blues]   \n",
       "10   30138       1  26.401186    0.247765       32.942472              [acid]   \n",
       "11   20222       1  27.155209    0.194672       32.441578        [blues-rock]   \n",
       "12   35582       1  19.434635    0.519553       29.531965             [blues]   \n",
       "13   20709       1  28.943255    0.000000       28.943255             [blues]   \n",
       "14   30933       1  19.434635    0.450280       28.185654              [rock]   \n",
       "15   17266       1  20.769874    0.346369       27.963912              [rock]   \n",
       "16  162149       1  19.434635    0.353950       26.313520  [progressive rock]   \n",
       "17    1306       1  19.434635    0.353950       26.313520         [hard rock]   \n",
       "18     794       1  19.434635    0.353950       26.313520             [blues]   \n",
       "19    3129       1  19.434635    0.353950       26.313520             [blues]   \n",
       "20   38310       1  19.434635    0.353950       26.313520             [blues]   \n",
       "21     529       1  19.434635    0.350656       26.249505             [blues]   \n",
       "22    8660       1  26.245966    0.000000       26.245966             [blues]   \n",
       "23   35764       1  19.434635    0.265462       24.593799             [blues]   \n",
       "24   35129       1  19.434635    0.265462       24.593799             [blues]   \n",
       "25   28761       1  19.434635    0.230067       23.905910             [blues]   \n",
       "26   29242       1  19.534799    0.212370       23.683401              [rock]   \n",
       "27   32083       1  23.614041    0.000000       23.614041             [blues]   \n",
       "28  158038       1  23.414884    0.000000       23.414884           [country]   \n",
       "29  157790       1  23.326837    0.000000       23.326837         [acid punk]   \n",
       "\n",
       "                          artists  \\\n",
       "0               [signature licks]   \n",
       "1                  [jimi hendrix]   \n",
       "2                  [jimi hendrix]   \n",
       "3                  [jimi hendrix]   \n",
       "4                  [jimi hendrix]   \n",
       "5                  [jimi hendrix]   \n",
       "6                  [jimi hendrix]   \n",
       "7                  [jimi hendrix]   \n",
       "8                  [jimi hendrix]   \n",
       "9            [experience hendrix]   \n",
       "10                 [jimi hendrix]   \n",
       "11                 [jimi hendrix]   \n",
       "12                 [jimi hendrix]   \n",
       "13      [jimi hendrix experience]   \n",
       "14                 [jimi hendrix]   \n",
       "15                 [jimi hendrix]   \n",
       "16                 [jimi hendrix]   \n",
       "17                 [jimi hendrix]   \n",
       "18                 [jimi hendrix]   \n",
       "19                 [jimi hendrix]   \n",
       "20                 [jimi hendrix]   \n",
       "21                 [jimi hendrix]   \n",
       "22  [the jimi hendrix experience]   \n",
       "23                 [jimi hendrix]   \n",
       "24                 [jimi hendrix]   \n",
       "25                 [jimi hendrix]   \n",
       "26                 [jimi hendrix]   \n",
       "27            [still experienced]   \n",
       "28                  [sheb wooley]   \n",
       "29                     [the cure]   \n",
       "\n",
       "                                               albums  \\\n",
       "0                                      [jimi hendrix]   \n",
       "1                               [are you experienced]   \n",
       "2                               [are you experienced]   \n",
       "3                               [are you experienced]   \n",
       "4     [experience hendrix - the best of jimi hendrix]   \n",
       "5       [experience hendrix the best of jimi hendrix]   \n",
       "6      [experience hendrix: the best of jimi hendrix]   \n",
       "7                                [experience hendrix]   \n",
       "8     [astro man(alchemy); - studio outtakes 1966-68]   \n",
       "9                                      [jimi hendrix]   \n",
       "10                                [astro man box set]   \n",
       "11                             [best of jimi hendrix]   \n",
       "12                                    [rescuedisland]   \n",
       "13              [the vpro archive - it must be dusty]   \n",
       "14  [the last ever show - love and peace festival ...   \n",
       "15                              [are you experienced]   \n",
       "16                          [the ultimate experience]   \n",
       "17                          [the ultimate experience]   \n",
       "18                          [the ultimate experience]   \n",
       "19                          [the ultimate experience]   \n",
       "20                          [the ultimate experience]   \n",
       "21                                     [bbc sessions]   \n",
       "22      [1968.10.10-12 the definitive winterlandtwo]]   \n",
       "23                             [the total experience]   \n",
       "24                                 [the very best of]   \n",
       "25                                [riots in berkeley]   \n",
       "26                                      [purple haze]   \n",
       "27                                [still experienced]   \n",
       "28            [sheb wooley - the purple people eater]   \n",
       "29                                   [b-side of high]   \n",
       "\n",
       "                                                songs  \n",
       "0   [fire (verse);, foxey lady (solo, slow);, fire...  \n",
       "1   [third stone from the sun, remember, fire, can...  \n",
       "2   [love or confusion, remember, highway chile, m...  \n",
       "3   [i don't live today, 51st anniversary, stone f...  \n",
       "4   [bold as love, night bird flying, if 6 was 9, ...  \n",
       "5   [foxey lady, dolly dagger, bold as love, if 6 ...  \n",
       "6   [if six was nine, foxey lady, bold as love, ni...  \n",
       "7   [bold as love, night bird flying, if 6 was 9, ...  \n",
       "8   [purple haze 1 (4);, 51st anniversary (5);, la...  \n",
       "9   [woodo child (slight return);, minic depressio...  \n",
       "10  [can you see me (pre unre);, purple haze (pre ...  \n",
       "11  [blues, blues, free spirit, star spangled bann...  \n",
       "12  [ezy ryder, my friend, message to love, drifti...  \n",
       "13  [mockingbird (mpeg1 video data);, spoken word,...  \n",
       "14  [land of the new rising sun, ezy rider, room f...  \n",
       "15  [3rd stone from the sun, remember, foxy lady, ...  \n",
       "16  [mnic depression, wild thing (live);, star spa...  \n",
       "17  [star spangled banner (live);, voodoo chile (s...  \n",
       "18  [the wind cries mary, castles made of sand, wi...  \n",
       "19  [star spangled banner (live);, wild thing (liv...  \n",
       "20  [wild thing (live);, star spangled banner (liv...  \n",
       "21  [driving south, hear my train a comin, foxy la...  \n",
       "22  [are your experienced, tax free, red house, he...  \n",
       "23  [smashing of the amps, redhouse, groove maker,...  \n",
       "24  [woodoo chile, red house, stone free, highway ...  \n",
       "25  [hey baby (new rising sun);, pass it on (unrel...  \n",
       "26  [sgt. pepper's lonely hearts club band, voodoo...  \n",
       "27  [the wind cries mary, foxy lady, fire, burning...  \n",
       "28  [mirage, the chase, are you satisfied, josie (...  \n",
       "29  [adonais, it used to be me, a foolish arrangem...  "
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"// Search input\n",
    "WITH\n",
    "1 as userID,\n",
    "'Jimi Hendrix purple haze are you experienced' as searchQuery,\n",
    "//'Ludwig van Beethoven Für Elise Symphony' as searchQuery,\n",
    "'all' as searchMask\n",
    "\n",
    "CALL {\n",
    "    // Artists\n",
    "    WITH searchQuery, searchMask\n",
    "    CALL db.index.fulltext.queryNodes('artists', searchQuery) \n",
    "    YIELD node, score\n",
    "    WHERE searchMask = 'all' or searchMask = 'artists'\n",
    "    RETURN node, score\n",
    "    UNION \n",
    "\n",
    "    // Songs\n",
    "    WITH searchQuery, searchMask\n",
    "    CALL db.index.fulltext.queryNodes('songs', searchQuery) \n",
    "    YIELD node, score\n",
    "    WHERE searchMask = 'all' or searchMask = 'songs'\n",
    "    RETURN node, score\n",
    "    UNION \n",
    "    \n",
    "    // Albums\n",
    "    WITH searchQuery, searchMask\n",
    "    CALL db.index.fulltext.queryNodes('albums', searchQuery) \n",
    "    YIELD node, score\n",
    "    WHERE searchMask = 'all' or searchMask = 'albums'\n",
    "    RETURN node, score\n",
    "}\n",
    "WITH node, score, userID\n",
    "MATCH (node)-[r:APPEARED_ON]->(c:CD)\n",
    "WITH DISTINCT c.id as id, c,  sum(score) as score_sum, userID\n",
    "\n",
    "// Get more information about the CDs \n",
    "MATCH (c)-[:CONTAINS]->(ar:Artist)\n",
    "MATCH (c)-[:CONTAINS]->(ab:Album)\n",
    "MATCH (c)-[:CONTAINS]->(so:Song)\n",
    "MATCH (c)-[:BELONGS_TO]->(ge:Genre)\n",
    "OPTIONAL MATCH (c)<-[r:PREFERRES]-(u:User {id: userID})\n",
    "\n",
    "RETURN \n",
    "id, userID, score_sum, sum(r.score) as score_pref ,\n",
    "score_sum + (sum(r.score)  * score_sum) as score_combined,\n",
    "collect(DISTINCT ge.genre) as genres,\n",
    "collect(DISTINCT ar.artist) as artists,\n",
    "collect(DISTINCT ab.album) as albums, \n",
    "collect(DISTINCT so.song) as songs\n",
    "\n",
    "ORDER BY score_combined DESC\n",
    "LIMIT 100\"\"\"\n",
    "\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data.head(30)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>userID</th>\n",
       "      <th>score_content</th>\n",
       "      <th>score_pref</th>\n",
       "      <th>score_genre</th>\n",
       "      <th>score_combined</th>\n",
       "      <th>genres</th>\n",
       "      <th>artists</th>\n",
       "      <th>albums</th>\n",
       "      <th>songs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>677</td>\n",
       "      <td>1</td>\n",
       "      <td>31.538232</td>\n",
       "      <td>0.566320</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>70.317167</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[third stone from the sun, remember, fire, can...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>35734</td>\n",
       "      <td>1</td>\n",
       "      <td>31.538232</td>\n",
       "      <td>0.554190</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>69.934627</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[i don't live today, 51st anniversary, stone f...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>136907</td>\n",
       "      <td>1</td>\n",
       "      <td>31.538232</td>\n",
       "      <td>0.554190</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>69.934627</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[love or confusion, remember, highway chile, m...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>46232</td>\n",
       "      <td>1</td>\n",
       "      <td>26.723665</td>\n",
       "      <td>0.692738</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>62.961037</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix the best of jimi hendrix]</td>\n",
       "      <td>[foxey lady, dolly dagger, bold as love, if 6 ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>162186</td>\n",
       "      <td>1</td>\n",
       "      <td>26.723665</td>\n",
       "      <td>0.658101</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>62.035412</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix: the best of jimi hendrix]</td>\n",
       "      <td>[if six was nine, foxey lady, bold as love, ni...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>7923</td>\n",
       "      <td>1</td>\n",
       "      <td>56.690317</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.071429</td>\n",
       "      <td>60.739626</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[signature licks]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[fire (verse);, foxey lady (solo, slow);, fire...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>1936</td>\n",
       "      <td>1</td>\n",
       "      <td>24.346131</td>\n",
       "      <td>0.692738</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>57.359560</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix]</td>\n",
       "      <td>[bold as love, night bird flying, if 6 was 9, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>33321</td>\n",
       "      <td>1</td>\n",
       "      <td>28.278246</td>\n",
       "      <td>0.212370</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>53.039673</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[astro man(alchemy); - studio outtakes 1966-68]</td>\n",
       "      <td>[purple haze 1 (4);, 51st anniversary (5);, la...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>2023</td>\n",
       "      <td>1</td>\n",
       "      <td>26.723665</td>\n",
       "      <td>0.692738</td>\n",
       "      <td>0.071429</td>\n",
       "      <td>47.144990</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix - the best of jimi hendrix]</td>\n",
       "      <td>[bold as love, night bird flying, if 6 was 9, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>17266</td>\n",
       "      <td>1</td>\n",
       "      <td>20.769874</td>\n",
       "      <td>0.346369</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>41.739848</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[3rd stone from the sun, remember, foxy lady, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>30933</td>\n",
       "      <td>1</td>\n",
       "      <td>19.434635</td>\n",
       "      <td>0.450280</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>41.075973</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the last ever show - love and peace festival ...</td>\n",
       "      <td>[land of the new rising sun, ezy rider, room f...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>29242</td>\n",
       "      <td>1</td>\n",
       "      <td>19.534799</td>\n",
       "      <td>0.212370</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>36.640155</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[purple haze]</td>\n",
       "      <td>[sgt. pepper's lonely hearts club band, voodoo...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>23144</td>\n",
       "      <td>1</td>\n",
       "      <td>19.434635</td>\n",
       "      <td>0.194672</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>36.108341</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[la forum 26th april 1969]</td>\n",
       "      <td>[voodoo chile (slight reprise);, i dont live t...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>164258</td>\n",
       "      <td>1</td>\n",
       "      <td>19.434635</td>\n",
       "      <td>0.141580</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>35.076508</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[blue wild angel : live at the isle of wight]</td>\n",
       "      <td>[in from the storm, ezy rider, hey baby (new r...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>37536</td>\n",
       "      <td>1</td>\n",
       "      <td>24.988402</td>\n",
       "      <td>0.318555</td>\n",
       "      <td>0.071429</td>\n",
       "      <td>34.733463</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[experience hendrix]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[woodo child (slight return);, minic depressio...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>30138</td>\n",
       "      <td>1</td>\n",
       "      <td>26.401186</td>\n",
       "      <td>0.247765</td>\n",
       "      <td>NaN</td>\n",
       "      <td>32.942472</td>\n",
       "      <td>[acid]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[astro man box set]</td>\n",
       "      <td>[can you see me (pre unre);, purple haze (pre ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>20222</td>\n",
       "      <td>1</td>\n",
       "      <td>27.155209</td>\n",
       "      <td>0.194672</td>\n",
       "      <td>NaN</td>\n",
       "      <td>32.441578</td>\n",
       "      <td>[blues-rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[best of jimi hendrix]</td>\n",
       "      <td>[blues, blues, free spirit, star spangled bann...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>14391</td>\n",
       "      <td>1</td>\n",
       "      <td>18.844162</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>31.342840</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[the jimi hendrix experience]</td>\n",
       "      <td>[no more a rolling stone]</td>\n",
       "      <td>[killin' floor, foxy lady, the wind cries mary...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>20709</td>\n",
       "      <td>1</td>\n",
       "      <td>28.943255</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.071429</td>\n",
       "      <td>31.010630</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[jimi hendrix experience]</td>\n",
       "      <td>[the vpro archive - it must be dusty]</td>\n",
       "      <td>[mockingbird (mpeg1 video data);, spoken word,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>35582</td>\n",
       "      <td>1</td>\n",
       "      <td>19.434635</td>\n",
       "      <td>0.519553</td>\n",
       "      <td>0.071429</td>\n",
       "      <td>30.920153</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[rescuedisland]</td>\n",
       "      <td>[ezy ryder, my friend, message to love, drifti...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>12202</td>\n",
       "      <td>1</td>\n",
       "      <td>15.814190</td>\n",
       "      <td>0.159277</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>28.822037</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[astro man(alchemy); - live in paris jan 29th ...</td>\n",
       "      <td>[purple haze ( 6); (live 1 68);, fire (1 ); (l...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>15666</td>\n",
       "      <td>1</td>\n",
       "      <td>15.814190</td>\n",
       "      <td>0.159277</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>28.822037</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[astro man(alchemy); - live in stockholm secon...</td>\n",
       "      <td>[hey joe (43); (live 1 69);, fire (44); (live ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>9197</td>\n",
       "      <td>1</td>\n",
       "      <td>17.234911</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.663265</td>\n",
       "      <td>28.666230</td>\n",
       "      <td>[rock]</td>\n",
       "      <td>[the jimi hendrix experience]</td>\n",
       "      <td>[no more a rolling stone]</td>\n",
       "      <td>[the burning of the midnight lamp, sgt. pepper...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>8660</td>\n",
       "      <td>1</td>\n",
       "      <td>26.245966</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.071429</td>\n",
       "      <td>28.120678</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[the jimi hendrix experience]</td>\n",
       "      <td>[1968.10.10-12 the definitive winterlandtwo]]</td>\n",
       "      <td>[are your experienced, tax free, red house, he...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>3129</td>\n",
       "      <td>1</td>\n",
       "      <td>19.434635</td>\n",
       "      <td>0.353950</td>\n",
       "      <td>0.071429</td>\n",
       "      <td>27.701708</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[star spangled banner (live);, wild thing (liv...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>794</td>\n",
       "      <td>1</td>\n",
       "      <td>19.434635</td>\n",
       "      <td>0.353950</td>\n",
       "      <td>0.071429</td>\n",
       "      <td>27.701708</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[the wind cries mary, castles made of sand, wi...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>38310</td>\n",
       "      <td>1</td>\n",
       "      <td>19.434635</td>\n",
       "      <td>0.353950</td>\n",
       "      <td>0.071429</td>\n",
       "      <td>27.701708</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[wild thing (live);, star spangled banner (liv...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>529</td>\n",
       "      <td>1</td>\n",
       "      <td>19.434635</td>\n",
       "      <td>0.350656</td>\n",
       "      <td>0.071429</td>\n",
       "      <td>27.637694</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[bbc sessions]</td>\n",
       "      <td>[driving south, hear my train a comin, foxy la...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>1306</td>\n",
       "      <td>1</td>\n",
       "      <td>19.434635</td>\n",
       "      <td>0.353950</td>\n",
       "      <td>0.010204</td>\n",
       "      <td>26.511832</td>\n",
       "      <td>[hard rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[star spangled banner (live);, voodoo chile (s...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>162149</td>\n",
       "      <td>1</td>\n",
       "      <td>19.434635</td>\n",
       "      <td>0.353950</td>\n",
       "      <td>NaN</td>\n",
       "      <td>26.313520</td>\n",
       "      <td>[progressive rock]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[mnic depression, wild thing (live);, star spa...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        id  userID  score_content  score_pref  score_genre  score_combined  \\\n",
       "0      677       1      31.538232    0.566320     0.663265       70.317167   \n",
       "1    35734       1      31.538232    0.554190     0.663265       69.934627   \n",
       "2   136907       1      31.538232    0.554190     0.663265       69.934627   \n",
       "3    46232       1      26.723665    0.692738     0.663265       62.961037   \n",
       "4   162186       1      26.723665    0.658101     0.663265       62.035412   \n",
       "5     7923       1      56.690317    0.000000     0.071429       60.739626   \n",
       "6     1936       1      24.346131    0.692738     0.663265       57.359560   \n",
       "7    33321       1      28.278246    0.212370     0.663265       53.039673   \n",
       "8     2023       1      26.723665    0.692738     0.071429       47.144990   \n",
       "9    17266       1      20.769874    0.346369     0.663265       41.739848   \n",
       "10   30933       1      19.434635    0.450280     0.663265       41.075973   \n",
       "11   29242       1      19.534799    0.212370     0.663265       36.640155   \n",
       "12   23144       1      19.434635    0.194672     0.663265       36.108341   \n",
       "13  164258       1      19.434635    0.141580     0.663265       35.076508   \n",
       "14   37536       1      24.988402    0.318555     0.071429       34.733463   \n",
       "15   30138       1      26.401186    0.247765          NaN       32.942472   \n",
       "16   20222       1      27.155209    0.194672          NaN       32.441578   \n",
       "17   14391       1      18.844162    0.000000     0.663265       31.342840   \n",
       "18   20709       1      28.943255    0.000000     0.071429       31.010630   \n",
       "19   35582       1      19.434635    0.519553     0.071429       30.920153   \n",
       "20   12202       1      15.814190    0.159277     0.663265       28.822037   \n",
       "21   15666       1      15.814190    0.159277     0.663265       28.822037   \n",
       "22    9197       1      17.234911    0.000000     0.663265       28.666230   \n",
       "23    8660       1      26.245966    0.000000     0.071429       28.120678   \n",
       "24    3129       1      19.434635    0.353950     0.071429       27.701708   \n",
       "25     794       1      19.434635    0.353950     0.071429       27.701708   \n",
       "26   38310       1      19.434635    0.353950     0.071429       27.701708   \n",
       "27     529       1      19.434635    0.350656     0.071429       27.637694   \n",
       "28    1306       1      19.434635    0.353950     0.010204       26.511832   \n",
       "29  162149       1      19.434635    0.353950          NaN       26.313520   \n",
       "\n",
       "                genres                        artists  \\\n",
       "0               [rock]                 [jimi hendrix]   \n",
       "1               [rock]                 [jimi hendrix]   \n",
       "2               [rock]                 [jimi hendrix]   \n",
       "3               [rock]                 [jimi hendrix]   \n",
       "4               [rock]                 [jimi hendrix]   \n",
       "5              [blues]              [signature licks]   \n",
       "6               [rock]                 [jimi hendrix]   \n",
       "7               [rock]                 [jimi hendrix]   \n",
       "8              [blues]                 [jimi hendrix]   \n",
       "9               [rock]                 [jimi hendrix]   \n",
       "10              [rock]                 [jimi hendrix]   \n",
       "11              [rock]                 [jimi hendrix]   \n",
       "12              [rock]                 [jimi hendrix]   \n",
       "13              [rock]                 [jimi hendrix]   \n",
       "14             [blues]           [experience hendrix]   \n",
       "15              [acid]                 [jimi hendrix]   \n",
       "16        [blues-rock]                 [jimi hendrix]   \n",
       "17              [rock]  [the jimi hendrix experience]   \n",
       "18             [blues]      [jimi hendrix experience]   \n",
       "19             [blues]                 [jimi hendrix]   \n",
       "20              [rock]                 [jimi hendrix]   \n",
       "21              [rock]                 [jimi hendrix]   \n",
       "22              [rock]  [the jimi hendrix experience]   \n",
       "23             [blues]  [the jimi hendrix experience]   \n",
       "24             [blues]                 [jimi hendrix]   \n",
       "25             [blues]                 [jimi hendrix]   \n",
       "26             [blues]                 [jimi hendrix]   \n",
       "27             [blues]                 [jimi hendrix]   \n",
       "28         [hard rock]                 [jimi hendrix]   \n",
       "29  [progressive rock]                 [jimi hendrix]   \n",
       "\n",
       "                                               albums  \\\n",
       "0                               [are you experienced]   \n",
       "1                               [are you experienced]   \n",
       "2                               [are you experienced]   \n",
       "3       [experience hendrix the best of jimi hendrix]   \n",
       "4      [experience hendrix: the best of jimi hendrix]   \n",
       "5                                      [jimi hendrix]   \n",
       "6                                [experience hendrix]   \n",
       "7     [astro man(alchemy); - studio outtakes 1966-68]   \n",
       "8     [experience hendrix - the best of jimi hendrix]   \n",
       "9                               [are you experienced]   \n",
       "10  [the last ever show - love and peace festival ...   \n",
       "11                                      [purple haze]   \n",
       "12                         [la forum 26th april 1969]   \n",
       "13      [blue wild angel : live at the isle of wight]   \n",
       "14                                     [jimi hendrix]   \n",
       "15                                [astro man box set]   \n",
       "16                             [best of jimi hendrix]   \n",
       "17                          [no more a rolling stone]   \n",
       "18              [the vpro archive - it must be dusty]   \n",
       "19                                    [rescuedisland]   \n",
       "20  [astro man(alchemy); - live in paris jan 29th ...   \n",
       "21  [astro man(alchemy); - live in stockholm secon...   \n",
       "22                          [no more a rolling stone]   \n",
       "23      [1968.10.10-12 the definitive winterlandtwo]]   \n",
       "24                          [the ultimate experience]   \n",
       "25                          [the ultimate experience]   \n",
       "26                          [the ultimate experience]   \n",
       "27                                     [bbc sessions]   \n",
       "28                          [the ultimate experience]   \n",
       "29                          [the ultimate experience]   \n",
       "\n",
       "                                                songs  \n",
       "0   [third stone from the sun, remember, fire, can...  \n",
       "1   [i don't live today, 51st anniversary, stone f...  \n",
       "2   [love or confusion, remember, highway chile, m...  \n",
       "3   [foxey lady, dolly dagger, bold as love, if 6 ...  \n",
       "4   [if six was nine, foxey lady, bold as love, ni...  \n",
       "5   [fire (verse);, foxey lady (solo, slow);, fire...  \n",
       "6   [bold as love, night bird flying, if 6 was 9, ...  \n",
       "7   [purple haze 1 (4);, 51st anniversary (5);, la...  \n",
       "8   [bold as love, night bird flying, if 6 was 9, ...  \n",
       "9   [3rd stone from the sun, remember, foxy lady, ...  \n",
       "10  [land of the new rising sun, ezy rider, room f...  \n",
       "11  [sgt. pepper's lonely hearts club band, voodoo...  \n",
       "12  [voodoo chile (slight reprise);, i dont live t...  \n",
       "13  [in from the storm, ezy rider, hey baby (new r...  \n",
       "14  [woodo child (slight return);, minic depressio...  \n",
       "15  [can you see me (pre unre);, purple haze (pre ...  \n",
       "16  [blues, blues, free spirit, star spangled bann...  \n",
       "17  [killin' floor, foxy lady, the wind cries mary...  \n",
       "18  [mockingbird (mpeg1 video data);, spoken word,...  \n",
       "19  [ezy ryder, my friend, message to love, drifti...  \n",
       "20  [purple haze ( 6); (live 1 68);, fire (1 ); (l...  \n",
       "21  [hey joe (43); (live 1 69);, fire (44); (live ...  \n",
       "22  [the burning of the midnight lamp, sgt. pepper...  \n",
       "23  [are your experienced, tax free, red house, he...  \n",
       "24  [star spangled banner (live);, wild thing (liv...  \n",
       "25  [the wind cries mary, castles made of sand, wi...  \n",
       "26  [wild thing (live);, star spangled banner (liv...  \n",
       "27  [driving south, hear my train a comin, foxy la...  \n",
       "28  [star spangled banner (live);, voodoo chile (s...  \n",
       "29  [mnic depression, wild thing (live);, star spa...  "
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"// Search input\n",
    "WITH\n",
    "1 as userID,\n",
    "'Jimi Hendrix purple haze are you experienced' as searchQuery,\n",
    "//'Ludwig van Beethoven Für Elise Symphony' as searchQuery,\n",
    "'all' as searchMask\n",
    "\n",
    "CALL {\n",
    "    // Artists\n",
    "    WITH searchQuery, searchMask\n",
    "    CALL db.index.fulltext.queryNodes('artists', searchQuery) \n",
    "    YIELD node, score\n",
    "    WHERE searchMask = 'all' or searchMask = 'artists'\n",
    "    RETURN node, score\n",
    "    UNION \n",
    "\n",
    "    // Songs\n",
    "    WITH searchQuery, searchMask\n",
    "    CALL db.index.fulltext.queryNodes('songs', searchQuery) \n",
    "    YIELD node, score\n",
    "    WHERE searchMask = 'all' or searchMask = 'songs'\n",
    "    RETURN node, score\n",
    "    UNION \n",
    "    \n",
    "    // Albums\n",
    "    WITH searchQuery, searchMask\n",
    "    CALL db.index.fulltext.queryNodes('albums', searchQuery) \n",
    "    YIELD node, score\n",
    "    WHERE searchMask = 'all' or searchMask = 'albums'\n",
    "    RETURN node, score\n",
    "}\n",
    "WITH node, score, userID\n",
    "MATCH (node)-[r:APPEARED_ON]->(c:CD)\n",
    "WITH DISTINCT c.id as id, c,  sum(score) as score_content, userID\n",
    "\n",
    "// Get more information about the CDs \n",
    "MATCH (c)-[:CONTAINS]->(ar:Artist)\n",
    "MATCH (c)-[:CONTAINS]->(ab:Album)\n",
    "MATCH (c)-[:CONTAINS]->(so:Song)\n",
    "MATCH (c)-[:BELONGS_TO]->(ge:Genre)\n",
    "OPTIONAL MATCH (c)<-[r:PREFERRES]-(u:User {id: userID})\n",
    "OPTIONAL MATCH (ge)<-[r2:PREFERRES]-(u2:User {id: userID})\n",
    "\n",
    "RETURN \n",
    "id, userID, score_content, sum(r.score) as score_pref, r2.score as score_genre ,\n",
    "score_content + (sum(r.score)  * score_content) + (COALESCE(r2.score, 0)  * score_content) as score_combined,\n",
    "collect(DISTINCT ge.genre) as genres,\n",
    "collect(DISTINCT ar.artist) as artists,\n",
    "collect(DISTINCT ab.album) as albums, \n",
    "collect(DISTINCT so.song) as songs\n",
    "\n",
    "ORDER BY score_combined DESC\n",
    "LIMIT 100\"\"\"\n",
    "\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data.head(30)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "***"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "tags": []
   },
   "source": [
    "#### Demonstrating Search"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from search import Search"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Create Instance of Search Engine:**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "searchEngine = Search(url = \"bolt://localhost:7687\", user= \"neo4j\", \n",
    "                      password = \"subatomic-shrank-Respond\", database_name = \"cddb\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Search for Jimi Hendrix:**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nodeId</th>\n",
       "      <th>count</th>\n",
       "      <th>score_cont</th>\n",
       "      <th>score_pref</th>\n",
       "      <th>artists</th>\n",
       "      <th>albums</th>\n",
       "      <th>songs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>7923</td>\n",
       "      <td>1</td>\n",
       "      <td>0.265149</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>[signature licks]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[fire (verse);, foxey lady (solo, slow);, fire...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2023</td>\n",
       "      <td>2</td>\n",
       "      <td>0.133564</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix - the best of jimi hendrix]</td>\n",
       "      <td>[bold as love, night bird flying, if 6 was 9, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>35734</td>\n",
       "      <td>2</td>\n",
       "      <td>0.133564</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[i don't live today, 51st anniversary, stone f...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>677</td>\n",
       "      <td>2</td>\n",
       "      <td>0.133564</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[third stone from the sun, remember, fire, can...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>46232</td>\n",
       "      <td>2</td>\n",
       "      <td>0.133564</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix the best of jimi hendrix]</td>\n",
       "      <td>[foxey lady, dolly dagger, bold as love, if 6 ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>136907</td>\n",
       "      <td>2</td>\n",
       "      <td>0.133564</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[love or confusion, remember, highway chile, m...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>162186</td>\n",
       "      <td>2</td>\n",
       "      <td>0.133564</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix: the best of jimi hendrix]</td>\n",
       "      <td>[if six was nine, foxey lady, bold as love, ni...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>20222</td>\n",
       "      <td>2</td>\n",
       "      <td>0.133564</td>\n",
       "      <td>0.017759</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[best of jimi hendrix]</td>\n",
       "      <td>[blues, blues, free spirit, star spangled bann...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>33321</td>\n",
       "      <td>2</td>\n",
       "      <td>0.133564</td>\n",
       "      <td>0.017759</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[astro man(alchemy); - studio outtakes 1966-68]</td>\n",
       "      <td>[purple haze 1 (4);, 51st anniversary (5);, la...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>30138</td>\n",
       "      <td>2</td>\n",
       "      <td>0.133564</td>\n",
       "      <td>0.017759</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[astro man box set]</td>\n",
       "      <td>[can you see me (pre unre);, purple haze (pre ...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   nodeId  count  score_cont  score_pref            artists  \\\n",
       "0    7923      1    0.265149    0.000000  [signature licks]   \n",
       "1    2023      2    0.133564    0.034758     [jimi hendrix]   \n",
       "2   35734      2    0.133564    0.034758     [jimi hendrix]   \n",
       "3     677      2    0.133564    0.034758     [jimi hendrix]   \n",
       "4   46232      2    0.133564    0.034758     [jimi hendrix]   \n",
       "5  136907      2    0.133564    0.034758     [jimi hendrix]   \n",
       "6  162186      2    0.133564    0.034758     [jimi hendrix]   \n",
       "7   20222      2    0.133564    0.017759     [jimi hendrix]   \n",
       "8   33321      2    0.133564    0.017759     [jimi hendrix]   \n",
       "9   30138      2    0.133564    0.017759     [jimi hendrix]   \n",
       "\n",
       "                                            albums  \\\n",
       "0                                   [jimi hendrix]   \n",
       "1  [experience hendrix - the best of jimi hendrix]   \n",
       "2                            [are you experienced]   \n",
       "3                            [are you experienced]   \n",
       "4    [experience hendrix the best of jimi hendrix]   \n",
       "5                            [are you experienced]   \n",
       "6   [experience hendrix: the best of jimi hendrix]   \n",
       "7                           [best of jimi hendrix]   \n",
       "8  [astro man(alchemy); - studio outtakes 1966-68]   \n",
       "9                              [astro man box set]   \n",
       "\n",
       "                                               songs  \n",
       "0  [fire (verse);, foxey lady (solo, slow);, fire...  \n",
       "1  [bold as love, night bird flying, if 6 was 9, ...  \n",
       "2  [i don't live today, 51st anniversary, stone f...  \n",
       "3  [third stone from the sun, remember, fire, can...  \n",
       "4  [foxey lady, dolly dagger, bold as love, if 6 ...  \n",
       "5  [love or confusion, remember, highway chile, m...  \n",
       "6  [if six was nine, foxey lady, bold as love, ni...  \n",
       "7  [blues, blues, free spirit, star spangled bann...  \n",
       "8  [purple haze 1 (4);, 51st anniversary (5);, la...  \n",
       "9  [can you see me (pre unre);, purple haze (pre ...  "
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "user_id = 1\n",
    "search_input = \"Jimi Hendrix purple haze are you experienced\"\n",
    "search_mask = \"all\"\n",
    "\n",
    "results = searchEngine.searchInGraph(user_id = 1, search_input = search_input, search_mask= search_mask)\n",
    "results.head(30)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Search for Beethoven:**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nodeId</th>\n",
       "      <th>count</th>\n",
       "      <th>score_cont</th>\n",
       "      <th>score_pref</th>\n",
       "      <th>artists</th>\n",
       "      <th>albums</th>\n",
       "      <th>songs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>140152</td>\n",
       "      <td>1</td>\n",
       "      <td>0.144670</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>[pollini maurizio]</td>\n",
       "      <td>[kaiser 5.2]</td>\n",
       "      <td>[erläuterungen von joachim kaiser mit musikbei...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>33062</td>\n",
       "      <td>1</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.255736</td>\n",
       "      <td>[ben harper]</td>\n",
       "      <td>[fight for your mind]</td>\n",
       "      <td>[one road to freedom, give a man a home, oppre...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>167085</td>\n",
       "      <td>1</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.238738</td>\n",
       "      <td>[jannedaarc]</td>\n",
       "      <td>[arcadia]</td>\n",
       "      <td>[romancã, heavy damage, acid breath, dolls, wi...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>28698</td>\n",
       "      <td>1</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.221739</td>\n",
       "      <td>[ben harper]</td>\n",
       "      <td>[fight for your mind]</td>\n",
       "      <td>[oppression, excuse me mr, give a man a home, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>141988</td>\n",
       "      <td>1</td>\n",
       "      <td>0.108912</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>[philip jones bläserensemble]</td>\n",
       "      <td>[trumpet voluntary]</td>\n",
       "      <td>[sonata pian' e forte (giovanni gabrieli);, ea...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>166362</td>\n",
       "      <td>1</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.187743</td>\n",
       "      <td>[the coral]</td>\n",
       "      <td>[the invisible invasion]</td>\n",
       "      <td>[cripples crown, gina jones, leeslunchboxbyblu...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>13220</td>\n",
       "      <td>1</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.170744</td>\n",
       "      <td>[groundhogs]</td>\n",
       "      <td>[who will save the world]</td>\n",
       "      <td>[music is the food of thought, wages of peace,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>11783</td>\n",
       "      <td>1</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.170744</td>\n",
       "      <td>[groundhogs]</td>\n",
       "      <td>[who will save the world]</td>\n",
       "      <td>[wages of peace, the grey maze, body in mind, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>124071</td>\n",
       "      <td>1</td>\n",
       "      <td>0.073155</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>[ludwig van beethoven]</td>\n",
       "      <td>[beethoven for meditation]</td>\n",
       "      <td>[piano and wind quintet andante cantabile, sep...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>114751</td>\n",
       "      <td>1</td>\n",
       "      <td>0.073155</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>[ludwig van beethoven]</td>\n",
       "      <td>[beethoven greatest hits]</td>\n",
       "      <td>[choral fantasy conclusion, moonlight sonata a...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   nodeId  count  score_cont  score_pref                        artists  \\\n",
       "0  140152      1    0.144670    0.000000             [pollini maurizio]   \n",
       "1   33062      1    0.000000    0.255736                   [ben harper]   \n",
       "2  167085      1    0.000000    0.238738                   [jannedaarc]   \n",
       "3   28698      1    0.000000    0.221739                   [ben harper]   \n",
       "4  141988      1    0.108912    0.000000  [philip jones bläserensemble]   \n",
       "5  166362      1    0.000000    0.187743                    [the coral]   \n",
       "6   13220      1    0.000000    0.170744                   [groundhogs]   \n",
       "7   11783      1    0.000000    0.170744                   [groundhogs]   \n",
       "8  124071      1    0.073155    0.000000         [ludwig van beethoven]   \n",
       "9  114751      1    0.073155    0.000000         [ludwig van beethoven]   \n",
       "\n",
       "                       albums  \\\n",
       "0                [kaiser 5.2]   \n",
       "1       [fight for your mind]   \n",
       "2                   [arcadia]   \n",
       "3       [fight for your mind]   \n",
       "4         [trumpet voluntary]   \n",
       "5    [the invisible invasion]   \n",
       "6   [who will save the world]   \n",
       "7   [who will save the world]   \n",
       "8  [beethoven for meditation]   \n",
       "9   [beethoven greatest hits]   \n",
       "\n",
       "                                               songs  \n",
       "0  [erläuterungen von joachim kaiser mit musikbei...  \n",
       "1  [one road to freedom, give a man a home, oppre...  \n",
       "2  [romancã, heavy damage, acid breath, dolls, wi...  \n",
       "3  [oppression, excuse me mr, give a man a home, ...  \n",
       "4  [sonata pian' e forte (giovanni gabrieli);, ea...  \n",
       "5  [cripples crown, gina jones, leeslunchboxbyblu...  \n",
       "6  [music is the food of thought, wages of peace,...  \n",
       "7  [wages of peace, the grey maze, body in mind, ...  \n",
       "8  [piano and wind quintet andante cantabile, sep...  \n",
       "9  [choral fantasy conclusion, moonlight sonata a...  "
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "user_id = 2\n",
    "search_input = \"Ludwig van Beethoven Für Elise Symphony\"\n",
    "search_mask = \"all\"\n",
    "\n",
    "results = searchEngine.searchInGraph(user_id = 1, search_input = search_input, search_mask= search_mask)\n",
    "results.head(30)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
