{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "tags": []
   },
   "source": [
    "# GDMA Project\n",
    "Author: Julian Schelb (1069967)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import matplotlib.pyplot as plt\n",
    "import numpy as np\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Connection to the database instance"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"subatomic-shrank-Respond\"))\n",
    "database_name = \"cddb\"\n",
    "session = driver.session(database = database_name)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "tags": []
   },
   "source": [
    "### Task 4: Searching and Ranking\n",
    "\n",
    "Implement a simple search engine that enables search by artist, album and\n",
    "song name/title. The results must be ranked based on importance. It is up to\n",
    "you to come up with how the importance of each result is computed and you\n",
    "must justify your decision (it goes without saying that you need to come up\n",
    "with a meaningful definition). However, the importance should ideally take into\n",
    "account user preferences/likes. As such, this task is split in two parts:\n",
    "\n",
    "**1. Write a Cypher query that adds a relationship :LIKES between a node with**\n",
    "\n",
    "label :User and an artist, album, or song. Every user should be identified\n",
    "just by a numerical userID (no more information is necessary). If a user\n",
    "already exists in the system, no additional node should be added. After\n",
    "coming up with the necessary Cypher query, add a significant number of\n",
    "users and likes.\n",
    "\n",
    "**2. Implement a simple Python function that has the following arguments:**\n",
    "\n",
    "- the userID of the user submitting the search (the user ID may not\n",
    "exist in the database),\n",
    "- a string that contains one or more keywords for the search, and\n",
    "- an optional argument that indicates whether the search is on all or\n",
    "a specific field, i.e., artist, album, song.\n",
    "The search must return exactly 10 results.\n",
    "\n",
    "Python must only be used to call the database. You should not write any\n",
    "code in Python that implements functionality necessary for the task. However,\n",
    "submitting multiple queries in the same function call is allowed. Also, for this\n",
    "task of the project, you are not only allowed but also encouraged to use functions\n",
    "from the GDS library of Neo4j. Hence, before making any decisions, have a\n",
    "careful look at the available functions. Again, you have to justify the use of any\n",
    "function that you employ"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ar.artist</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>the frequency benders</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>boyz ii men</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>adriana calcanhoto</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>syl johnson</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>cheo feliciano</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5619</th>\n",
       "      <td>garry harrison</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5620</th>\n",
       "      <td>catuaba com amendoim</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5621</th>\n",
       "      <td>jimmy powells</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5622</th>\n",
       "      <td>ofra haza</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5623</th>\n",
       "      <td>michael flatley</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5624 rows × 1 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                  ar.artist\n",
       "0     the frequency benders\n",
       "1               boyz ii men\n",
       "2        adriana calcanhoto\n",
       "3               syl johnson\n",
       "4            cheo feliciano\n",
       "...                     ...\n",
       "5619         garry harrison\n",
       "5620   catuaba com amendoim\n",
       "5621          jimmy powells\n",
       "5622              ofra haza\n",
       "5623        michael flatley\n",
       "\n",
       "[5624 rows x 1 columns]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (c:CD)-[r:CONTAINS]->(ar:Artist)\n",
    "WHERE c.ayear = 2000\n",
    "RETURN DISTINCT ar.artist\n",
    "\"\"\"\n",
    "        \n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Processing"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Ideas:** \n",
    "\n",
    "Inplicit Meassures (to avoid cold start problem):\n",
    "- Centrality in subgraph of artists, albums, songs according to search input (Use exact match and partial match) (and maybe liked nodes?)\n",
    "    1) Select Subgraph by filtering artbist, albums and songs by input\n",
    "    2) Calculate centrality (Multiple meassures)\n",
    "    3) Cd with higher centrality is considered better\n",
    "    \n",
    "\n",
    "User Preference:\n",
    "\n",
    "- Use Nod2Vec Embedding to compute Similarity to already liked Nodes:\n",
    "    1) Include similar nodes to already liked ones\n",
    "    2) Average similarity of artists/albums/sing nodes ... compared to previous likes\n",
    "- Use average Distance to liked Nodes. (basically already included)\n",
    "- centrality in the subgraph ob liked nodes (basically already included)\n",
    "\n",
    "Output:\n",
    "\n",
    "cd id, contained songs, contained artists, contained albums, centralities, cumulated scores"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Adding Example Users"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Function to create Example User:**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [],
   "source": [
    "def createExampleUser(user_id = 1, genre = \"rock\", limit = 50):\n",
    "    \n",
    "    ####### DELETE USER NODE #######\n",
    "    query1 = \"\"\"\n",
    "    MATCH (u:User)\n",
    "    WHERE u.id = $user_id\n",
    "    DETACH DELETE u\n",
    "    \"\"\"\n",
    "    \n",
    "    ####### CREATE USER NODE #######\n",
    "    query2 = \"\"\"\n",
    "    MERGE (u:User {id:  $user_id})\n",
    "    RETURN u.id as user_id\n",
    "    \"\"\"\n",
    "    \n",
    "    ####### LINK TO LIKED SONGS #######\n",
    "    query3 = \"\"\"\n",
    "    MATCH (g:Genre)<-[r:BELONGS_TO]-(c:CD)\n",
    "    MATCH (c)-[r2:CONTAINS]->(s:Song)\n",
    "    WHERE g.genre = $genre\n",
    "    WITH s \n",
    "    LIMIT $limit\n",
    "    MATCH (u:User)\n",
    "    WHERE u.id = $user_id\n",
    "    MERGE (u)-[r3:LIKES]->(s)\n",
    "    \"\"\"\n",
    "    \n",
    "    ####### LINK TO LIKED ARTISTS #######\n",
    "    query4 = \"\"\"\n",
    "    MATCH (g:Genre)<-[r:BELONGS_TO]-(c:CD)\n",
    "    MATCH (c)-[r2:CONTAINS]->(t:Artist)\n",
    "    WHERE g.genre = $genre\n",
    "    WITH t \n",
    "    LIMIT $limit\n",
    "    MATCH (u:User)\n",
    "    WHERE u.id = $user_id\n",
    "    MERGE (u)-[r3:LIKES]->(t)\n",
    "    \"\"\"\n",
    "    \n",
    "    ####### LINK TO LIKED ALBUMS #######\n",
    "    query5 = \"\"\"\n",
    "    MATCH (g:Genre)<-[r:BELONGS_TO]-(c:CD)\n",
    "    MATCH (c)-[r2:CONTAINS]->(t:Album)\n",
    "    WHERE g.genre = $genre\n",
    "    WITH t \n",
    "    LIMIT $limit\n",
    "    MATCH (u:User)\n",
    "    WHERE u.id = $user_id\n",
    "    MERGE (u)-[r3:LIKES]->(t)\n",
    "    \"\"\"\n",
    "\n",
    "    with driver.session(database = database_name) as session:\n",
    "        session.run(query1, user_id = user_id)\n",
    "        session.run(query2, user_id = user_id)\n",
    "        session.run(query3, user_id = user_id, genre = genre, limit = limit)\n",
    "        session.run(query4, user_id = user_id, genre = genre, limit = limit)\n",
    "        session.run(query5, user_id = user_id, genre = genre, limit = limit)\n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Adding some Likes to model User Preference:**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [],
   "source": [
    "# User 1 likes \"Rock\" music\n",
    "createExampleUser(user_id = 1, genre = \"rock\", limit = 50)\n",
    "# User 2 likes \"classic\" music\n",
    "# createExampleUser(user_id = 2, genre = \"classic\", limit = 5)\n",
    "# User 3 likes \"pop\" music\n",
    "# createExampleUser(user_id = 3, genre = \"pop\", limit = 50)\n",
    "# User 4 likes \"hip-hop\" music\n",
    "# createExampleUser(user_id = 4, genre = \"hip-hop\", limit = 50)\n",
    "# User 5 likes \"hip-hop\" music\n",
    "# createExampleUser(user_id = 5, genre = \"hard rock\", limit = 50)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "# User 2 likes \"classic\" music\n",
    "# createExampleUser(user_id = 0, genre = \"classic\", limit = 500)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "***"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Implementing Search Engine"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Feature 1: User Preference"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>graphName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>searchdomain_preference</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 graphName\n",
       "0  searchdomain_preference"
      ]
     },
     "execution_count": 55,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "// DELETE EXISTING PROJECTION\n",
    "CALL gds.graph.drop('searchdomain_preference', false) \n",
    "YIELD graphName \n",
    "RETURN graphName\n",
    "\"\"\"\n",
    "\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>graphName</th>\n",
       "      <th>nodes</th>\n",
       "      <th>rels</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>searchdomain_preference</td>\n",
       "      <td>2071</td>\n",
       "      <td>2108</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 graphName  nodes  rels\n",
       "0  searchdomain_preference   2071  2108"
      ]
     },
     "execution_count": 56,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "// CREATE NEW PROJECTION WITH SEARCH RELEVANT SUB GRAPH\n",
    "CALL gds.graph.project.cypher(\n",
    "  'searchdomain_preference',\n",
    "  ' // Liked Artists, Albums and Songs\n",
    "    MATCH (u:User)-[:LIKES]->(n) \n",
    "    WHERE u.id = 1\n",
    "        AND (n:Song OR n:Album OR n:Artist) \n",
    "    RETURN id(n) AS id, labels(n) AS labels \n",
    "    LIMIT 100000\n",
    "    \n",
    "    UNION\n",
    "    \n",
    "    // CDs linked to liked Artists, Albums and Songs\n",
    "    MATCH (u:User)-[:LIKES]->(x)-[:APPEARED_ON]->(n:CD) \n",
    "    WHERE u.id = 1 \n",
    "    RETURN id(n) AS id, labels(n) AS labels \n",
    "    LIMIT 100000',\n",
    "    \n",
    "    'MATCH (u:User)-[:LIKES]->(n)\n",
    "    WHERE u.id = 1\n",
    "    AND (n:CD OR n:Song OR n:Album OR n:Artist) \n",
    "    MATCH (n)-[r:APPEARED_ON]->(m:CD) \n",
    "    RETURN id(n) AS source, id(m) AS target, type(r) AS type \n",
    "    LIMIT 100000' \n",
    ")\n",
    "YIELD\n",
    "  graphName, nodeCount AS nodes, relationshipCount AS rels\n",
    "RETURN graphName, nodes, rels\n",
    "\"\"\"\n",
    "\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>minimumScore</th>\n",
       "      <th>meanScore</th>\n",
       "      <th>nodePropertiesWritten</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.000761</td>\n",
       "      <td>0.018063</td>\n",
       "      <td>2071</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   minimumScore  meanScore  nodePropertiesWritten\n",
       "0      0.000761   0.018063                   2071"
      ]
     },
     "execution_count": 57,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# https://neo4j.com/docs/graph-data-science/current/algorithms/eigenvector-centrality/\n",
    "query = \"\"\"\n",
    "CALL gds.eigenvector.mutate('searchdomain_preference',  {\n",
    "  mutateProperty: 'score_eig'\n",
    "})\n",
    "YIELD centralityDistribution, nodePropertiesWritten, ranIterations\n",
    "RETURN centralityDistribution.min AS minimumScore, centralityDistribution.mean AS meanScore, nodePropertiesWritten\n",
    "\"\"\"\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data.head(30)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>minimumScore</th>\n",
       "      <th>meanScore</th>\n",
       "      <th>nodePropertiesWritten</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.0</td>\n",
       "      <td>0.928054</td>\n",
       "      <td>2071</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   minimumScore  meanScore  nodePropertiesWritten\n",
       "0           0.0   0.928054                   2071"
      ]
     },
     "execution_count": 58,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# https://neo4j.com/docs/graph-data-science/current/algorithms/closeness-centrality/#algorithms-closeness-centrality-examples-mutate\n",
    "query = \"\"\"\n",
    "CALL gds.beta.closeness.mutate('searchdomain_preference',  {\n",
    "  mutateProperty: 'score_cln'\n",
    "})\n",
    "YIELD centralityDistribution, nodePropertiesWritten\n",
    "RETURN centralityDistribution.min AS minimumScore, centralityDistribution.mean AS meanScore, nodePropertiesWritten\n",
    "\"\"\"\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data.head(30)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>minimumScore</th>\n",
       "      <th>meanScore</th>\n",
       "      <th>nodePropertiesWritten</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.0</td>\n",
       "      <td>1.017868</td>\n",
       "      <td>2071</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   minimumScore  meanScore  nodePropertiesWritten\n",
       "0           0.0   1.017868                   2071"
      ]
     },
     "execution_count": 59,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# https://neo4j.com/docs/graph-data-science/current/algorithms/degree-centrality/\n",
    "query = \"\"\"\n",
    "CALL gds.degree.mutate('searchdomain_preference',  {\n",
    "  mutateProperty: 'score_deg'\n",
    "})\n",
    "YIELD centralityDistribution, nodePropertiesWritten\n",
    "RETURN centralityDistribution.min AS minimumScore, centralityDistribution.mean AS meanScore, nodePropertiesWritten\n",
    "\"\"\"\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data.head(30)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>values</th>\n",
       "      <th>sum_values</th>\n",
       "      <th>artists</th>\n",
       "      <th>albums</th>\n",
       "      <th>songs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>7490</td>\n",
       "      <td>[0.0, 444.0, 0.0007609639559427433]</td>\n",
       "      <td>444.000761</td>\n",
       "      <td>[billie holiday]</td>\n",
       "      <td>[the ultimate collection]</td>\n",
       "      <td>[the blues are brewin, i'll get by (as long as...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1538</td>\n",
       "      <td>[0.0, 421.0, 0.0007609639559427433]</td>\n",
       "      <td>421.000761</td>\n",
       "      <td>[mauv]</td>\n",
       "      <td>[omniprésence]</td>\n",
       "      <td>[omniprésence [1], omniprésence [ ]]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>76</td>\n",
       "      <td>[0.0, 256.0, 0.0007609639559427433]</td>\n",
       "      <td>256.000761</td>\n",
       "      <td>[eric clapton]</td>\n",
       "      <td>[the great blues works]</td>\n",
       "      <td>[good morning little schoolgirl, five long yea...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4721</td>\n",
       "      <td>[0.0, 106.0, 0.0007609639559427433]</td>\n",
       "      <td>106.000761</td>\n",
       "      <td>[lifehouse]</td>\n",
       "      <td>[hangingmoment]</td>\n",
       "      <td>[fairy tales and sandcastles, fool, what's wro...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>529</td>\n",
       "      <td>[0.0, 74.0, 0.0007609639559427433]</td>\n",
       "      <td>74.000761</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[bbc sessions]</td>\n",
       "      <td>[driving south, hear my train a comin, foxy la...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>6312</td>\n",
       "      <td>[0.0, 69.0, 0.0007609639559427433]</td>\n",
       "      <td>69.000761</td>\n",
       "      <td>[pink floyd]</td>\n",
       "      <td>[animals]</td>\n",
       "      <td>[dogs, sheep, pigs on the wing [part 1], pigs ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>4534</td>\n",
       "      <td>[0.0, 48.0, 0.0007609639559427433]</td>\n",
       "      <td>48.000761</td>\n",
       "      <td>[depeche mode]</td>\n",
       "      <td>[barrel of a gun]</td>\n",
       "      <td>[barrel of a gun (one inch punch mix);, barrel...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>717</td>\n",
       "      <td>[0.0, 48.0, 0.0007609639559427433]</td>\n",
       "      <td>48.000761</td>\n",
       "      <td>[queen]</td>\n",
       "      <td>[the platinum collection]</td>\n",
       "      <td>[breakthru, one vision, i want it all, i want ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>902</td>\n",
       "      <td>[0.0, 41.0, 0.0007609639559427433]</td>\n",
       "      <td>41.000761</td>\n",
       "      <td>[b'z]</td>\n",
       "      <td>[banzai]</td>\n",
       "      <td>[magnolia]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>2652</td>\n",
       "      <td>[0.0, 34.0, 0.0007609639559427433]</td>\n",
       "      <td>34.000761</td>\n",
       "      <td>[ben harper]</td>\n",
       "      <td>[diamonds on the inside]</td>\n",
       "      <td>[strawberry fields forever, with my own two ha...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>406</td>\n",
       "      <td>[0.0, 32.0, 0.0007609639559427433]</td>\n",
       "      <td>32.000761</td>\n",
       "      <td>[elton john]</td>\n",
       "      <td>[the one]</td>\n",
       "      <td>[simple life]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>9769</td>\n",
       "      <td>[0.0, 29.0, 0.0007609639559427433]</td>\n",
       "      <td>29.000761</td>\n",
       "      <td>[aurra]</td>\n",
       "      <td>[send your love]</td>\n",
       "      <td>[living too fast, keep doin't it, nasty dispos...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>3466</td>\n",
       "      <td>[0.0, 27.0, 0.0007609639559427433]</td>\n",
       "      <td>27.000761</td>\n",
       "      <td>[bon jovi]</td>\n",
       "      <td>[always]</td>\n",
       "      <td>[i wish everyday could be like christmas, plea...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>9431</td>\n",
       "      <td>[0.0, 26.0, 0.0007609639559427433]</td>\n",
       "      <td>26.000761</td>\n",
       "      <td>[rory gallagher]</td>\n",
       "      <td>[photo finish]</td>\n",
       "      <td>[shadow play, the mississippi sheiks, cloak an...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>62</td>\n",
       "      <td>[0.0, 19.0, 0.0007609639559427433]</td>\n",
       "      <td>19.000761</td>\n",
       "      <td>[billy joel]</td>\n",
       "      <td>[piano man : the very best of billy joel]</td>\n",
       "      <td>[the stranger, my life [single version], scand...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>4052</td>\n",
       "      <td>[0.0, 13.0, 0.0007609639559427433]</td>\n",
       "      <td>13.000761</td>\n",
       "      <td>[groundhogs]</td>\n",
       "      <td>[high on the hog]</td>\n",
       "      <td>[no place to go, bleachin' the blues, country ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>18208</td>\n",
       "      <td>[0.0, 11.0, 0.0007609639559427433]</td>\n",
       "      <td>11.000761</td>\n",
       "      <td>[toto]</td>\n",
       "      <td>[through the looking glass (retail);]</td>\n",
       "      <td>[bodhisattva, burn down the mission, while my ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>1775</td>\n",
       "      <td>[0.0, 11.0, 0.0007609639559427433]</td>\n",
       "      <td>11.000761</td>\n",
       "      <td>[buck-tick]</td>\n",
       "      <td>[to-search]</td>\n",
       "      <td>[plastic syndrome type]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>170156</td>\n",
       "      <td>[0.0, 9.0, 0.0007609639559427433]</td>\n",
       "      <td>9.000761</td>\n",
       "      <td>[shu-bi-dua]</td>\n",
       "      <td>[shu-bi-dua 200 6 i]</td>\n",
       "      <td>[nød lærer nøgen kvinde, den lille mands sang,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>27200</td>\n",
       "      <td>[0.0, 9.0, 0.0007609639559427433]</td>\n",
       "      <td>9.000761</td>\n",
       "      <td>[johnny hartman]</td>\n",
       "      <td>[all of me]</td>\n",
       "      <td>[the end of a love affair, i could make you ca...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>6013</td>\n",
       "      <td>[0.0, 9.0, 0.0007609639559427433]</td>\n",
       "      <td>9.000761</td>\n",
       "      <td>[long john baldry]</td>\n",
       "      <td>[midnight in new orleans]</td>\n",
       "      <td>[ain't that peculiar, as long as i feel the sp...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>23850</td>\n",
       "      <td>[0.0, 7.0, 0.0007609639559427433]</td>\n",
       "      <td>7.000761</td>\n",
       "      <td>[?????]</td>\n",
       "      <td>[smile]</td>\n",
       "      <td>[[album ver.], go go, thank you]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>694</td>\n",
       "      <td>[0.0, 7.0, 0.0007609639559427433]</td>\n",
       "      <td>7.000761</td>\n",
       "      <td>[inxs]</td>\n",
       "      <td>[the greatest hits]</td>\n",
       "      <td>[beautiful girl, listen like thieves, never te...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>2640</td>\n",
       "      <td>[0.0, 7.0, 0.0007609639559427433]</td>\n",
       "      <td>7.000761</td>\n",
       "      <td>[the jerry lee phantom]</td>\n",
       "      <td>[rudie's papa]</td>\n",
       "      <td>[outro]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>22379</td>\n",
       "      <td>[0.0, 7.0, 0.0007609639559427433]</td>\n",
       "      <td>7.000761</td>\n",
       "      <td>[pink floyd]</td>\n",
       "      <td>[the wall]</td>\n",
       "      <td>[don't leave now, goodbye blue sky, another br...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>651</td>\n",
       "      <td>[0.0, 6.0, 0.0007609639559427433]</td>\n",
       "      <td>6.000761</td>\n",
       "      <td>[lastier]</td>\n",
       "      <td>[flowers]</td>\n",
       "      <td>[zero]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>10375</td>\n",
       "      <td>[0.0, 6.0, 0.0007609639559427433]</td>\n",
       "      <td>6.000761</td>\n",
       "      <td>[weezer]</td>\n",
       "      <td>[weezer (blue);]</td>\n",
       "      <td>[in the garage, buddy holly, surf wax america,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>15945</td>\n",
       "      <td>[0.0, 6.0, 0.0007609639559427433]</td>\n",
       "      <td>6.000761</td>\n",
       "      <td>[crosby, stills, nash &amp; young]</td>\n",
       "      <td>[deja vu]</td>\n",
       "      <td>[everybody i love you, our house, almost cut m...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>1110</td>\n",
       "      <td>[0.0, 6.0, 0.0007609639559427433]</td>\n",
       "      <td>6.000761</td>\n",
       "      <td>[user]</td>\n",
       "      <td>[burn]</td>\n",
       "      <td>[burn (full phatt main mix);, burn (radio edit);]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>25397</td>\n",
       "      <td>[0.0, 6.0, 0.0007609639559427433]</td>\n",
       "      <td>6.000761</td>\n",
       "      <td>[ana popovic]</td>\n",
       "      <td>[hush]</td>\n",
       "      <td>[how the mighty have fallen, mended, how lonel...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        id                               values  sum_values  \\\n",
       "0     7490  [0.0, 444.0, 0.0007609639559427433]  444.000761   \n",
       "1     1538  [0.0, 421.0, 0.0007609639559427433]  421.000761   \n",
       "2       76  [0.0, 256.0, 0.0007609639559427433]  256.000761   \n",
       "3     4721  [0.0, 106.0, 0.0007609639559427433]  106.000761   \n",
       "4      529   [0.0, 74.0, 0.0007609639559427433]   74.000761   \n",
       "5     6312   [0.0, 69.0, 0.0007609639559427433]   69.000761   \n",
       "6     4534   [0.0, 48.0, 0.0007609639559427433]   48.000761   \n",
       "7      717   [0.0, 48.0, 0.0007609639559427433]   48.000761   \n",
       "8      902   [0.0, 41.0, 0.0007609639559427433]   41.000761   \n",
       "9     2652   [0.0, 34.0, 0.0007609639559427433]   34.000761   \n",
       "10     406   [0.0, 32.0, 0.0007609639559427433]   32.000761   \n",
       "11    9769   [0.0, 29.0, 0.0007609639559427433]   29.000761   \n",
       "12    3466   [0.0, 27.0, 0.0007609639559427433]   27.000761   \n",
       "13    9431   [0.0, 26.0, 0.0007609639559427433]   26.000761   \n",
       "14      62   [0.0, 19.0, 0.0007609639559427433]   19.000761   \n",
       "15    4052   [0.0, 13.0, 0.0007609639559427433]   13.000761   \n",
       "16   18208   [0.0, 11.0, 0.0007609639559427433]   11.000761   \n",
       "17    1775   [0.0, 11.0, 0.0007609639559427433]   11.000761   \n",
       "18  170156    [0.0, 9.0, 0.0007609639559427433]    9.000761   \n",
       "19   27200    [0.0, 9.0, 0.0007609639559427433]    9.000761   \n",
       "20    6013    [0.0, 9.0, 0.0007609639559427433]    9.000761   \n",
       "21   23850    [0.0, 7.0, 0.0007609639559427433]    7.000761   \n",
       "22     694    [0.0, 7.0, 0.0007609639559427433]    7.000761   \n",
       "23    2640    [0.0, 7.0, 0.0007609639559427433]    7.000761   \n",
       "24   22379    [0.0, 7.0, 0.0007609639559427433]    7.000761   \n",
       "25     651    [0.0, 6.0, 0.0007609639559427433]    6.000761   \n",
       "26   10375    [0.0, 6.0, 0.0007609639559427433]    6.000761   \n",
       "27   15945    [0.0, 6.0, 0.0007609639559427433]    6.000761   \n",
       "28    1110    [0.0, 6.0, 0.0007609639559427433]    6.000761   \n",
       "29   25397    [0.0, 6.0, 0.0007609639559427433]    6.000761   \n",
       "\n",
       "                           artists                                     albums  \\\n",
       "0                 [billie holiday]                  [the ultimate collection]   \n",
       "1                           [mauv]                             [omniprésence]   \n",
       "2                   [eric clapton]                    [the great blues works]   \n",
       "3                      [lifehouse]                            [hangingmoment]   \n",
       "4                   [jimi hendrix]                             [bbc sessions]   \n",
       "5                     [pink floyd]                                  [animals]   \n",
       "6                   [depeche mode]                          [barrel of a gun]   \n",
       "7                          [queen]                  [the platinum collection]   \n",
       "8                            [b'z]                                   [banzai]   \n",
       "9                     [ben harper]                   [diamonds on the inside]   \n",
       "10                    [elton john]                                  [the one]   \n",
       "11                         [aurra]                           [send your love]   \n",
       "12                      [bon jovi]                                   [always]   \n",
       "13                [rory gallagher]                             [photo finish]   \n",
       "14                    [billy joel]  [piano man : the very best of billy joel]   \n",
       "15                    [groundhogs]                          [high on the hog]   \n",
       "16                          [toto]      [through the looking glass (retail);]   \n",
       "17                     [buck-tick]                                [to-search]   \n",
       "18                    [shu-bi-dua]                       [shu-bi-dua 200 6 i]   \n",
       "19                [johnny hartman]                                [all of me]   \n",
       "20              [long john baldry]                  [midnight in new orleans]   \n",
       "21                         [?????]                                    [smile]   \n",
       "22                          [inxs]                        [the greatest hits]   \n",
       "23         [the jerry lee phantom]                             [rudie's papa]   \n",
       "24                    [pink floyd]                                 [the wall]   \n",
       "25                       [lastier]                                  [flowers]   \n",
       "26                        [weezer]                           [weezer (blue);]   \n",
       "27  [crosby, stills, nash & young]                                  [deja vu]   \n",
       "28                          [user]                                     [burn]   \n",
       "29                   [ana popovic]                                     [hush]   \n",
       "\n",
       "                                                songs  \n",
       "0   [the blues are brewin, i'll get by (as long as...  \n",
       "1                [omniprésence [1], omniprésence [ ]]  \n",
       "2   [good morning little schoolgirl, five long yea...  \n",
       "3   [fairy tales and sandcastles, fool, what's wro...  \n",
       "4   [driving south, hear my train a comin, foxy la...  \n",
       "5   [dogs, sheep, pigs on the wing [part 1], pigs ...  \n",
       "6   [barrel of a gun (one inch punch mix);, barrel...  \n",
       "7   [breakthru, one vision, i want it all, i want ...  \n",
       "8                                          [magnolia]  \n",
       "9   [strawberry fields forever, with my own two ha...  \n",
       "10                                      [simple life]  \n",
       "11  [living too fast, keep doin't it, nasty dispos...  \n",
       "12  [i wish everyday could be like christmas, plea...  \n",
       "13  [shadow play, the mississippi sheiks, cloak an...  \n",
       "14  [the stranger, my life [single version], scand...  \n",
       "15  [no place to go, bleachin' the blues, country ...  \n",
       "16  [bodhisattva, burn down the mission, while my ...  \n",
       "17                            [plastic syndrome type]  \n",
       "18  [nød lærer nøgen kvinde, den lille mands sang,...  \n",
       "19  [the end of a love affair, i could make you ca...  \n",
       "20  [ain't that peculiar, as long as i feel the sp...  \n",
       "21                   [[album ver.], go go, thank you]  \n",
       "22  [beautiful girl, listen like thieves, never te...  \n",
       "23                                            [outro]  \n",
       "24  [don't leave now, goodbye blue sky, another br...  \n",
       "25                                             [zero]  \n",
       "26  [in the garage, buddy holly, surf wax america,...  \n",
       "27  [everybody i love you, our house, almost cut m...  \n",
       "28  [burn (full phatt main mix);, burn (radio edit);]  \n",
       "29  [how the mighty have fallen, mended, how lonel...  "
      ]
     },
     "execution_count": 60,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "CALL gds.graph.streamNodeProperties('searchdomain_preference', ['score_eig', 'score_deg', 'score_cln'])\n",
    "YIELD nodeId, nodeProperty, propertyValue\n",
    "WITH nodeId, gds.util.asNode(nodeId).id AS id, nodeProperty, propertyValue\n",
    "\n",
    "ORDER BY nodeId, nodeProperty\n",
    "WITH  nodeId, gds.util.asNode(nodeId).id as id, \n",
    "collect(nodeProperty) as properties , collect(propertyValue) as values, sum(propertyValue) as sum_values\n",
    "\n",
    "MATCH (n:CD)\n",
    "WHERE n.id = id\n",
    "MATCH (n)-[:CONTAINS]->(ar:Artist)\n",
    "MATCH (n)-[:CONTAINS]->(ab:Album)\n",
    "MATCH (n)-[:CONTAINS]->(so:Song)\n",
    "RETURN id, \n",
    "values, sum_values, \n",
    "collect(DISTINCT ar.artist) as artists,\n",
    "collect(DISTINCT ab.album) as albums, \n",
    "collect(DISTINCT so.song) as songs\n",
    "ORDER BY sum_values DESC\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data.head(30)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true,
     "source_hidden": true
    },
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>score_eig</th>\n",
       "      <th>t</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>53708</td>\n",
       "      <td>0.061017</td>\n",
       "      <td>[0.06101741687030329]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>135693</td>\n",
       "      <td>0.061017</td>\n",
       "      <td>[0.06101741687030329]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>109958</td>\n",
       "      <td>0.061017</td>\n",
       "      <td>[0.06101741687030329]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>44549</td>\n",
       "      <td>0.061017</td>\n",
       "      <td>[0.06101741687030329]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>47493</td>\n",
       "      <td>0.061017</td>\n",
       "      <td>[0.06101741687030329]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>131914</td>\n",
       "      <td>0.061017</td>\n",
       "      <td>[0.06101741687030329]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>116208</td>\n",
       "      <td>0.061017</td>\n",
       "      <td>[0.06101741687030329]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>51143</td>\n",
       "      <td>0.061017</td>\n",
       "      <td>[0.06101741687030329]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>53698</td>\n",
       "      <td>0.061017</td>\n",
       "      <td>[0.06101741687030329]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>111637</td>\n",
       "      <td>0.061017</td>\n",
       "      <td>[0.06101741687030329]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>130715</td>\n",
       "      <td>0.061017</td>\n",
       "      <td>[0.06101741687030329]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>110242</td>\n",
       "      <td>0.061017</td>\n",
       "      <td>[0.06101741687030329]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>134023</td>\n",
       "      <td>0.061017</td>\n",
       "      <td>[0.06101741687030329]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>50271</td>\n",
       "      <td>0.061017</td>\n",
       "      <td>[0.06101741687030329]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>50208</td>\n",
       "      <td>0.061017</td>\n",
       "      <td>[0.06101741687030329]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>128419</td>\n",
       "      <td>0.031194</td>\n",
       "      <td>[0.031193962192513462]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>117309</td>\n",
       "      <td>0.031194</td>\n",
       "      <td>[0.031193962192513462]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>51030</td>\n",
       "      <td>0.031194</td>\n",
       "      <td>[0.031193962192513462]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>124770</td>\n",
       "      <td>0.031194</td>\n",
       "      <td>[0.031193962192513462]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>49856</td>\n",
       "      <td>0.031194</td>\n",
       "      <td>[0.031193962192513462]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>129040</td>\n",
       "      <td>0.031194</td>\n",
       "      <td>[0.031193962192513462]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>49501</td>\n",
       "      <td>0.031194</td>\n",
       "      <td>[0.031193962192513462]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>41559</td>\n",
       "      <td>0.031194</td>\n",
       "      <td>[0.031193962192513462]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>117694</td>\n",
       "      <td>0.031194</td>\n",
       "      <td>[0.031193962192513462]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>131234</td>\n",
       "      <td>0.031194</td>\n",
       "      <td>[0.031193962192513462]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>114374</td>\n",
       "      <td>0.031194</td>\n",
       "      <td>[0.031193962192513462]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>25435</td>\n",
       "      <td>0.031194</td>\n",
       "      <td>[0.031193962192513462]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>23902</td>\n",
       "      <td>0.031194</td>\n",
       "      <td>[0.031193962192513462]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>139403</td>\n",
       "      <td>0.031194</td>\n",
       "      <td>[0.031193962192513462]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>47898</td>\n",
       "      <td>0.031194</td>\n",
       "      <td>[0.031193962192513462]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        id  score_eig                       t\n",
       "0    53708   0.061017   [0.06101741687030329]\n",
       "1   135693   0.061017   [0.06101741687030329]\n",
       "2   109958   0.061017   [0.06101741687030329]\n",
       "3    44549   0.061017   [0.06101741687030329]\n",
       "4    47493   0.061017   [0.06101741687030329]\n",
       "5   131914   0.061017   [0.06101741687030329]\n",
       "6   116208   0.061017   [0.06101741687030329]\n",
       "7    51143   0.061017   [0.06101741687030329]\n",
       "8    53698   0.061017   [0.06101741687030329]\n",
       "9   111637   0.061017   [0.06101741687030329]\n",
       "10  130715   0.061017   [0.06101741687030329]\n",
       "11  110242   0.061017   [0.06101741687030329]\n",
       "12  134023   0.061017   [0.06101741687030329]\n",
       "13   50271   0.061017   [0.06101741687030329]\n",
       "14   50208   0.061017   [0.06101741687030329]\n",
       "15  128419   0.031194  [0.031193962192513462]\n",
       "16  117309   0.031194  [0.031193962192513462]\n",
       "17   51030   0.031194  [0.031193962192513462]\n",
       "18  124770   0.031194  [0.031193962192513462]\n",
       "19   49856   0.031194  [0.031193962192513462]\n",
       "20  129040   0.031194  [0.031193962192513462]\n",
       "21   49501   0.031194  [0.031193962192513462]\n",
       "22   41559   0.031194  [0.031193962192513462]\n",
       "23  117694   0.031194  [0.031193962192513462]\n",
       "24  131234   0.031194  [0.031193962192513462]\n",
       "25  114374   0.031194  [0.031193962192513462]\n",
       "26   25435   0.031194  [0.031193962192513462]\n",
       "27   23902   0.031194  [0.031193962192513462]\n",
       "28  139403   0.031194  [0.031193962192513462]\n",
       "29   47898   0.031194  [0.031193962192513462]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "CALL gds.graph.streamNodeProperty('searchdomain_preference', 'score_eig')\n",
    "YIELD nodeId as nodeId_eig, propertyValue as score_eig\n",
    "\n",
    "//CALL gds.graph.streamNodeProperty('searchdomain', 'score_deg')\n",
    "//YIELD nodeId as nodeId_deg, propertyValue as propertyValue_deg\n",
    "\n",
    "//CALL gds.graph.streamNodeProperty('searchdomain_preference', 'score_cln')\n",
    "//YIELD nodeId as nodeId_cln, propertyValue as score_cln\n",
    "\n",
    "WITH gds.util.asNode(nodeId_eig).id AS id, \n",
    "score_eig,  collect(score_eig)  as t//avg(score_eig) as score_eig_mean\n",
    "RETURN *\n",
    "ORDER BY score_eig DESC\n",
    "\"\"\"\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data.head(30)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.id</th>\n",
       "      <th>score</th>\n",
       "      <th>artists</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>33062</td>\n",
       "      <td>0.255736</td>\n",
       "      <td>[ben harper]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>167085</td>\n",
       "      <td>0.238738</td>\n",
       "      <td>[jannedaarc]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>28698</td>\n",
       "      <td>0.221739</td>\n",
       "      <td>[ben harper]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>166362</td>\n",
       "      <td>0.187743</td>\n",
       "      <td>[the coral]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>11783</td>\n",
       "      <td>0.170744</td>\n",
       "      <td>[groundhogs]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>13220</td>\n",
       "      <td>0.170744</td>\n",
       "      <td>[groundhogs]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>16055</td>\n",
       "      <td>0.102751</td>\n",
       "      <td>[blankey jet city]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>121360</td>\n",
       "      <td>0.102751</td>\n",
       "      <td>[natural punch drunker]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>32936</td>\n",
       "      <td>0.085753</td>\n",
       "      <td>[ben harper]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>10315</td>\n",
       "      <td>0.085753</td>\n",
       "      <td>[ben harper]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>9573</td>\n",
       "      <td>0.085753</td>\n",
       "      <td>[ben harper]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>27073</td>\n",
       "      <td>0.051756</td>\n",
       "      <td>[ben harper]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>13256</td>\n",
       "      <td>0.051756</td>\n",
       "      <td>[groundhogs]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>34636</td>\n",
       "      <td>0.051756</td>\n",
       "      <td>[groundhogs]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>32617</td>\n",
       "      <td>0.051756</td>\n",
       "      <td>[?????]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>19913</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[long john baldry]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>18048</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[pennebaker]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>23031</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[rory gallagher]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>17331</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[eric clapton]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>15781</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[eric clapton]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>4188</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[inxs]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>161490</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[vama veche]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>33696</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[b'z]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>33556</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[b'z]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>167456</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[b'z]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>148461</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[crosby, stills, nash &amp; young]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>26499</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[pink floyd]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>126397</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[pink floyd]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>156329</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[pink floyd]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>125383</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[pink floyd]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      n.id     score                         artists\n",
       "0    33062  0.255736                    [ben harper]\n",
       "1   167085  0.238738                    [jannedaarc]\n",
       "2    28698  0.221739                    [ben harper]\n",
       "3   166362  0.187743                     [the coral]\n",
       "4    11783  0.170744                    [groundhogs]\n",
       "5    13220  0.170744                    [groundhogs]\n",
       "6    16055  0.102751              [blankey jet city]\n",
       "7   121360  0.102751         [natural punch drunker]\n",
       "8    32936  0.085753                    [ben harper]\n",
       "9    10315  0.085753                    [ben harper]\n",
       "10    9573  0.085753                    [ben harper]\n",
       "11   27073  0.051756                    [ben harper]\n",
       "12   13256  0.051756                    [groundhogs]\n",
       "13   34636  0.051756                    [groundhogs]\n",
       "14   32617  0.051756                         [?????]\n",
       "15   19913  0.034758              [long john baldry]\n",
       "16   18048  0.034758                    [pennebaker]\n",
       "17   23031  0.034758                [rory gallagher]\n",
       "18   17331  0.034758                  [eric clapton]\n",
       "19   15781  0.034758                  [eric clapton]\n",
       "20    4188  0.034758                          [inxs]\n",
       "21  161490  0.034758                    [vama veche]\n",
       "22   33696  0.034758                           [b'z]\n",
       "23   33556  0.034758                           [b'z]\n",
       "24  167456  0.034758                           [b'z]\n",
       "25  148461  0.034758  [crosby, stills, nash & young]\n",
       "26   26499  0.034758                    [pink floyd]\n",
       "27  126397  0.034758                    [pink floyd]\n",
       "28  156329  0.034758                    [pink floyd]\n",
       "29  125383  0.034758                    [pink floyd]"
      ]
     },
     "execution_count": 61,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "CALL gds.eigenvector.stream('searchdomain_preference')\n",
    "YIELD nodeId, score\n",
    "WITH gds.util.asNode(nodeId).id AS nodeId, score\n",
    "MATCH (n:CD)-[r:CONTAINS]->(a:Artist)\n",
    "WHERE n.id = nodeId\n",
    "SET n.eigenvector = score\n",
    "RETURN n.id, score, \n",
    "collect(a.artist) as artists\n",
    "ORDER BY score DESC\n",
    "\"\"\"\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data.head(30)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Feature 2: Content Match with Search Input"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>graphName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>searchdomain_content</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              graphName\n",
       "0  searchdomain_content"
      ]
     },
     "execution_count": 69,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "// DELETE EXISTING PROJECTION\n",
    "CALL gds.graph.drop('searchdomain_content', false) \n",
    "YIELD graphName \n",
    "RETURN graphName\n",
    "\"\"\"\n",
    "\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>graphName</th>\n",
       "      <th>nodes</th>\n",
       "      <th>rels</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>searchdomain_content</td>\n",
       "      <td>140</td>\n",
       "      <td>162</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              graphName  nodes  rels\n",
       "0  searchdomain_content    140   162"
      ]
     },
     "execution_count": 70,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "// CREATE NEW PROJECTION WITH SEARCH RELEVANT SUB GRAPH\n",
    "CALL gds.graph.project.cypher(\n",
    "  \"searchdomain_content\",\n",
    "  \n",
    "  \" // Artists, Albums and Songs which match query\n",
    "    MATCH (n) \n",
    "    WHERE \n",
    "    (n:Song OR n:Album OR n:Artist) \n",
    "    AND \n",
    "    (n.artist =~ \\'.*jimi hendrix.*\\' \n",
    "    OR n.album  =~ '.*Are You Experienced.*' \n",
    "    OR n.song  =~ '.*purple haze.*')\n",
    "    RETURN id(n) AS id, labels(n) AS labels \n",
    "    LIMIT 1000\n",
    "    \n",
    "    UNION\n",
    "    \n",
    "    // CDS linked to Artists, Albums and Songs which match query\n",
    "    MATCH (n)-[:APPEARED_ON]->(c:CD) \n",
    "    WHERE \n",
    "    (n:Song OR n:Album OR n:Artist) \n",
    "    AND \n",
    "    (n.artist =~ '.*jimi hendrix.*' \n",
    "    OR n.album  =~ '.*Are You Experienced.*' \n",
    "    OR n.song  =~ '.*purple haze.*')\n",
    "    RETURN id(c) AS id, labels(c) AS labels \n",
    "    LIMIT 1000\",\n",
    "    \n",
    "    \"MATCH (n)-[r:APPEARED_ON]->(c:CD) \n",
    "    WHERE \n",
    "    (n:Song OR n:Album OR n:Artist) \n",
    "    AND \n",
    "    (n.artist =~ '.*jimi hendrix.*' \n",
    "    OR n.album  =~ '.*Are You Experienced.*' \n",
    "    OR n.song  =~ '.*purple haze.*')\n",
    "    RETURN id(n) AS source, id(c) AS target, type(r) AS type \n",
    "    LIMIT 1000\"\n",
    ")\n",
    "YIELD\n",
    "  graphName, nodeCount AS nodes, relationshipCount AS rels\n",
    "RETURN graphName, nodes, rels\n",
    "\"\"\"\n",
    "\n",
    "\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)]) \n",
    "dtf_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>minimumScore</th>\n",
       "      <th>meanScore</th>\n",
       "      <th>nodePropertiesWritten</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.002642</td>\n",
       "      <td>0.071719</td>\n",
       "      <td>140</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   minimumScore  meanScore  nodePropertiesWritten\n",
       "0      0.002642   0.071719                    140"
      ]
     },
     "execution_count": 71,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# https://neo4j.com/docs/graph-data-science/current/algorithms/eigenvector-centrality/\n",
    "query = \"\"\"\n",
    "CALL gds.eigenvector.mutate('searchdomain_content',  {\n",
    "  mutateProperty: 'score_eig'\n",
    "})\n",
    "YIELD centralityDistribution, nodePropertiesWritten, ranIterations\n",
    "RETURN centralityDistribution.min AS minimumScore, centralityDistribution.mean AS meanScore, nodePropertiesWritten\n",
    "\"\"\"\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data.head(30)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>minimumScore</th>\n",
       "      <th>meanScore</th>\n",
       "      <th>nodePropertiesWritten</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.0</td>\n",
       "      <td>0.85</td>\n",
       "      <td>140</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   minimumScore  meanScore  nodePropertiesWritten\n",
       "0           0.0       0.85                    140"
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# https://neo4j.com/docs/graph-data-science/current/algorithms/closeness-centrality/#algorithms-closeness-centrality-examples-mutate\n",
    "query = \"\"\"\n",
    "CALL gds.beta.closeness.mutate('searchdomain_content',  {\n",
    "  mutateProperty: 'score_cln'\n",
    "})\n",
    "YIELD centralityDistribution, nodePropertiesWritten\n",
    "RETURN centralityDistribution.min AS minimumScore, centralityDistribution.mean AS meanScore, nodePropertiesWritten\n",
    "\"\"\"\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data.head(30)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>minimumScore</th>\n",
       "      <th>meanScore</th>\n",
       "      <th>nodePropertiesWritten</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.0</td>\n",
       "      <td>1.157146</td>\n",
       "      <td>140</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   minimumScore  meanScore  nodePropertiesWritten\n",
       "0           0.0   1.157146                    140"
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# https://neo4j.com/docs/graph-data-science/current/algorithms/degree-centrality/\n",
    "query = \"\"\"\n",
    "CALL gds.degree.mutate('searchdomain_content',  {\n",
    "  mutateProperty: 'score_deg'\n",
    "})\n",
    "YIELD centralityDistribution, nodePropertiesWritten\n",
    "RETURN centralityDistribution.min AS minimumScore, centralityDistribution.mean AS meanScore, nodePropertiesWritten\n",
    "\"\"\"\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data.head(30)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>values</th>\n",
       "      <th>sum_values</th>\n",
       "      <th>artists</th>\n",
       "      <th>albums</th>\n",
       "      <th>songs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>529</td>\n",
       "      <td>[0.0, 74.0, 0.002642306670565559]</td>\n",
       "      <td>74.002642</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[bbc sessions]</td>\n",
       "      <td>[driving south, hear my train a comin, foxy la...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>3248</td>\n",
       "      <td>[0.0, 55.0, 0.002642306670565559]</td>\n",
       "      <td>55.002642</td>\n",
       "      <td>[tamba trio]</td>\n",
       "      <td>[tamba trio]</td>\n",
       "      <td>[consolacao, batida diferente, imagem, canto d...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>452</td>\n",
       "      <td>[0.0, 8.0, 0.002642306670565559]</td>\n",
       "      <td>8.002642</td>\n",
       "      <td>[the jimi hendrix experience]</td>\n",
       "      <td>[bbc sessions]</td>\n",
       "      <td>[driving south (alternate take);, wait until t...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>20709</td>\n",
       "      <td>[0.0, 5.0, 0.002642306670565559]</td>\n",
       "      <td>5.002642</td>\n",
       "      <td>[jimi hendrix experience]</td>\n",
       "      <td>[the vpro archive - it must be dusty]</td>\n",
       "      <td>[mockingbird (mpeg1 video data);, spoken word,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2835</td>\n",
       "      <td>[0.0, 2.0, 0.002642306670565559]</td>\n",
       "      <td>2.002642</td>\n",
       "      <td>[jimi hendrix (w. lonnie youngblood);]</td>\n",
       "      <td>[two great experiencesremastered);]</td>\n",
       "      <td>[she's a fox (1);, groove maker 1 (3);, soul f...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>110321</td>\n",
       "      <td>[0.0, 2.0, 0.002642306670565559]</td>\n",
       "      <td>2.002642</td>\n",
       "      <td>[rajyashree josyer shrikanth]</td>\n",
       "      <td>[sangeetha sowrabha]</td>\n",
       "      <td>[brochevarevarura (khamas, adi, mysore vasudev...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>7923</td>\n",
       "      <td>[1.0, 0.0, 0.3011216110364633]</td>\n",
       "      <td>1.301122</td>\n",
       "      <td>[signature licks]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[fire (verse);, foxey lady (solo, slow);, fire...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>30138</td>\n",
       "      <td>[1.0, 0.0, 0.18172988929010417]</td>\n",
       "      <td>1.181730</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[astro man box set]</td>\n",
       "      <td>[can you see me (pre unre);, purple haze (pre ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>33321</td>\n",
       "      <td>[1.0, 0.0, 0.18172988929010417]</td>\n",
       "      <td>1.181730</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[astro man(alchemy); - studio outtakes 1966-68]</td>\n",
       "      <td>[purple haze 1 (4);, 51st anniversary (5);, la...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>20709</td>\n",
       "      <td>[1.0, 0.0, 0.18172988929010417]</td>\n",
       "      <td>1.181730</td>\n",
       "      <td>[jimi hendrix experience]</td>\n",
       "      <td>[the vpro archive - it must be dusty]</td>\n",
       "      <td>[mockingbird (mpeg1 video data);, spoken word,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>20222</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[best of jimi hendrix]</td>\n",
       "      <td>[blues, blues, free spirit, star spangled bann...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>20896</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[astro man box set]</td>\n",
       "      <td>[i don't live today (live);, purple haze (live...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>23144</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[la forum 26th april 1969]</td>\n",
       "      <td>[voodoo chile (slight reprise);, i dont live t...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>25796</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix experience]</td>\n",
       "      <td>[smash hits]</td>\n",
       "      <td>[foxey lady, red house, the wind cries mary, f...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>28579</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix experience]</td>\n",
       "      <td>[smash hits]</td>\n",
       "      <td>[foxey lady, can you see me, stone free, highw...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>28761</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[riots in berkeley]</td>\n",
       "      <td>[hey baby (new rising sun);, pass it on (unrel...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>8660</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[the jimi hendrix experience]</td>\n",
       "      <td>[1968.10.10-12 the definitive winterlandtwo]]</td>\n",
       "      <td>[are your experienced, tax free, red house, he...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>9197</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[the jimi hendrix experience]</td>\n",
       "      <td>[no more a rolling stone]</td>\n",
       "      <td>[the burning of the midnight lamp, sgt. pepper...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>12202</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[astro man(alchemy); - live in paris jan 29th ...</td>\n",
       "      <td>[purple haze ( 6); (live 1 68);, fire (1 ); (l...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>12719</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[astro man box set]</td>\n",
       "      <td>[foxy lady (live);, little wing (live);, the w...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>14391</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[the jimi hendrix experience]</td>\n",
       "      <td>[no more a rolling stone]</td>\n",
       "      <td>[killin' floor, foxy lady, the wind cries mary...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>14428</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[black devil]</td>\n",
       "      <td>[drivin' south, the wind cries mary, red house...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>15666</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[astro man(alchemy); - live in stockholm secon...</td>\n",
       "      <td>[hey joe (43); (live 1 69);, fire (44); (live ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>452</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[the jimi hendrix experience]</td>\n",
       "      <td>[bbc sessions]</td>\n",
       "      <td>[driving south (alternate take);, wait until t...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>529</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[bbc sessions]</td>\n",
       "      <td>[driving south, hear my train a comin, foxy la...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>677</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[third stone from the sun, remember, fire, can...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>794</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[the wind cries mary, castles made of sand, wi...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>1306</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[star spangled banner (live);, voodoo chile (s...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>1936</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix]</td>\n",
       "      <td>[bold as love, night bird flying, if 6 was 9, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>2023</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix - the best of jimi hendrix]</td>\n",
       "      <td>[bold as love, night bird flying, if 6 was 9, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>3129</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[star spangled banner (live);, wild thing (liv...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>157790</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[the cure]</td>\n",
       "      <td>[b-side of high]</td>\n",
       "      <td>[adonais, it used to be me, a foolish arrangem...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>162149</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[mnic depression, wild thing (live);, star spa...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>162186</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix: the best of jimi hendrix]</td>\n",
       "      <td>[if six was nine, foxey lady, bold as love, ni...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>164258</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[blue wild angel : live at the isle of wight]</td>\n",
       "      <td>[in from the storm, ezy rider, hey baby (new r...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>30933</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the last ever show - love and peace festival ...</td>\n",
       "      <td>[land of the new rising sun, ezy rider, room f...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>35129</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the very best of]</td>\n",
       "      <td>[woodoo chile, red house, stone free, highway ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>35582</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[rescuedisland]</td>\n",
       "      <td>[ezy ryder, my friend, message to love, drifti...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>35734</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[i don't live today, 51st anniversary, stone f...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>35764</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the total experience]</td>\n",
       "      <td>[smashing of the amps, redhouse, groove maker,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>38310</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[wild thing (live);, star spangled banner (liv...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>46232</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix the best of jimi hendrix]</td>\n",
       "      <td>[foxey lady, dolly dagger, bold as love, if 6 ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>136907</td>\n",
       "      <td>[1.0, 0.0, 0.12203402841692462]</td>\n",
       "      <td>1.122034</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[love or confusion, remember, highway chile, m...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>29165</td>\n",
       "      <td>[1.0, 0.0, 0.062338167543745104]</td>\n",
       "      <td>1.062338</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[blues]</td>\n",
       "      <td>[electric church red house, hear my train a co...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>29242</td>\n",
       "      <td>[1.0, 0.0, 0.062338167543745104]</td>\n",
       "      <td>1.062338</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[purple haze]</td>\n",
       "      <td>[sgt. pepper's lonely hearts club band, voodoo...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        id                             values  sum_values  \\\n",
       "0      529  [0.0, 74.0, 0.002642306670565559]   74.002642   \n",
       "1     3248  [0.0, 55.0, 0.002642306670565559]   55.002642   \n",
       "2      452   [0.0, 8.0, 0.002642306670565559]    8.002642   \n",
       "3    20709   [0.0, 5.0, 0.002642306670565559]    5.002642   \n",
       "4     2835   [0.0, 2.0, 0.002642306670565559]    2.002642   \n",
       "5   110321   [0.0, 2.0, 0.002642306670565559]    2.002642   \n",
       "6     7923     [1.0, 0.0, 0.3011216110364633]    1.301122   \n",
       "7    30138    [1.0, 0.0, 0.18172988929010417]    1.181730   \n",
       "8    33321    [1.0, 0.0, 0.18172988929010417]    1.181730   \n",
       "9    20709    [1.0, 0.0, 0.18172988929010417]    1.181730   \n",
       "10   20222    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "11   20896    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "12   23144    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "13   25796    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "14   28579    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "15   28761    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "16    8660    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "17    9197    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "18   12202    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "19   12719    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "20   14391    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "21   14428    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "22   15666    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "23     452    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "24     529    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "25     677    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "26     794    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "27    1306    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "28    1936    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "29    2023    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "30    3129    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "31  157790    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "32  162149    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "33  162186    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "34  164258    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "35   30933    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "36   35129    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "37   35582    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "38   35734    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "39   35764    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "40   38310    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "41   46232    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "42  136907    [1.0, 0.0, 0.12203402841692462]    1.122034   \n",
       "43   29165   [1.0, 0.0, 0.062338167543745104]    1.062338   \n",
       "44   29242   [1.0, 0.0, 0.062338167543745104]    1.062338   \n",
       "\n",
       "                                   artists  \\\n",
       "0                           [jimi hendrix]   \n",
       "1                             [tamba trio]   \n",
       "2            [the jimi hendrix experience]   \n",
       "3                [jimi hendrix experience]   \n",
       "4   [jimi hendrix (w. lonnie youngblood);]   \n",
       "5            [rajyashree josyer shrikanth]   \n",
       "6                        [signature licks]   \n",
       "7                           [jimi hendrix]   \n",
       "8                           [jimi hendrix]   \n",
       "9                [jimi hendrix experience]   \n",
       "10                          [jimi hendrix]   \n",
       "11                          [jimi hendrix]   \n",
       "12                          [jimi hendrix]   \n",
       "13               [jimi hendrix experience]   \n",
       "14               [jimi hendrix experience]   \n",
       "15                          [jimi hendrix]   \n",
       "16           [the jimi hendrix experience]   \n",
       "17           [the jimi hendrix experience]   \n",
       "18                          [jimi hendrix]   \n",
       "19                          [jimi hendrix]   \n",
       "20           [the jimi hendrix experience]   \n",
       "21                          [jimi hendrix]   \n",
       "22                          [jimi hendrix]   \n",
       "23           [the jimi hendrix experience]   \n",
       "24                          [jimi hendrix]   \n",
       "25                          [jimi hendrix]   \n",
       "26                          [jimi hendrix]   \n",
       "27                          [jimi hendrix]   \n",
       "28                          [jimi hendrix]   \n",
       "29                          [jimi hendrix]   \n",
       "30                          [jimi hendrix]   \n",
       "31                              [the cure]   \n",
       "32                          [jimi hendrix]   \n",
       "33                          [jimi hendrix]   \n",
       "34                          [jimi hendrix]   \n",
       "35                          [jimi hendrix]   \n",
       "36                          [jimi hendrix]   \n",
       "37                          [jimi hendrix]   \n",
       "38                          [jimi hendrix]   \n",
       "39                          [jimi hendrix]   \n",
       "40                          [jimi hendrix]   \n",
       "41                          [jimi hendrix]   \n",
       "42                          [jimi hendrix]   \n",
       "43                          [jimi hendrix]   \n",
       "44                          [jimi hendrix]   \n",
       "\n",
       "                                               albums  \\\n",
       "0                                      [bbc sessions]   \n",
       "1                                        [tamba trio]   \n",
       "2                                      [bbc sessions]   \n",
       "3               [the vpro archive - it must be dusty]   \n",
       "4                 [two great experiencesremastered);]   \n",
       "5                                [sangeetha sowrabha]   \n",
       "6                                      [jimi hendrix]   \n",
       "7                                 [astro man box set]   \n",
       "8     [astro man(alchemy); - studio outtakes 1966-68]   \n",
       "9               [the vpro archive - it must be dusty]   \n",
       "10                             [best of jimi hendrix]   \n",
       "11                                [astro man box set]   \n",
       "12                         [la forum 26th april 1969]   \n",
       "13                                       [smash hits]   \n",
       "14                                       [smash hits]   \n",
       "15                                [riots in berkeley]   \n",
       "16      [1968.10.10-12 the definitive winterlandtwo]]   \n",
       "17                          [no more a rolling stone]   \n",
       "18  [astro man(alchemy); - live in paris jan 29th ...   \n",
       "19                                [astro man box set]   \n",
       "20                          [no more a rolling stone]   \n",
       "21                                      [black devil]   \n",
       "22  [astro man(alchemy); - live in stockholm secon...   \n",
       "23                                     [bbc sessions]   \n",
       "24                                     [bbc sessions]   \n",
       "25                              [are you experienced]   \n",
       "26                          [the ultimate experience]   \n",
       "27                          [the ultimate experience]   \n",
       "28                               [experience hendrix]   \n",
       "29    [experience hendrix - the best of jimi hendrix]   \n",
       "30                          [the ultimate experience]   \n",
       "31                                   [b-side of high]   \n",
       "32                          [the ultimate experience]   \n",
       "33     [experience hendrix: the best of jimi hendrix]   \n",
       "34      [blue wild angel : live at the isle of wight]   \n",
       "35  [the last ever show - love and peace festival ...   \n",
       "36                                 [the very best of]   \n",
       "37                                    [rescuedisland]   \n",
       "38                              [are you experienced]   \n",
       "39                             [the total experience]   \n",
       "40                          [the ultimate experience]   \n",
       "41      [experience hendrix the best of jimi hendrix]   \n",
       "42                              [are you experienced]   \n",
       "43                                            [blues]   \n",
       "44                                      [purple haze]   \n",
       "\n",
       "                                                songs  \n",
       "0   [driving south, hear my train a comin, foxy la...  \n",
       "1   [consolacao, batida diferente, imagem, canto d...  \n",
       "2   [driving south (alternate take);, wait until t...  \n",
       "3   [mockingbird (mpeg1 video data);, spoken word,...  \n",
       "4   [she's a fox (1);, groove maker 1 (3);, soul f...  \n",
       "5   [brochevarevarura (khamas, adi, mysore vasudev...  \n",
       "6   [fire (verse);, foxey lady (solo, slow);, fire...  \n",
       "7   [can you see me (pre unre);, purple haze (pre ...  \n",
       "8   [purple haze 1 (4);, 51st anniversary (5);, la...  \n",
       "9   [mockingbird (mpeg1 video data);, spoken word,...  \n",
       "10  [blues, blues, free spirit, star spangled bann...  \n",
       "11  [i don't live today (live);, purple haze (live...  \n",
       "12  [voodoo chile (slight reprise);, i dont live t...  \n",
       "13  [foxey lady, red house, the wind cries mary, f...  \n",
       "14  [foxey lady, can you see me, stone free, highw...  \n",
       "15  [hey baby (new rising sun);, pass it on (unrel...  \n",
       "16  [are your experienced, tax free, red house, he...  \n",
       "17  [the burning of the midnight lamp, sgt. pepper...  \n",
       "18  [purple haze ( 6); (live 1 68);, fire (1 ); (l...  \n",
       "19  [foxy lady (live);, little wing (live);, the w...  \n",
       "20  [killin' floor, foxy lady, the wind cries mary...  \n",
       "21  [drivin' south, the wind cries mary, red house...  \n",
       "22  [hey joe (43); (live 1 69);, fire (44); (live ...  \n",
       "23  [driving south (alternate take);, wait until t...  \n",
       "24  [driving south, hear my train a comin, foxy la...  \n",
       "25  [third stone from the sun, remember, fire, can...  \n",
       "26  [the wind cries mary, castles made of sand, wi...  \n",
       "27  [star spangled banner (live);, voodoo chile (s...  \n",
       "28  [bold as love, night bird flying, if 6 was 9, ...  \n",
       "29  [bold as love, night bird flying, if 6 was 9, ...  \n",
       "30  [star spangled banner (live);, wild thing (liv...  \n",
       "31  [adonais, it used to be me, a foolish arrangem...  \n",
       "32  [mnic depression, wild thing (live);, star spa...  \n",
       "33  [if six was nine, foxey lady, bold as love, ni...  \n",
       "34  [in from the storm, ezy rider, hey baby (new r...  \n",
       "35  [land of the new rising sun, ezy rider, room f...  \n",
       "36  [woodoo chile, red house, stone free, highway ...  \n",
       "37  [ezy ryder, my friend, message to love, drifti...  \n",
       "38  [i don't live today, 51st anniversary, stone f...  \n",
       "39  [smashing of the amps, redhouse, groove maker,...  \n",
       "40  [wild thing (live);, star spangled banner (liv...  \n",
       "41  [foxey lady, dolly dagger, bold as love, if 6 ...  \n",
       "42  [love or confusion, remember, highway chile, m...  \n",
       "43  [electric church red house, hear my train a co...  \n",
       "44  [sgt. pepper's lonely hearts club band, voodoo...  "
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "CALL gds.graph.streamNodeProperties('searchdomain_content', ['score_eig', 'score_deg', 'score_cln'])\n",
    "YIELD nodeId, nodeProperty, propertyValue\n",
    "WITH nodeId, gds.util.asNode(nodeId).id AS id, nodeProperty, propertyValue\n",
    "\n",
    "ORDER BY nodeId, nodeProperty\n",
    "WITH  nodeId, gds.util.asNode(nodeId).id as id, \n",
    "collect(nodeProperty) as properties , collect(propertyValue) as values, sum(propertyValue) as sum_values\n",
    "\n",
    "MATCH (n:CD)\n",
    "WHERE n.id = id\n",
    "MATCH (n)-[:CONTAINS]->(ar:Artist)\n",
    "MATCH (n)-[:CONTAINS]->(ab:Album)\n",
    "MATCH (n)-[:CONTAINS]->(so:Song)\n",
    "RETURN id, \n",
    "values, sum_values, \n",
    "collect(DISTINCT ar.artist) as artists,\n",
    "collect(DISTINCT ab.album) as albums, \n",
    "collect(DISTINCT so.song) as songs\n",
    "ORDER BY sum_values DESC\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data.head(45)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Combined Search Results:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nodeId</th>\n",
       "      <th>count</th>\n",
       "      <th>score_cont</th>\n",
       "      <th>score_pref</th>\n",
       "      <th>artists</th>\n",
       "      <th>albums</th>\n",
       "      <th>songs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>7923</td>\n",
       "      <td>1</td>\n",
       "      <td>0.301122</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>[signature licks]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[fire (verse);, foxey lady (solo, slow);, fire...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>33321</td>\n",
       "      <td>2</td>\n",
       "      <td>0.181730</td>\n",
       "      <td>0.017759</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[astro man(alchemy); - studio outtakes 1966-68]</td>\n",
       "      <td>[purple haze 1 (4);, 51st anniversary (5);, la...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>30138</td>\n",
       "      <td>2</td>\n",
       "      <td>0.181730</td>\n",
       "      <td>0.017759</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[astro man box set]</td>\n",
       "      <td>[can you see me (pre unre);, purple haze (pre ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>20709</td>\n",
       "      <td>1</td>\n",
       "      <td>0.181730</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>[jimi hendrix experience]</td>\n",
       "      <td>[the vpro archive - it must be dusty]</td>\n",
       "      <td>[mockingbird (mpeg1 video data);, spoken word,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2023</td>\n",
       "      <td>2</td>\n",
       "      <td>0.122034</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix - the best of jimi hendrix]</td>\n",
       "      <td>[bold as love, night bird flying, if 6 was 9, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>677</td>\n",
       "      <td>2</td>\n",
       "      <td>0.122034</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[third stone from the sun, remember, fire, can...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>1936</td>\n",
       "      <td>2</td>\n",
       "      <td>0.122034</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix]</td>\n",
       "      <td>[bold as love, night bird flying, if 6 was 9, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>35734</td>\n",
       "      <td>2</td>\n",
       "      <td>0.122034</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[i don't live today, 51st anniversary, stone f...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>30933</td>\n",
       "      <td>2</td>\n",
       "      <td>0.122034</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the last ever show - love and peace festival ...</td>\n",
       "      <td>[land of the new rising sun, ezy rider, room f...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>136907</td>\n",
       "      <td>2</td>\n",
       "      <td>0.122034</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[love or confusion, remember, highway chile, m...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>162186</td>\n",
       "      <td>2</td>\n",
       "      <td>0.122034</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix: the best of jimi hendrix]</td>\n",
       "      <td>[if six was nine, foxey lady, bold as love, ni...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>46232</td>\n",
       "      <td>2</td>\n",
       "      <td>0.122034</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix the best of jimi hendrix]</td>\n",
       "      <td>[foxey lady, dolly dagger, bold as love, if 6 ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>35582</td>\n",
       "      <td>2</td>\n",
       "      <td>0.122034</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[rescuedisland]</td>\n",
       "      <td>[ezy ryder, my friend, message to love, drifti...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>164258</td>\n",
       "      <td>2</td>\n",
       "      <td>0.122034</td>\n",
       "      <td>0.017759</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[blue wild angel : live at the isle of wight]</td>\n",
       "      <td>[in from the storm, ezy rider, hey baby (new r...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>35129</td>\n",
       "      <td>2</td>\n",
       "      <td>0.122034</td>\n",
       "      <td>0.017759</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the very best of]</td>\n",
       "      <td>[woodoo chile, red house, stone free, highway ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>35764</td>\n",
       "      <td>2</td>\n",
       "      <td>0.122034</td>\n",
       "      <td>0.017759</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the total experience]</td>\n",
       "      <td>[smashing of the amps, redhouse, groove maker,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>162149</td>\n",
       "      <td>2</td>\n",
       "      <td>0.122034</td>\n",
       "      <td>0.017759</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[mnic depression, wild thing (live);, star spa...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>1306</td>\n",
       "      <td>2</td>\n",
       "      <td>0.122034</td>\n",
       "      <td>0.017759</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[star spangled banner (live);, voodoo chile (s...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>38310</td>\n",
       "      <td>2</td>\n",
       "      <td>0.122034</td>\n",
       "      <td>0.017759</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[wild thing (live);, star spangled banner (liv...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>529</td>\n",
       "      <td>2</td>\n",
       "      <td>0.122034</td>\n",
       "      <td>0.017759</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[bbc sessions]</td>\n",
       "      <td>[driving south, hear my train a comin, foxy la...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    nodeId  count  score_cont  score_pref                    artists  \\\n",
       "0     7923      1    0.301122    0.000000          [signature licks]   \n",
       "1    33321      2    0.181730    0.017759             [jimi hendrix]   \n",
       "2    30138      2    0.181730    0.017759             [jimi hendrix]   \n",
       "3    20709      1    0.181730    0.000000  [jimi hendrix experience]   \n",
       "4     2023      2    0.122034    0.034758             [jimi hendrix]   \n",
       "5      677      2    0.122034    0.034758             [jimi hendrix]   \n",
       "6     1936      2    0.122034    0.034758             [jimi hendrix]   \n",
       "7    35734      2    0.122034    0.034758             [jimi hendrix]   \n",
       "8    30933      2    0.122034    0.034758             [jimi hendrix]   \n",
       "9   136907      2    0.122034    0.034758             [jimi hendrix]   \n",
       "10  162186      2    0.122034    0.034758             [jimi hendrix]   \n",
       "11   46232      2    0.122034    0.034758             [jimi hendrix]   \n",
       "12   35582      2    0.122034    0.034758             [jimi hendrix]   \n",
       "13  164258      2    0.122034    0.017759             [jimi hendrix]   \n",
       "14   35129      2    0.122034    0.017759             [jimi hendrix]   \n",
       "15   35764      2    0.122034    0.017759             [jimi hendrix]   \n",
       "16  162149      2    0.122034    0.017759             [jimi hendrix]   \n",
       "17    1306      2    0.122034    0.017759             [jimi hendrix]   \n",
       "18   38310      2    0.122034    0.017759             [jimi hendrix]   \n",
       "19     529      2    0.122034    0.017759             [jimi hendrix]   \n",
       "\n",
       "                                               albums  \\\n",
       "0                                      [jimi hendrix]   \n",
       "1     [astro man(alchemy); - studio outtakes 1966-68]   \n",
       "2                                 [astro man box set]   \n",
       "3               [the vpro archive - it must be dusty]   \n",
       "4     [experience hendrix - the best of jimi hendrix]   \n",
       "5                               [are you experienced]   \n",
       "6                                [experience hendrix]   \n",
       "7                               [are you experienced]   \n",
       "8   [the last ever show - love and peace festival ...   \n",
       "9                               [are you experienced]   \n",
       "10     [experience hendrix: the best of jimi hendrix]   \n",
       "11      [experience hendrix the best of jimi hendrix]   \n",
       "12                                    [rescuedisland]   \n",
       "13      [blue wild angel : live at the isle of wight]   \n",
       "14                                 [the very best of]   \n",
       "15                             [the total experience]   \n",
       "16                          [the ultimate experience]   \n",
       "17                          [the ultimate experience]   \n",
       "18                          [the ultimate experience]   \n",
       "19                                     [bbc sessions]   \n",
       "\n",
       "                                                songs  \n",
       "0   [fire (verse);, foxey lady (solo, slow);, fire...  \n",
       "1   [purple haze 1 (4);, 51st anniversary (5);, la...  \n",
       "2   [can you see me (pre unre);, purple haze (pre ...  \n",
       "3   [mockingbird (mpeg1 video data);, spoken word,...  \n",
       "4   [bold as love, night bird flying, if 6 was 9, ...  \n",
       "5   [third stone from the sun, remember, fire, can...  \n",
       "6   [bold as love, night bird flying, if 6 was 9, ...  \n",
       "7   [i don't live today, 51st anniversary, stone f...  \n",
       "8   [land of the new rising sun, ezy rider, room f...  \n",
       "9   [love or confusion, remember, highway chile, m...  \n",
       "10  [if six was nine, foxey lady, bold as love, ni...  \n",
       "11  [foxey lady, dolly dagger, bold as love, if 6 ...  \n",
       "12  [ezy ryder, my friend, message to love, drifti...  \n",
       "13  [in from the storm, ezy rider, hey baby (new r...  \n",
       "14  [woodoo chile, red house, stone free, highway ...  \n",
       "15  [smashing of the amps, redhouse, groove maker,...  \n",
       "16  [mnic depression, wild thing (live);, star spa...  \n",
       "17  [star spangled banner (live);, voodoo chile (s...  \n",
       "18  [wild thing (live);, star spangled banner (liv...  \n",
       "19  [driving south, hear my train a comin, foxy la...  "
      ]
     },
     "execution_count": 72,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "CALL {\n",
    "\n",
    "    CALL {\n",
    "        CALL gds.eigenvector.stream('searchdomain_content')\n",
    "        YIELD nodeId, score\n",
    "        WHERE gds.util.asNode(nodeId):CD\n",
    "        WITH gds.util.asNode(nodeId).id AS nodeId, score as score_cont\n",
    "        RETURN nodeId, score_cont\n",
    "    }\n",
    "    RETURN nodeId, score_cont, 0 as score_pref\n",
    "\n",
    "    UNION \n",
    "\n",
    "    CALL {\n",
    "        CALL gds.eigenvector.stream('searchdomain_preference')\n",
    "        YIELD nodeId, score\n",
    "        WHERE gds.util.asNode(nodeId):CD\n",
    "        WITH gds.util.asNode(nodeId).id AS nodeId, score as score_pref\n",
    "        RETURN nodeId, score_pref\n",
    "    }\n",
    "    RETURN nodeId, 0 as score_cont, score_pref\n",
    "\n",
    "}\n",
    "\n",
    "WITH DISTINCT nodeId, count(*) as count, sum(score_cont) as score_cont, sum(score_pref) as score_pref\n",
    "\n",
    "MATCH (n:CD)\n",
    "WHERE n.id = nodeId\n",
    "OPTIONAL MATCH (n)-[:CONTAINS]->(ar:Artist)\n",
    "OPTIONAL MATCH (n)-[:CONTAINS]->(ab:Album)\n",
    "OPTIONAL MATCH (n)-[:CONTAINS]->(so:Song)\n",
    "\n",
    "RETURN nodeId, \n",
    "count,\n",
    "score_cont, score_pref,\n",
    "collect(DISTINCT ar.artist) as artists,\n",
    "collect(DISTINCT ab.album) as albums, \n",
    "collect(DISTINCT so.song) as songs\n",
    "\n",
    "\n",
    "ORDER BY score_cont DESC, score_pref DESC\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data.head(30)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "***"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Playground:"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "* Fuzzy Search did not result in a good performance.\n",
    "* Combined projection of likes and search input is sensible to number of likes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>labels</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>56133</td>\n",
       "      <td>[Album]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>40461</td>\n",
       "      <td>[Album]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>54581</td>\n",
       "      <td>[Album]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>39836</td>\n",
       "      <td>[Album]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>60552</td>\n",
       "      <td>[Album]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      id   labels\n",
       "0  56133  [Album]\n",
       "1  40461  [Album]\n",
       "2  54581  [Album]\n",
       "3  39836  [Album]\n",
       "4  60552  [Album]"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "# ----------------------------------- Nodes matching User Preference -----------------------------------\n",
    "\n",
    "query_nodes_liked = \"\"\"\n",
    "    CALL {\n",
    "    // Liked Artists, Albums and Songs\n",
    "    MATCH (u:User)-[:LIKES]->(n) \n",
    "    WHERE u.id = 2\n",
    "        AND (n:Song OR n:Album OR n:Artist) \n",
    "    RETURN id(n) AS id, labels(n) AS labels \n",
    "    LIMIT 100000\n",
    "    \n",
    "    UNION\n",
    "    \n",
    "    // CDs linked to liked Artists, Albums and Songs\n",
    "    MATCH (u:User)-[:LIKES]->(x)-[:APPEARED_ON]->(n:CD) \n",
    "    WHERE u.id = 2 \n",
    "    RETURN id(n) AS id, labels(n) AS labels \n",
    "    LIMIT 100000\n",
    "    }\n",
    "    RETURN id, labels\n",
    "\"\"\"\n",
    "\n",
    "\n",
    "# ----------------------------------- Nodes matching Query -----------------------------------\n",
    "\n",
    "query_nodes_match = \"\"\"\n",
    "    \n",
    "    CALL {\n",
    "    // Artists, Albums and Songs which match query\n",
    "    MATCH (n) \n",
    "    WHERE \n",
    "    (n:Song OR n:Album OR n:Artist) \n",
    "    AND \n",
    "    (n.artist =~ \\'.*jimi hendrix.*\\' \n",
    "    OR n.album  =~ '.*Are You Experienced.*' \n",
    "    OR n.song  =~ '.*purple haze.*')\n",
    "    RETURN id(n) AS id, labels(n) AS labels \n",
    "    LIMIT 1000\n",
    "    \n",
    "    UNION\n",
    "    \n",
    "    // CDS linked to Artists, Albums and Songs which match query\n",
    "    MATCH (n)-[:APPEARED_ON]->(c:CD) \n",
    "    WHERE \n",
    "    (n:Song OR n:Album OR n:Artist) \n",
    "    AND \n",
    "    (n.artist =~ '.*jimi hendrix.*' \n",
    "    OR n.album  =~ '.*Are You Experienced.*' \n",
    "    OR n.song  =~ '.*purple haze.*')\n",
    "    RETURN id(c) AS id, labels(c) AS labels \n",
    "    LIMIT 1000\n",
    "    }\n",
    "    RETURN id, labels\n",
    "\"\"\"\n",
    "\n",
    "query_nodes_combined = query_nodes_liked + \"UNION \" + query_nodes_match\n",
    "\n",
    "\n",
    "#print(query)\n",
    "\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query_nodes_combined)])\n",
    "dtf_data.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>source</th>\n",
       "      <th>target</th>\n",
       "      <th>type</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>56133</td>\n",
       "      <td>902129</td>\n",
       "      <td>APPEARED_ON</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>40461</td>\n",
       "      <td>881559</td>\n",
       "      <td>APPEARED_ON</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>54581</td>\n",
       "      <td>899949</td>\n",
       "      <td>APPEARED_ON</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>39836</td>\n",
       "      <td>905396</td>\n",
       "      <td>APPEARED_ON</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>39836</td>\n",
       "      <td>880789</td>\n",
       "      <td>APPEARED_ON</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   source  target         type\n",
       "0   56133  902129  APPEARED_ON\n",
       "1   40461  881559  APPEARED_ON\n",
       "2   54581  899949  APPEARED_ON\n",
       "3   39836  905396  APPEARED_ON\n",
       "4   39836  880789  APPEARED_ON"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "# ----------------------------------- Nodes matching User Preference -----------------------------------\n",
    "\n",
    "query_edges_liked = \"\"\"\n",
    "    CALL {\n",
    "    MATCH (u:User)-[:LIKES]->(n)\n",
    "    WHERE u.id = 2\n",
    "    AND (n:CD OR n:Song OR n:Album OR n:Artist) \n",
    "    MATCH (n)-[r:APPEARED_ON]->(m:CD) \n",
    "    RETURN id(n) AS source, id(m) AS target, type(r) AS type \n",
    "    LIMIT 100000\n",
    "    }\n",
    "    RETURN source, target, type\n",
    "\"\"\"\n",
    "\n",
    "\n",
    "# ----------------------------------- Nodes matching Query -----------------------------------\n",
    "\n",
    "query_edges_match = \"\"\"\n",
    "\n",
    "    CALL {\n",
    "    MATCH (n)-[r:APPEARED_ON]->(c:CD) \n",
    "    WHERE \n",
    "    (n:Song OR n:Album OR n:Artist) \n",
    "    AND \n",
    "    (n.artist =~ '.*jimi hendrix.*' \n",
    "    OR n.album  =~ '.*Are You Experienced.*' \n",
    "    OR n.song  =~ '.*purple haze.*')\n",
    "    RETURN id(n) AS source, id(c) AS target, type(r) AS type \n",
    "    LIMIT 1000\n",
    "    }\n",
    "    RETURN source, target, type\n",
    "    \n",
    "\"\"\"\n",
    "\n",
    "query_edges_combined = query_edges_liked + \" UNION \" + query_edges_match\n",
    "\n",
    "\n",
    "#print(query)\n",
    "\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query_edges_combined)])\n",
    "dtf_data.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "// CREATE NEW COMBINED PROJECTION\n",
      "CALL gds.graph.project.cypher(\n",
      "  \"searchdomain_combined\",\n",
      "    \" \n",
      "    CALL {\n",
      "    // Liked Artists, Albums and Songs\n",
      "    MATCH (u:User)-[:LIKES]->(n) \n",
      "    WHERE u.id = 2\n",
      "        AND (n:Song OR n:Album OR n:Artist) \n",
      "    RETURN id(n) AS id, labels(n) AS labels \n",
      "    LIMIT 100000\n",
      "    \n",
      "    UNION\n",
      "    \n",
      "    // CDs linked to liked Artists, Albums and Songs\n",
      "    MATCH (u:User)-[:LIKES]->(x)-[:APPEARED_ON]->(n:CD) \n",
      "    WHERE u.id = 2 \n",
      "    RETURN id(n) AS id, labels(n) AS labels \n",
      "    LIMIT 100000\n",
      "    }\n",
      "    RETURN id, labels\n",
      " \t UNION \n",
      "    \n",
      "    CALL {\n",
      "    // Artists, Albums and Songs which match query\n",
      "    MATCH (n) \n",
      "    WHERE \n",
      "    (n:Song OR n:Album OR n:Artist) \n",
      "    AND \n",
      "    (n.artist =~ '.*jimi hendrix.*' \n",
      "    OR n.album  =~ '.*Are You Experienced.*' \n",
      "    OR n.song  =~ '.*purple haze.*')\n",
      "    RETURN id(n) AS id, labels(n) AS labels \n",
      "    LIMIT 1000\n",
      "    \n",
      "    UNION\n",
      "    \n",
      "    // CDS linked to Artists, Albums and Songs which match query\n",
      "    MATCH (n)-[:APPEARED_ON]->(c:CD) \n",
      "    WHERE \n",
      "    (n:Song OR n:Album OR n:Artist) \n",
      "    AND \n",
      "    (n.artist =~ '.*jimi hendrix.*' \n",
      "    OR n.album  =~ '.*Are You Experienced.*' \n",
      "    OR n.song  =~ '.*purple haze.*')\n",
      "    RETURN id(c) AS id, labels(c) AS labels \n",
      "    LIMIT 1000\n",
      "    }\n",
      "    RETURN id, labels\n",
      " \", \n",
      "    \" \n",
      "    CALL {\n",
      "    MATCH (u:User)-[:LIKES]->(n)\n",
      "    WHERE u.id = 2\n",
      "    AND (n:CD OR n:Song OR n:Album OR n:Artist) \n",
      "    MATCH (n)-[r:APPEARED_ON]->(m:CD) \n",
      "    RETURN id(n) AS source, id(m) AS target, type(r) AS type \n",
      "    LIMIT 100000\n",
      "    }\n",
      "    RETURN source, target, type\n",
      " UNION \n",
      "\n",
      "    CALL {\n",
      "    MATCH (n)-[r:APPEARED_ON]->(c:CD) \n",
      "    WHERE \n",
      "    (n:Song OR n:Album OR n:Artist) \n",
      "    AND \n",
      "    (n.artist =~ '.*jimi hendrix.*' \n",
      "    OR n.album  =~ '.*Are You Experienced.*' \n",
      "    OR n.song  =~ '.*purple haze.*')\n",
      "    RETURN id(n) AS source, id(c) AS target, type(r) AS type \n",
      "    LIMIT 1000\n",
      "    }\n",
      "    RETURN source, target, type\n",
      "    \n",
      " \"\n",
      ")\n",
      "YIELD\n",
      "  graphName, nodeCount AS nodes, relationshipCount AS rels\n",
      "RETURN graphName, nodes, rels\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>graphName</th>\n",
       "      <th>nodes</th>\n",
       "      <th>rels</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>searchdomain_combined</td>\n",
       "      <td>683</td>\n",
       "      <td>748</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               graphName  nodes  rels\n",
       "0  searchdomain_combined    683   748"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query_projection_combined = f\"\"\"\n",
    "// CREATE NEW COMBINED PROJECTION\n",
    "CALL gds.graph.project.cypher(\n",
    "  \"searchdomain_combined\",\n",
    "    \" {query_nodes_combined} \", \n",
    "    \" {query_edges_combined} \"\n",
    ")\n",
    "YIELD\n",
    "  graphName, nodeCount AS nodes, relationshipCount AS rels\n",
    "RETURN graphName, nodes, rels\n",
    "\"\"\"\n",
    "\n",
    "print(query_projection_combined)\n",
    "\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query_projection_combined)]) \n",
    "dtf_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>minimumScore</th>\n",
       "      <th>meanScore</th>\n",
       "      <th>nodePropertiesWritten</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.001366</td>\n",
       "      <td>0.034714</td>\n",
       "      <td>683</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   minimumScore  meanScore  nodePropertiesWritten\n",
       "0      0.001366   0.034714                    683"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# https://neo4j.com/docs/graph-data-science/current/algorithms/eigenvector-centrality/\n",
    "query = \"\"\"\n",
    "CALL gds.eigenvector.mutate('searchdomain_combined',  {\n",
    "  mutateProperty: 'score_eig'\n",
    "})\n",
    "YIELD centralityDistribution, nodePropertiesWritten, ranIterations\n",
    "RETURN centralityDistribution.min AS minimumScore, centralityDistribution.mean AS meanScore, nodePropertiesWritten\n",
    "\"\"\"\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data.head(30)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>minimumScore</th>\n",
       "      <th>meanScore</th>\n",
       "      <th>nodePropertiesWritten</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.0</td>\n",
       "      <td>1.095171</td>\n",
       "      <td>683</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   minimumScore  meanScore  nodePropertiesWritten\n",
       "0           0.0   1.095171                    683"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# https://neo4j.com/docs/graph-data-science/current/algorithms/degree-centrality/\n",
    "query = \"\"\"\n",
    "CALL gds.degree.mutate('searchdomain_combined',  {\n",
    "  mutateProperty: 'score_deg'\n",
    "})\n",
    "YIELD centralityDistribution, nodePropertiesWritten\n",
    "RETURN centralityDistribution.min AS minimumScore, centralityDistribution.mean AS meanScore, nodePropertiesWritten\n",
    "\"\"\"\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data.head(30)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>values</th>\n",
       "      <th>sum_values</th>\n",
       "      <th>artists</th>\n",
       "      <th>albums</th>\n",
       "      <th>songs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>529</td>\n",
       "      <td>[74.0, 0.0013661113453287755]</td>\n",
       "      <td>74.001366</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[bbc sessions]</td>\n",
       "      <td>[driving south, hear my train a comin, foxy la...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>3248</td>\n",
       "      <td>[53.0, 0.0013661113453287755]</td>\n",
       "      <td>53.001366</td>\n",
       "      <td>[tamba trio]</td>\n",
       "      <td>[tamba trio]</td>\n",
       "      <td>[consolacao, batida diferente, imagem, canto d...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>35253</td>\n",
       "      <td>[46.0, 0.0013661113453287755]</td>\n",
       "      <td>46.001366</td>\n",
       "      <td>[erik satie]</td>\n",
       "      <td>[satie: 3 gymnopedies &amp; other piano works]</td>\n",
       "      <td>[sonatine bureaucratique, vieux sequins et vie...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>452</td>\n",
       "      <td>[8.0, 0.0013661113453287755]</td>\n",
       "      <td>8.001366</td>\n",
       "      <td>[the jimi hendrix experience]</td>\n",
       "      <td>[bbc sessions]</td>\n",
       "      <td>[driving south (alternate take);, wait until t...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>20709</td>\n",
       "      <td>[5.0, 0.0013661113453287755]</td>\n",
       "      <td>5.001366</td>\n",
       "      <td>[jimi hendrix experience]</td>\n",
       "      <td>[the vpro archive - it must be dusty]</td>\n",
       "      <td>[mockingbird (mpeg1 video data);, spoken word,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>2835</td>\n",
       "      <td>[2.0, 0.0013661113453287755]</td>\n",
       "      <td>2.001366</td>\n",
       "      <td>[jimi hendrix (w. lonnie youngblood);]</td>\n",
       "      <td>[two great experiencesremastered);]</td>\n",
       "      <td>[she's a fox (1);, groove maker 1 (3);, soul f...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>40920</td>\n",
       "      <td>[2.0, 0.0013661113453287755]</td>\n",
       "      <td>2.001366</td>\n",
       "      <td>[lorenzo perosi]</td>\n",
       "      <td>[il natale del redentore]</td>\n",
       "      <td>[il natale, l'annunciazione]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>119951</td>\n",
       "      <td>[2.0, 0.0013661113453287755]</td>\n",
       "      <td>2.001366</td>\n",
       "      <td>[stamic quartet]</td>\n",
       "      <td>[janáèek - mozart - schubert]</td>\n",
       "      <td>[erato. adagio. allegro, ante. con moto. alleg...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>110321</td>\n",
       "      <td>[2.0, 0.0013661113453287755]</td>\n",
       "      <td>2.001366</td>\n",
       "      <td>[rajyashree josyer shrikanth]</td>\n",
       "      <td>[sangeetha sowrabha]</td>\n",
       "      <td>[brochevarevarura (khamas, adi, mysore vasudev...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>50271</td>\n",
       "      <td>[1.0, 0.0013661113453287755]</td>\n",
       "      <td>1.001366</td>\n",
       "      <td>[ludwig van beethoven]</td>\n",
       "      <td>[symphony no.9 choral]</td>\n",
       "      <td>[adagio molto e cantabile, allegro ma non trop...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>125757</td>\n",
       "      <td>[1.0, 0.0013661113453287755]</td>\n",
       "      <td>1.001366</td>\n",
       "      <td>[bach j.s - mozart w.a. - rachmaninov s.]</td>\n",
       "      <td>[works for three pianos and piano six-hands]</td>\n",
       "      <td>[bwv 1 63 conc 3 pianos 3 allegro, bwv 1 63 co...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>131914</td>\n",
       "      <td>[1.0, 0.0013661113453287755]</td>\n",
       "      <td>1.001366</td>\n",
       "      <td>[lorenzo perosi]</td>\n",
       "      <td>[transitus animae &amp; messa da requiem]</td>\n",
       "      <td>[tratto, transitus animae, libera me, domine, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>8890</td>\n",
       "      <td>[1.0, 0.0013661113453287755]</td>\n",
       "      <td>1.001366</td>\n",
       "      <td>[curtis knight with jimi hendrix]</td>\n",
       "      <td>[get that feeling]</td>\n",
       "      <td>[welcome home, gotta have a new dress, how wou...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>137615</td>\n",
       "      <td>[1.0, 0.0013661113453287755]</td>\n",
       "      <td>1.001366</td>\n",
       "      <td>[haydn, joseph]</td>\n",
       "      <td>[die schopfung - wpo, karajan]</td>\n",
       "      <td>[im anfange scuf gott himmel und erde, in voll...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>7923</td>\n",
       "      <td>[0.0, 0.1536176908093337]</td>\n",
       "      <td>0.153618</td>\n",
       "      <td>[signature licks]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[fire (verse);, foxey lady (solo, slow);, fire...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>50271</td>\n",
       "      <td>[0.0, 0.1536176908093337]</td>\n",
       "      <td>0.153618</td>\n",
       "      <td>[ludwig van beethoven]</td>\n",
       "      <td>[symphony no.9 choral]</td>\n",
       "      <td>[adagio molto e cantabile, allegro ma non trop...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>125757</td>\n",
       "      <td>[0.0, 0.12316737491653273]</td>\n",
       "      <td>0.123167</td>\n",
       "      <td>[bach j.s - mozart w.a. - rachmaninov s.]</td>\n",
       "      <td>[works for three pianos and piano six-hands]</td>\n",
       "      <td>[bwv 1 63 conc 3 pianos 3 allegro, bwv 1 63 co...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>43464</td>\n",
       "      <td>[0.0, 0.09271705902373173]</td>\n",
       "      <td>0.092717</td>\n",
       "      <td>[ludwig van beethoven]</td>\n",
       "      <td>[symphony no.9 in d- minor op.125]</td>\n",
       "      <td>[allegro ma non troppo un poco maestoso, molto...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>45251</td>\n",
       "      <td>[0.0, 0.09271705902373173]</td>\n",
       "      <td>0.092717</td>\n",
       "      <td>[ludwig van beethoven]</td>\n",
       "      <td>[symphony no. 9 in d minor, op. 125]</td>\n",
       "      <td>[allegro ma non troppo, un poco maestoso, adag...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>54951</td>\n",
       "      <td>[0.0, 0.09271705902373173]</td>\n",
       "      <td>0.092717</td>\n",
       "      <td>[ludwig van beethoven]</td>\n",
       "      <td>[symphony no. 9 in d minor, op. 125]</td>\n",
       "      <td>[allegro ma non troppo, un poco maestoso, adag...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>110015</td>\n",
       "      <td>[0.0, 0.09271705902373173]</td>\n",
       "      <td>0.092717</td>\n",
       "      <td>[ludwig van beethoven]</td>\n",
       "      <td>[symphonie nr.9 d-moll op. 125]</td>\n",
       "      <td>[allegro ma non troppo, un poco maestoso, adag...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>47774</td>\n",
       "      <td>[0.0, 0.09271705902373173]</td>\n",
       "      <td>0.092717</td>\n",
       "      <td>[ludwig van beethoven]</td>\n",
       "      <td>[sinfonie nr. 9]</td>\n",
       "      <td>[allegro ma non troppo, un poco maestoso, adag...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>48128</td>\n",
       "      <td>[0.0, 0.09271705902373173]</td>\n",
       "      <td>0.092717</td>\n",
       "      <td>[ludwig van beethoven]</td>\n",
       "      <td>[symphony no.9 in d minor op. 125]</td>\n",
       "      <td>[allegro ma non troppo, adagio molto e cantabi...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>48130</td>\n",
       "      <td>[0.0, 0.09271705902373173]</td>\n",
       "      <td>0.092717</td>\n",
       "      <td>[ludwig van beethoven]</td>\n",
       "      <td>[symphony no. 9]</td>\n",
       "      <td>[adagio molto e cantabile, allegro ma non trop...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>48320</td>\n",
       "      <td>[0.0, 0.09271705902373173]</td>\n",
       "      <td>0.092717</td>\n",
       "      <td>[ludwig van beethoven]</td>\n",
       "      <td>[symphony no.9 in d minor, op.125 'ode an die ...</td>\n",
       "      <td>[allegro ma non troppo, un poco maestoso, adag...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>48321</td>\n",
       "      <td>[0.0, 0.09271705902373173]</td>\n",
       "      <td>0.092717</td>\n",
       "      <td>[ludwig van beethoven]</td>\n",
       "      <td>[symphonie n 9 op. 125 avec choeur en ré mineur]</td>\n",
       "      <td>[allegro ma non troppo, adagio molto e cantabi...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>49478</td>\n",
       "      <td>[0.0, 0.09271705902373173]</td>\n",
       "      <td>0.092717</td>\n",
       "      <td>[ludwig van beethoven]</td>\n",
       "      <td>[symphonie no. 9 op. 125]</td>\n",
       "      <td>[allegro ma non troppo, un poco maestoso, adag...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>50278</td>\n",
       "      <td>[0.0, 0.09271705902373173]</td>\n",
       "      <td>0.092717</td>\n",
       "      <td>[ludwig van beethoven]</td>\n",
       "      <td>[symphony no. 9]</td>\n",
       "      <td>[allegro ma non troppo, un poco maestoso, adag...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>50479</td>\n",
       "      <td>[0.0, 0.09271705902373173]</td>\n",
       "      <td>0.092717</td>\n",
       "      <td>[ludwig van beethoven]</td>\n",
       "      <td>[symphony no. 9]</td>\n",
       "      <td>[allegro ma non troppo, un poco maestoso, adag...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>30138</td>\n",
       "      <td>[0.0, 0.09271705902373173]</td>\n",
       "      <td>0.092717</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[astro man box set]</td>\n",
       "      <td>[can you see me (pre unre);, purple haze (pre ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>33321</td>\n",
       "      <td>[0.0, 0.09271705902373173]</td>\n",
       "      <td>0.092717</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[astro man(alchemy); - studio outtakes 1966-68]</td>\n",
       "      <td>[purple haze 1 (4);, 51st anniversary (5);, la...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>51796</td>\n",
       "      <td>[0.0, 0.09271705902373173]</td>\n",
       "      <td>0.092717</td>\n",
       "      <td>[ludwig van beethoven]</td>\n",
       "      <td>[symphony no. 9 in d minor op. 125 (david zinm...</td>\n",
       "      <td>[allegro ma non troppo, adagio molto e cantabi...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>51767</td>\n",
       "      <td>[0.0, 0.06226674313093075]</td>\n",
       "      <td>0.062267</td>\n",
       "      <td>[beethoven, ludwig van (h. v. karajan);]</td>\n",
       "      <td>[symphony nr.9 d-moll op. 125 - herbert von ka...</td>\n",
       "      <td>[allegro ma non troppo, un poco maestoso, adag...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>51773</td>\n",
       "      <td>[0.0, 0.06226674313093075]</td>\n",
       "      <td>0.062267</td>\n",
       "      <td>[beethoven]</td>\n",
       "      <td>[symphony no. 9]</td>\n",
       "      <td>[allegro ma non troppo, un poco maestoso, adag...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>53377</td>\n",
       "      <td>[0.0, 0.06226674313093075]</td>\n",
       "      <td>0.062267</td>\n",
       "      <td>[berliner philharmoniker, herbert von karajan]</td>\n",
       "      <td>[ludwig van beethoven, symphonie nr.9 d-moll o...</td>\n",
       "      <td>[o freunde, nicht diese töne, allegro ma non t...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>54292</td>\n",
       "      <td>[0.0, 0.06226674313093075]</td>\n",
       "      <td>0.062267</td>\n",
       "      <td>[abbado and berlin philharmonic]</td>\n",
       "      <td>[beethoven: symphony no. 9]</td>\n",
       "      <td>[creatures of prometheusfinale, adagio molto e...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>452</td>\n",
       "      <td>[0.0, 0.06226674313093075]</td>\n",
       "      <td>0.062267</td>\n",
       "      <td>[the jimi hendrix experience]</td>\n",
       "      <td>[bbc sessions]</td>\n",
       "      <td>[driving south (alternate take);, wait until t...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>529</td>\n",
       "      <td>[0.0, 0.06226674313093075]</td>\n",
       "      <td>0.062267</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[bbc sessions]</td>\n",
       "      <td>[driving south, hear my train a comin, foxy la...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>677</td>\n",
       "      <td>[0.0, 0.06226674313093075]</td>\n",
       "      <td>0.062267</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[third stone from the sun, remember, fire, can...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>794</td>\n",
       "      <td>[0.0, 0.06226674313093075]</td>\n",
       "      <td>0.062267</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[the wind cries mary, castles made of sand, wi...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>1306</td>\n",
       "      <td>[0.0, 0.06226674313093075]</td>\n",
       "      <td>0.062267</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[star spangled banner (live);, voodoo chile (s...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>1936</td>\n",
       "      <td>[0.0, 0.06226674313093075]</td>\n",
       "      <td>0.062267</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix]</td>\n",
       "      <td>[bold as love, night bird flying, if 6 was 9, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>2023</td>\n",
       "      <td>[0.0, 0.06226674313093075]</td>\n",
       "      <td>0.062267</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix - the best of jimi hendrix]</td>\n",
       "      <td>[bold as love, night bird flying, if 6 was 9, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>3129</td>\n",
       "      <td>[0.0, 0.06226674313093075]</td>\n",
       "      <td>0.062267</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[star spangled banner (live);, wild thing (liv...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>45009</td>\n",
       "      <td>[0.0, 0.06226674313093075]</td>\n",
       "      <td>0.062267</td>\n",
       "      <td>[ludvig van beethoven]</td>\n",
       "      <td>[symphony no 9 d flat op125]</td>\n",
       "      <td>[adagio molto e cantabile, allegro ma non trop...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        id                         values  sum_values  \\\n",
       "0      529  [74.0, 0.0013661113453287755]   74.001366   \n",
       "1     3248  [53.0, 0.0013661113453287755]   53.001366   \n",
       "2    35253  [46.0, 0.0013661113453287755]   46.001366   \n",
       "3      452   [8.0, 0.0013661113453287755]    8.001366   \n",
       "4    20709   [5.0, 0.0013661113453287755]    5.001366   \n",
       "5     2835   [2.0, 0.0013661113453287755]    2.001366   \n",
       "6    40920   [2.0, 0.0013661113453287755]    2.001366   \n",
       "7   119951   [2.0, 0.0013661113453287755]    2.001366   \n",
       "8   110321   [2.0, 0.0013661113453287755]    2.001366   \n",
       "9    50271   [1.0, 0.0013661113453287755]    1.001366   \n",
       "10  125757   [1.0, 0.0013661113453287755]    1.001366   \n",
       "11  131914   [1.0, 0.0013661113453287755]    1.001366   \n",
       "12    8890   [1.0, 0.0013661113453287755]    1.001366   \n",
       "13  137615   [1.0, 0.0013661113453287755]    1.001366   \n",
       "14    7923      [0.0, 0.1536176908093337]    0.153618   \n",
       "15   50271      [0.0, 0.1536176908093337]    0.153618   \n",
       "16  125757     [0.0, 0.12316737491653273]    0.123167   \n",
       "17   43464     [0.0, 0.09271705902373173]    0.092717   \n",
       "18   45251     [0.0, 0.09271705902373173]    0.092717   \n",
       "19   54951     [0.0, 0.09271705902373173]    0.092717   \n",
       "20  110015     [0.0, 0.09271705902373173]    0.092717   \n",
       "21   47774     [0.0, 0.09271705902373173]    0.092717   \n",
       "22   48128     [0.0, 0.09271705902373173]    0.092717   \n",
       "23   48130     [0.0, 0.09271705902373173]    0.092717   \n",
       "24   48320     [0.0, 0.09271705902373173]    0.092717   \n",
       "25   48321     [0.0, 0.09271705902373173]    0.092717   \n",
       "26   49478     [0.0, 0.09271705902373173]    0.092717   \n",
       "27   50278     [0.0, 0.09271705902373173]    0.092717   \n",
       "28   50479     [0.0, 0.09271705902373173]    0.092717   \n",
       "29   30138     [0.0, 0.09271705902373173]    0.092717   \n",
       "30   33321     [0.0, 0.09271705902373173]    0.092717   \n",
       "31   51796     [0.0, 0.09271705902373173]    0.092717   \n",
       "32   51767     [0.0, 0.06226674313093075]    0.062267   \n",
       "33   51773     [0.0, 0.06226674313093075]    0.062267   \n",
       "34   53377     [0.0, 0.06226674313093075]    0.062267   \n",
       "35   54292     [0.0, 0.06226674313093075]    0.062267   \n",
       "36     452     [0.0, 0.06226674313093075]    0.062267   \n",
       "37     529     [0.0, 0.06226674313093075]    0.062267   \n",
       "38     677     [0.0, 0.06226674313093075]    0.062267   \n",
       "39     794     [0.0, 0.06226674313093075]    0.062267   \n",
       "40    1306     [0.0, 0.06226674313093075]    0.062267   \n",
       "41    1936     [0.0, 0.06226674313093075]    0.062267   \n",
       "42    2023     [0.0, 0.06226674313093075]    0.062267   \n",
       "43    3129     [0.0, 0.06226674313093075]    0.062267   \n",
       "44   45009     [0.0, 0.06226674313093075]    0.062267   \n",
       "\n",
       "                                           artists  \\\n",
       "0                                   [jimi hendrix]   \n",
       "1                                     [tamba trio]   \n",
       "2                                     [erik satie]   \n",
       "3                    [the jimi hendrix experience]   \n",
       "4                        [jimi hendrix experience]   \n",
       "5           [jimi hendrix (w. lonnie youngblood);]   \n",
       "6                                 [lorenzo perosi]   \n",
       "7                                 [stamic quartet]   \n",
       "8                    [rajyashree josyer shrikanth]   \n",
       "9                           [ludwig van beethoven]   \n",
       "10       [bach j.s - mozart w.a. - rachmaninov s.]   \n",
       "11                                [lorenzo perosi]   \n",
       "12               [curtis knight with jimi hendrix]   \n",
       "13                                 [haydn, joseph]   \n",
       "14                               [signature licks]   \n",
       "15                          [ludwig van beethoven]   \n",
       "16       [bach j.s - mozart w.a. - rachmaninov s.]   \n",
       "17                          [ludwig van beethoven]   \n",
       "18                          [ludwig van beethoven]   \n",
       "19                          [ludwig van beethoven]   \n",
       "20                          [ludwig van beethoven]   \n",
       "21                          [ludwig van beethoven]   \n",
       "22                          [ludwig van beethoven]   \n",
       "23                          [ludwig van beethoven]   \n",
       "24                          [ludwig van beethoven]   \n",
       "25                          [ludwig van beethoven]   \n",
       "26                          [ludwig van beethoven]   \n",
       "27                          [ludwig van beethoven]   \n",
       "28                          [ludwig van beethoven]   \n",
       "29                                  [jimi hendrix]   \n",
       "30                                  [jimi hendrix]   \n",
       "31                          [ludwig van beethoven]   \n",
       "32        [beethoven, ludwig van (h. v. karajan);]   \n",
       "33                                     [beethoven]   \n",
       "34  [berliner philharmoniker, herbert von karajan]   \n",
       "35                [abbado and berlin philharmonic]   \n",
       "36                   [the jimi hendrix experience]   \n",
       "37                                  [jimi hendrix]   \n",
       "38                                  [jimi hendrix]   \n",
       "39                                  [jimi hendrix]   \n",
       "40                                  [jimi hendrix]   \n",
       "41                                  [jimi hendrix]   \n",
       "42                                  [jimi hendrix]   \n",
       "43                                  [jimi hendrix]   \n",
       "44                          [ludvig van beethoven]   \n",
       "\n",
       "                                               albums  \\\n",
       "0                                      [bbc sessions]   \n",
       "1                                        [tamba trio]   \n",
       "2          [satie: 3 gymnopedies & other piano works]   \n",
       "3                                      [bbc sessions]   \n",
       "4               [the vpro archive - it must be dusty]   \n",
       "5                 [two great experiencesremastered);]   \n",
       "6                           [il natale del redentore]   \n",
       "7                       [janáèek - mozart - schubert]   \n",
       "8                                [sangeetha sowrabha]   \n",
       "9                              [symphony no.9 choral]   \n",
       "10       [works for three pianos and piano six-hands]   \n",
       "11              [transitus animae & messa da requiem]   \n",
       "12                                 [get that feeling]   \n",
       "13                     [die schopfung - wpo, karajan]   \n",
       "14                                     [jimi hendrix]   \n",
       "15                             [symphony no.9 choral]   \n",
       "16       [works for three pianos and piano six-hands]   \n",
       "17                 [symphony no.9 in d- minor op.125]   \n",
       "18               [symphony no. 9 in d minor, op. 125]   \n",
       "19               [symphony no. 9 in d minor, op. 125]   \n",
       "20                    [symphonie nr.9 d-moll op. 125]   \n",
       "21                                   [sinfonie nr. 9]   \n",
       "22                 [symphony no.9 in d minor op. 125]   \n",
       "23                                   [symphony no. 9]   \n",
       "24  [symphony no.9 in d minor, op.125 'ode an die ...   \n",
       "25   [symphonie n 9 op. 125 avec choeur en ré mineur]   \n",
       "26                          [symphonie no. 9 op. 125]   \n",
       "27                                   [symphony no. 9]   \n",
       "28                                   [symphony no. 9]   \n",
       "29                                [astro man box set]   \n",
       "30    [astro man(alchemy); - studio outtakes 1966-68]   \n",
       "31  [symphony no. 9 in d minor op. 125 (david zinm...   \n",
       "32  [symphony nr.9 d-moll op. 125 - herbert von ka...   \n",
       "33                                   [symphony no. 9]   \n",
       "34  [ludwig van beethoven, symphonie nr.9 d-moll o...   \n",
       "35                        [beethoven: symphony no. 9]   \n",
       "36                                     [bbc sessions]   \n",
       "37                                     [bbc sessions]   \n",
       "38                              [are you experienced]   \n",
       "39                          [the ultimate experience]   \n",
       "40                          [the ultimate experience]   \n",
       "41                               [experience hendrix]   \n",
       "42    [experience hendrix - the best of jimi hendrix]   \n",
       "43                          [the ultimate experience]   \n",
       "44                       [symphony no 9 d flat op125]   \n",
       "\n",
       "                                                songs  \n",
       "0   [driving south, hear my train a comin, foxy la...  \n",
       "1   [consolacao, batida diferente, imagem, canto d...  \n",
       "2   [sonatine bureaucratique, vieux sequins et vie...  \n",
       "3   [driving south (alternate take);, wait until t...  \n",
       "4   [mockingbird (mpeg1 video data);, spoken word,...  \n",
       "5   [she's a fox (1);, groove maker 1 (3);, soul f...  \n",
       "6                        [il natale, l'annunciazione]  \n",
       "7   [erato. adagio. allegro, ante. con moto. alleg...  \n",
       "8   [brochevarevarura (khamas, adi, mysore vasudev...  \n",
       "9   [adagio molto e cantabile, allegro ma non trop...  \n",
       "10  [bwv 1 63 conc 3 pianos 3 allegro, bwv 1 63 co...  \n",
       "11  [tratto, transitus animae, libera me, domine, ...  \n",
       "12  [welcome home, gotta have a new dress, how wou...  \n",
       "13  [im anfange scuf gott himmel und erde, in voll...  \n",
       "14  [fire (verse);, foxey lady (solo, slow);, fire...  \n",
       "15  [adagio molto e cantabile, allegro ma non trop...  \n",
       "16  [bwv 1 63 conc 3 pianos 3 allegro, bwv 1 63 co...  \n",
       "17  [allegro ma non troppo un poco maestoso, molto...  \n",
       "18  [allegro ma non troppo, un poco maestoso, adag...  \n",
       "19  [allegro ma non troppo, un poco maestoso, adag...  \n",
       "20  [allegro ma non troppo, un poco maestoso, adag...  \n",
       "21  [allegro ma non troppo, un poco maestoso, adag...  \n",
       "22  [allegro ma non troppo, adagio molto e cantabi...  \n",
       "23  [adagio molto e cantabile, allegro ma non trop...  \n",
       "24  [allegro ma non troppo, un poco maestoso, adag...  \n",
       "25  [allegro ma non troppo, adagio molto e cantabi...  \n",
       "26  [allegro ma non troppo, un poco maestoso, adag...  \n",
       "27  [allegro ma non troppo, un poco maestoso, adag...  \n",
       "28  [allegro ma non troppo, un poco maestoso, adag...  \n",
       "29  [can you see me (pre unre);, purple haze (pre ...  \n",
       "30  [purple haze 1 (4);, 51st anniversary (5);, la...  \n",
       "31  [allegro ma non troppo, adagio molto e cantabi...  \n",
       "32  [allegro ma non troppo, un poco maestoso, adag...  \n",
       "33  [allegro ma non troppo, un poco maestoso, adag...  \n",
       "34  [o freunde, nicht diese töne, allegro ma non t...  \n",
       "35  [creatures of prometheusfinale, adagio molto e...  \n",
       "36  [driving south (alternate take);, wait until t...  \n",
       "37  [driving south, hear my train a comin, foxy la...  \n",
       "38  [third stone from the sun, remember, fire, can...  \n",
       "39  [the wind cries mary, castles made of sand, wi...  \n",
       "40  [star spangled banner (live);, voodoo chile (s...  \n",
       "41  [bold as love, night bird flying, if 6 was 9, ...  \n",
       "42  [bold as love, night bird flying, if 6 was 9, ...  \n",
       "43  [star spangled banner (live);, wild thing (liv...  \n",
       "44  [adagio molto e cantabile, allegro ma non trop...  "
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "CALL gds.graph.streamNodeProperties('searchdomain_combined', ['score_eig', \"score_deg\"])\n",
    "YIELD nodeId, nodeProperty, propertyValue\n",
    "WITH nodeId, gds.util.asNode(nodeId).id AS id, nodeProperty, propertyValue\n",
    "\n",
    "ORDER BY nodeId, nodeProperty\n",
    "WITH  nodeId, gds.util.asNode(nodeId).id as id, \n",
    "collect(nodeProperty) as properties , collect(propertyValue) as values, sum(propertyValue) as sum_values\n",
    "\n",
    "MATCH (n:CD)\n",
    "WHERE n.id = id\n",
    "MATCH (n)-[:CONTAINS]->(ar:Artist)\n",
    "MATCH (n)-[:CONTAINS]->(ab:Album)\n",
    "MATCH (n)-[:CONTAINS]->(so:Song)\n",
    "RETURN id, \n",
    "values, sum_values, \n",
    "collect(DISTINCT ar.artist) as artists,\n",
    "collect(DISTINCT ab.album) as albums, \n",
    "collect(DISTINCT so.song) as songs\n",
    "ORDER BY sum_values DESC\n",
    "LIMIT 100\n",
    "\"\"\"\n",
    "\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data.head(45)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
