{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "tags": []
   },
   "source": [
    "# GDMA Project\n",
    "Author: Julian Schelb (1069967)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import matplotlib.pyplot as plt\n",
    "import numpy as np\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Connection to the database instance"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"subatomic-shrank-Respond\"))\n",
    "database_name = \"cddb\"\n",
    "session = driver.session(database = database_name)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "tags": []
   },
   "source": [
    "### Task 4: Searching and Ranking\n",
    "\n",
    "Implement a simple search engine that enables search by artist, album and\n",
    "song name/title. The results must be ranked based on importance. It is up to\n",
    "you to come up with how the importance of each result is computed and you\n",
    "must justify your decision (it goes without saying that you need to come up\n",
    "with a meaningful definition). However, the importance should ideally take into\n",
    "account user preferences/likes. As such, this task is split in two parts:\n",
    "\n",
    "**1. Write a Cypher query that adds a relationship :LIKES between a node with**\n",
    "\n",
    "label :User and an artist, album, or song. Every user should be identified\n",
    "just by a numerical userID (no more information is necessary). If a user\n",
    "already exists in the system, no additional node should be added. After\n",
    "coming up with the necessary Cypher query, add a significant number of\n",
    "users and likes.\n",
    "\n",
    "**2. Implement a simple Python function that has the following arguments:**\n",
    "\n",
    "- the userID of the user submitting the search (the user ID may not\n",
    "exist in the database),\n",
    "- a string that contains one or more keywords for the search, and\n",
    "- an optional argument that indicates whether the search is on all or\n",
    "a specific field, i.e., artist, album, song.\n",
    "The search must return exactly 10 results.\n",
    "\n",
    "Python must only be used to call the database. You should not write any\n",
    "code in Python that implements functionality necessary for the task. However,\n",
    "submitting multiple queries in the same function call is allowed. Also, for this\n",
    "task of the project, you are not only allowed but also encouraged to use functions\n",
    "from the GDS library of Neo4j. Hence, before making any decisions, have a\n",
    "careful look at the available functions. Again, you have to justify the use of any\n",
    "function that you employ"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Adding Example Users"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Function to create Example User:**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [],
   "source": [
    "def createExampleUser(user_id = 1, genre = \"rock\", limit = 50):\n",
    "    \n",
    "    ####### DELETE USER NODE #######\n",
    "    query1 = \"\"\"\n",
    "    MATCH (u:User)\n",
    "    WHERE u.id = $user_id\n",
    "    DETACH DELETE u\n",
    "    \"\"\"\n",
    "    \n",
    "    ####### CREATE USER NODE #######\n",
    "    query2 = \"\"\"\n",
    "    MERGE (u:User {id:  $user_id})\n",
    "    RETURN u.id as user_id\n",
    "    \"\"\"\n",
    "    \n",
    "    ####### LINK TO LIKED SONGS #######\n",
    "    query3 = \"\"\"\n",
    "    MATCH (g:Genre)<-[r:BELONGS_TO]-(c:CD)\n",
    "    MATCH (c)-[r2:CONTAINS]->(s:Song)\n",
    "    WHERE g.genre = $genre\n",
    "    WITH s \n",
    "    LIMIT $limit\n",
    "    MATCH (u:User)\n",
    "    WHERE u.id = $user_id\n",
    "    MERGE (u)-[r3:LIKES]->(s)\n",
    "    \"\"\"\n",
    "    \n",
    "    ####### LINK TO LIKED ARTISTS #######\n",
    "    query4 = \"\"\"\n",
    "    MATCH (g:Genre)<-[r:BELONGS_TO]-(c:CD)\n",
    "    MATCH (c)-[r2:CONTAINS]->(t:Artist)\n",
    "    WHERE g.genre = $genre\n",
    "    WITH t \n",
    "    LIMIT $limit\n",
    "    MATCH (u:User)\n",
    "    WHERE u.id = $user_id\n",
    "    MERGE (u)-[r3:LIKES]->(t)\n",
    "    \"\"\"\n",
    "    \n",
    "    ####### LINK TO LIKED ALBUMS #######\n",
    "    query5 = \"\"\"\n",
    "    MATCH (g:Genre)<-[r:BELONGS_TO]-(c:CD)\n",
    "    MATCH (c)-[r2:CONTAINS]->(t:Album)\n",
    "    WHERE g.genre = $genre\n",
    "    WITH t \n",
    "    LIMIT $limit\n",
    "    MATCH (u:User)\n",
    "    WHERE u.id = $user_id\n",
    "    MERGE (u)-[r3:LIKES]->(t)\n",
    "    \"\"\"\n",
    "\n",
    "    with driver.session(database = database_name) as session:\n",
    "        session.run(query1, user_id = user_id)\n",
    "        session.run(query2, user_id = user_id)\n",
    "        session.run(query3, user_id = user_id, genre = genre, limit = limit)\n",
    "        session.run(query4, user_id = user_id, genre = genre, limit = limit)\n",
    "        session.run(query5, user_id = user_id, genre = genre, limit = limit)\n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Adding some Likes to model User Preference:**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [],
   "source": [
    "# User 1 likes \"Rock\" music\n",
    "createExampleUser(user_id = 1, genre = \"rock\", limit = 50)\n",
    "# User 2 likes \"classic\" music\n",
    "# createExampleUser(user_id = 2, genre = \"classic\", limit = 5)\n",
    "# User 3 likes \"pop\" music\n",
    "# createExampleUser(user_id = 3, genre = \"pop\", limit = 50)\n",
    "# User 4 likes \"hip-hop\" music\n",
    "# createExampleUser(user_id = 4, genre = \"hip-hop\", limit = 50)\n",
    "# User 5 likes \"hip-hop\" music\n",
    "# createExampleUser(user_id = 5, genre = \"hard rock\", limit = 50)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "***"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Implementing Search Engine"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 95,
   "metadata": {},
   "outputs": [],
   "source": [
    "user_id = 1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "tags": []
   },
   "source": [
    "##### Feature 1: User Preference"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>graphName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>searchdomain_preference</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 graphName\n",
       "0  searchdomain_preference"
      ]
     },
     "execution_count": 96,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "// DELETE EXISTING PROJECTION\n",
    "CALL gds.graph.drop('searchdomain_preference', false) \n",
    "YIELD graphName \n",
    "RETURN graphName\n",
    "\"\"\"\n",
    "\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>graphName</th>\n",
       "      <th>nodes</th>\n",
       "      <th>rels</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>searchdomain_preference</td>\n",
       "      <td>2071</td>\n",
       "      <td>2108</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 graphName  nodes  rels\n",
       "0  searchdomain_preference   2071  2108"
      ]
     },
     "execution_count": 97,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = f\"\"\"\n",
    "// CREATE NEW PROJECTION WITH SEARCH RELEVANT SUB GRAPH\n",
    "CALL gds.graph.project.cypher(\n",
    "  'searchdomain_preference',\n",
    "  ' // Liked Artists, Albums and Songs\n",
    "    MATCH (u:User)-[:LIKES]->(n) \n",
    "    WHERE u.id = {user_id} \n",
    "        AND (n:Song OR n:Album OR n:Artist) \n",
    "    RETURN id(n) AS id, labels(n) AS labels \n",
    "    LIMIT 100000\n",
    "    \n",
    "    UNION\n",
    "    \n",
    "    // CDs linked to liked Artists, Albums and Songs\n",
    "    MATCH (u:User)-[:LIKES]->(x)-[:APPEARED_ON]->(n:CD) \n",
    "    WHERE u.id = {user_id} \n",
    "    RETURN id(n) AS id, labels(n) AS labels \n",
    "    LIMIT 100000',\n",
    "    \n",
    "    'MATCH (u:User)-[:LIKES]->(n)\n",
    "    WHERE u.id = {user_id} \n",
    "    AND (n:CD OR n:Song OR n:Album OR n:Artist) \n",
    "    MATCH (n)-[r:APPEARED_ON]->(m:CD) \n",
    "    RETURN id(n) AS source, id(m) AS target, type(r) AS type \n",
    "    LIMIT 100000' \n",
    ")\n",
    "YIELD\n",
    "  graphName, nodeCount AS nodes, relationshipCount AS rels\n",
    "RETURN graphName, nodes, rels\n",
    "\"\"\"\n",
    "\n",
    "print(user_id)\n",
    "#with driver.session(database = database_name) as session:\n",
    "#    session.run(query)\n",
    "        \n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query, user_id = user_id)])\n",
    "dtf_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>minimumScore</th>\n",
       "      <th>meanScore</th>\n",
       "      <th>nodePropertiesWritten</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.000761</td>\n",
       "      <td>0.018063</td>\n",
       "      <td>2071</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   minimumScore  meanScore  nodePropertiesWritten\n",
       "0      0.000761   0.018063                   2071"
      ]
     },
     "execution_count": 98,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# https://neo4j.com/docs/graph-data-science/current/algorithms/eigenvector-centrality/\n",
    "query = \"\"\"\n",
    "CALL gds.eigenvector.mutate('searchdomain_preference',  {\n",
    "  mutateProperty: 'score_eig'\n",
    "})\n",
    "YIELD centralityDistribution, nodePropertiesWritten, ranIterations\n",
    "RETURN centralityDistribution.min AS minimumScore, centralityDistribution.mean AS meanScore, nodePropertiesWritten\n",
    "\"\"\"\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data.head(30)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Feature 2: Content Match with Search Input"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 99,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>graphName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>searchdomain_content</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              graphName\n",
       "0  searchdomain_content"
      ]
     },
     "execution_count": 99,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "// DELETE EXISTING PROJECTION\n",
    "CALL gds.graph.drop('searchdomain_content', false) \n",
    "YIELD graphName \n",
    "RETURN graphName\n",
    "\"\"\"\n",
    "\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "metadata": {},
   "outputs": [],
   "source": [
    "search_artist = \"jimi hendrix\"\n",
    "search_album = \"are you experienced\"\n",
    "search_song = \"purple haze\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>graphName</th>\n",
       "      <th>nodes</th>\n",
       "      <th>rels</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>searchdomain_content</td>\n",
       "      <td>141</td>\n",
       "      <td>166</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              graphName  nodes  rels\n",
       "0  searchdomain_content    141   166"
      ]
     },
     "execution_count": 101,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = f\"\"\"\n",
    "// CREATE NEW PROJECTION WITH SEARCH RELEVANT SUB GRAPH\n",
    "CALL gds.graph.project.cypher(\n",
    "  \"searchdomain_content\",\n",
    "  \n",
    "  \" // Artists, Albums and Songs which match query\n",
    "    MATCH (n) \n",
    "    WHERE \n",
    "    (n:Song OR n:Album OR n:Artist) \n",
    "    AND \n",
    "    (n.artist =~ '.*{search_artist}.*' \n",
    "    OR n.album  =~ '.*{search_album}.*' \n",
    "    OR n.song  =~ '.*{search_song}.*')\n",
    "    RETURN id(n) AS id, labels(n) AS labels \n",
    "    LIMIT 1000\n",
    "    \n",
    "    UNION\n",
    "    \n",
    "    // CDS linked to Artists, Albums and Songs which match query\n",
    "    MATCH (n)-[:APPEARED_ON]->(c:CD) \n",
    "    WHERE \n",
    "    (n:Song OR n:Album OR n:Artist) \n",
    "    AND \n",
    "    (n.artist =~ '.*{search_artist}.*' \n",
    "    OR n.album  =~ '.*{search_album}.*' \n",
    "    OR n.song  =~ '.*{search_song}.*')\n",
    "    RETURN id(c) AS id, labels(c) AS labels \n",
    "    LIMIT 1000\",\n",
    "    \n",
    "    \"MATCH (n)-[r:APPEARED_ON]->(c:CD) \n",
    "    WHERE \n",
    "    (n:Song OR n:Album OR n:Artist) \n",
    "    AND \n",
    "    (n.artist =~ '.*{search_artist}.*' \n",
    "    OR n.album  =~ '.*{search_album}.*' \n",
    "    OR n.song  =~ '.*{search_song}.*')\n",
    "    RETURN id(n) AS source, id(c) AS target, type(r) AS type \n",
    "    LIMIT 1000\"\n",
    ")\n",
    "YIELD\n",
    "  graphName, nodeCount AS nodes, relationshipCount AS rels\n",
    "RETURN graphName, nodes, rels\n",
    "\"\"\"\n",
    "\n",
    "\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)]) \n",
    "dtf_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>minimumScore</th>\n",
       "      <th>meanScore</th>\n",
       "      <th>nodePropertiesWritten</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.002552</td>\n",
       "      <td>0.070646</td>\n",
       "      <td>141</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   minimumScore  meanScore  nodePropertiesWritten\n",
       "0      0.002552   0.070646                    141"
      ]
     },
     "execution_count": 102,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# https://neo4j.com/docs/graph-data-science/current/algorithms/eigenvector-centrality/\n",
    "query = \"\"\"\n",
    "CALL gds.eigenvector.mutate('searchdomain_content',  {\n",
    "  mutateProperty: 'score_eig'\n",
    "})\n",
    "YIELD centralityDistribution, nodePropertiesWritten, ranIterations\n",
    "RETURN centralityDistribution.min AS minimumScore, centralityDistribution.mean AS meanScore, nodePropertiesWritten\n",
    "\"\"\"\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data.head(30)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Combined Search Results:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 103,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nodeId</th>\n",
       "      <th>count</th>\n",
       "      <th>score_cont</th>\n",
       "      <th>score_pref</th>\n",
       "      <th>artists</th>\n",
       "      <th>albums</th>\n",
       "      <th>songs</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>7923</td>\n",
       "      <td>1</td>\n",
       "      <td>0.291747</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>[signature licks]</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[fire (verse);, foxey lady (solo, slow);, fire...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>35734</td>\n",
       "      <td>2</td>\n",
       "      <td>0.176069</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[i don't live today, 51st anniversary, stone f...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>677</td>\n",
       "      <td>2</td>\n",
       "      <td>0.176069</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[third stone from the sun, remember, fire, can...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>136907</td>\n",
       "      <td>2</td>\n",
       "      <td>0.176069</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[love or confusion, remember, highway chile, m...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>33321</td>\n",
       "      <td>2</td>\n",
       "      <td>0.176069</td>\n",
       "      <td>0.017759</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[astro man(alchemy); - studio outtakes 1966-68]</td>\n",
       "      <td>[purple haze 1 (4);, 51st anniversary (5);, la...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>30138</td>\n",
       "      <td>2</td>\n",
       "      <td>0.176069</td>\n",
       "      <td>0.017759</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[astro man box set]</td>\n",
       "      <td>[can you see me (pre unre);, purple haze (pre ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>20709</td>\n",
       "      <td>1</td>\n",
       "      <td>0.176069</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>[jimi hendrix experience]</td>\n",
       "      <td>[the vpro archive - it must be dusty]</td>\n",
       "      <td>[mockingbird (mpeg1 video data);, spoken word,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>2023</td>\n",
       "      <td>2</td>\n",
       "      <td>0.118230</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix - the best of jimi hendrix]</td>\n",
       "      <td>[bold as love, night bird flying, if 6 was 9, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>1936</td>\n",
       "      <td>2</td>\n",
       "      <td>0.118230</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix]</td>\n",
       "      <td>[bold as love, night bird flying, if 6 was 9, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>17266</td>\n",
       "      <td>2</td>\n",
       "      <td>0.118230</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[are you experienced]</td>\n",
       "      <td>[3rd stone from the sun, remember, foxy lady, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>162186</td>\n",
       "      <td>2</td>\n",
       "      <td>0.118230</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix: the best of jimi hendrix]</td>\n",
       "      <td>[if six was nine, foxey lady, bold as love, ni...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>46232</td>\n",
       "      <td>2</td>\n",
       "      <td>0.118230</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[experience hendrix the best of jimi hendrix]</td>\n",
       "      <td>[foxey lady, dolly dagger, bold as love, if 6 ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>35582</td>\n",
       "      <td>2</td>\n",
       "      <td>0.118230</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[rescuedisland]</td>\n",
       "      <td>[ezy ryder, my friend, message to love, drifti...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>30933</td>\n",
       "      <td>2</td>\n",
       "      <td>0.118230</td>\n",
       "      <td>0.034758</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the last ever show - love and peace festival ...</td>\n",
       "      <td>[land of the new rising sun, ezy rider, room f...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>28761</td>\n",
       "      <td>2</td>\n",
       "      <td>0.118230</td>\n",
       "      <td>0.017759</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[riots in berkeley]</td>\n",
       "      <td>[hey baby (new rising sun);, pass it on (unrel...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>23144</td>\n",
       "      <td>2</td>\n",
       "      <td>0.118230</td>\n",
       "      <td>0.017759</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[la forum 26th april 1969]</td>\n",
       "      <td>[voodoo chile (slight reprise);, i dont live t...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>14428</td>\n",
       "      <td>2</td>\n",
       "      <td>0.118230</td>\n",
       "      <td>0.017759</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[black devil]</td>\n",
       "      <td>[drivin' south, the wind cries mary, red house...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>162149</td>\n",
       "      <td>2</td>\n",
       "      <td>0.118230</td>\n",
       "      <td>0.017759</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[mnic depression, wild thing (live);, star spa...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>1306</td>\n",
       "      <td>2</td>\n",
       "      <td>0.118230</td>\n",
       "      <td>0.017759</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[star spangled banner (live);, voodoo chile (s...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>38310</td>\n",
       "      <td>2</td>\n",
       "      <td>0.118230</td>\n",
       "      <td>0.017759</td>\n",
       "      <td>[jimi hendrix]</td>\n",
       "      <td>[the ultimate experience]</td>\n",
       "      <td>[wild thing (live);, star spangled banner (liv...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    nodeId  count  score_cont  score_pref                    artists  \\\n",
       "0     7923      1    0.291747    0.000000          [signature licks]   \n",
       "1    35734      2    0.176069    0.034758             [jimi hendrix]   \n",
       "2      677      2    0.176069    0.034758             [jimi hendrix]   \n",
       "3   136907      2    0.176069    0.034758             [jimi hendrix]   \n",
       "4    33321      2    0.176069    0.017759             [jimi hendrix]   \n",
       "5    30138      2    0.176069    0.017759             [jimi hendrix]   \n",
       "6    20709      1    0.176069    0.000000  [jimi hendrix experience]   \n",
       "7     2023      2    0.118230    0.034758             [jimi hendrix]   \n",
       "8     1936      2    0.118230    0.034758             [jimi hendrix]   \n",
       "9    17266      2    0.118230    0.034758             [jimi hendrix]   \n",
       "10  162186      2    0.118230    0.034758             [jimi hendrix]   \n",
       "11   46232      2    0.118230    0.034758             [jimi hendrix]   \n",
       "12   35582      2    0.118230    0.034758             [jimi hendrix]   \n",
       "13   30933      2    0.118230    0.034758             [jimi hendrix]   \n",
       "14   28761      2    0.118230    0.017759             [jimi hendrix]   \n",
       "15   23144      2    0.118230    0.017759             [jimi hendrix]   \n",
       "16   14428      2    0.118230    0.017759             [jimi hendrix]   \n",
       "17  162149      2    0.118230    0.017759             [jimi hendrix]   \n",
       "18    1306      2    0.118230    0.017759             [jimi hendrix]   \n",
       "19   38310      2    0.118230    0.017759             [jimi hendrix]   \n",
       "\n",
       "                                               albums  \\\n",
       "0                                      [jimi hendrix]   \n",
       "1                               [are you experienced]   \n",
       "2                               [are you experienced]   \n",
       "3                               [are you experienced]   \n",
       "4     [astro man(alchemy); - studio outtakes 1966-68]   \n",
       "5                                 [astro man box set]   \n",
       "6               [the vpro archive - it must be dusty]   \n",
       "7     [experience hendrix - the best of jimi hendrix]   \n",
       "8                                [experience hendrix]   \n",
       "9                               [are you experienced]   \n",
       "10     [experience hendrix: the best of jimi hendrix]   \n",
       "11      [experience hendrix the best of jimi hendrix]   \n",
       "12                                    [rescuedisland]   \n",
       "13  [the last ever show - love and peace festival ...   \n",
       "14                                [riots in berkeley]   \n",
       "15                         [la forum 26th april 1969]   \n",
       "16                                      [black devil]   \n",
       "17                          [the ultimate experience]   \n",
       "18                          [the ultimate experience]   \n",
       "19                          [the ultimate experience]   \n",
       "\n",
       "                                                songs  \n",
       "0   [fire (verse);, foxey lady (solo, slow);, fire...  \n",
       "1   [i don't live today, 51st anniversary, stone f...  \n",
       "2   [third stone from the sun, remember, fire, can...  \n",
       "3   [love or confusion, remember, highway chile, m...  \n",
       "4   [purple haze 1 (4);, 51st anniversary (5);, la...  \n",
       "5   [can you see me (pre unre);, purple haze (pre ...  \n",
       "6   [mockingbird (mpeg1 video data);, spoken word,...  \n",
       "7   [bold as love, night bird flying, if 6 was 9, ...  \n",
       "8   [bold as love, night bird flying, if 6 was 9, ...  \n",
       "9   [3rd stone from the sun, remember, foxy lady, ...  \n",
       "10  [if six was nine, foxey lady, bold as love, ni...  \n",
       "11  [foxey lady, dolly dagger, bold as love, if 6 ...  \n",
       "12  [ezy ryder, my friend, message to love, drifti...  \n",
       "13  [land of the new rising sun, ezy rider, room f...  \n",
       "14  [hey baby (new rising sun);, pass it on (unrel...  \n",
       "15  [voodoo chile (slight reprise);, i dont live t...  \n",
       "16  [drivin' south, the wind cries mary, red house...  \n",
       "17  [mnic depression, wild thing (live);, star spa...  \n",
       "18  [star spangled banner (live);, voodoo chile (s...  \n",
       "19  [wild thing (live);, star spangled banner (liv...  "
      ]
     },
     "execution_count": 103,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "CALL {\n",
    "\n",
    "    CALL {\n",
    "        CALL gds.eigenvector.stream('searchdomain_content')\n",
    "        YIELD nodeId, score\n",
    "        WHERE gds.util.asNode(nodeId):CD\n",
    "        WITH gds.util.asNode(nodeId).id AS nodeId, score as score_cont\n",
    "        RETURN nodeId, score_cont\n",
    "    }\n",
    "    RETURN nodeId, score_cont, 0 as score_pref\n",
    "\n",
    "    UNION \n",
    "\n",
    "    CALL {\n",
    "        CALL gds.eigenvector.stream('searchdomain_preference')\n",
    "        YIELD nodeId, score\n",
    "        WHERE gds.util.asNode(nodeId):CD\n",
    "        WITH gds.util.asNode(nodeId).id AS nodeId, score as score_pref\n",
    "        RETURN nodeId, score_pref\n",
    "    }\n",
    "    RETURN nodeId, 0 as score_cont, score_pref\n",
    "\n",
    "}\n",
    "\n",
    "WITH DISTINCT nodeId, count(*) as count, sum(score_cont) as score_cont, sum(score_pref) as score_pref\n",
    "\n",
    "MATCH (n:CD)\n",
    "WHERE n.id = nodeId\n",
    "OPTIONAL MATCH (n)-[:CONTAINS]->(ar:Artist)\n",
    "OPTIONAL MATCH (n)-[:CONTAINS]->(ab:Album)\n",
    "OPTIONAL MATCH (n)-[:CONTAINS]->(so:Song)\n",
    "\n",
    "RETURN nodeId, \n",
    "count,\n",
    "score_cont, score_pref,\n",
    "collect(DISTINCT ar.artist) as artists,\n",
    "collect(DISTINCT ab.album) as albums, \n",
    "collect(DISTINCT so.song) as songs\n",
    "\n",
    "\n",
    "ORDER BY score_cont DESC, score_pref DESC\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "dtf_data = pd.DataFrame([dict(_) for _ in session.run(query)])\n",
    "dtf_data.head(30)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
